[
    {
        "header": "Crisis at Christmas | Volunteer position | Flexible | All levels welcome | London (UK) on-site / Remote",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "Not a job job but I'm hoping to find volunteers who can help us end homelessness in the UK for good.Crisis is a homelessness charity in the UK. Our flagship event is Crisis at Christmas, where we open homeless shelters during the Christmas period where many other homelessness facilities close and the homeless population face loneliness during the festive period. We provide shelter, warmth, food and drink, activities and entertainment, Internet Cafe, international phone calls, and most importantly advice services to get people out of homelessness for good.There's a ton of IT that goes on: We need internet connectivity to run our centres (and to provide our clients with Wi-Fi), software to manage everything that goes on in a centre like inventory / incidents / client relationships, making sure we have enough IT supplies like hardware (desktops, tablets and printers), and the list goes on. On top of that, we need a robust service desk to help our (also volunteer) users if they run into issue with IT.We would appreciate any volunteers in any IT specialities (hardware, software, SRE, VoIP, tech support, etc) in any level (student, starting out or years in the field) to join us and help out with developing and maintaining IT solutions to ensure our event is a success and lift people out of homelessness. As a volunteer at Crisis myself, I've learnt a lot of things I wouldn't have a chance to do in my real job, and that's what makes it interesting to volunteer here.I can be reached at timothy.choi (at) crisis.org.uk if you have questions or would like to know more."
    },
    {
        "header": "Magdalena Ridge Observatory | $80,000-$85,000/annum | Full-time | Socorro, NM, USA | Senior Software Engineer | ONSITE | VISA",
        "location": [
            "Magdalena",
            "NM",
            "USA"
        ],
        "european": false,
        "description": "The Magdalena Ridge Observatory Interferometer (MROI) is an optical/near-infrared astronomical interferometer being built in central New Mexico, USA. It is being developed by a team of engineers and scientists at the New Mexico Institute of Mining and Technology (NMT) and the University of Cambridge, UK. When completed, it will be a 10-telescope array capable of imaging objects with 50 times greater detail than the James Webb Space Telescope.We are in the process of installing the second telescope on the array and anticipating “first fringes” in a few months, while the third telescope and beamline components are expected to arrive in about a year.We are looking for an experienced software engineer to help develop the control and sequencing software to run the MROI system autonomously. They will assist the team in the initial deployment of the MROI and early scientific observations of astronomical and geosynchronous objects with this new cutting-edge facility.Detailed advertisements for the positions can be found at:https://www.nmt.edu/hr/employment.phpPlease contact:\nMichelle Creech-Eakman (michelle.creecheakman@nmt.edu) if you have questions about the post."
    },
    {
        "header": "Qdrant | REMOTE | Full-time | https://qdrant.tech | https://github.com/qdrant/qdrant",
        "location": [],
        "european": false,
        "description": "Qdrant is a leading open-source Vector Database provider.We are Looking for Technical Writer, Integrations Engineer, Database Tester, Developer Advocate(s).All jobs https://qdrant.join.com"
    },
    {
        "header": "Platform.sh | REMOTE | Full-Time | https://platform.sh",
        "location": [],
        "european": false,
        "description": "Platform.sh is a unified, secure, enterprise-grade platform for building, running and scaling fleets of websites and applications.We serve thousands of customers worldwide including The United Nations, The Financial Times, Adobe Commerce/Magento, Shopware, Orange, University of Missouri and The British Council.We are among the momentum leaders in Cloud PaaS according to G2 https://www.g2.com/categories/cloud-platform-as-a-service-paas?utf8=%E2%9C%93&selected_view=trending&segment=all#gridRecently, we have finished $140 million series D funding.Here's how it works (get a free trial and go crazy):Pick a template from https://github.com/platformsh-templates and customize it (add your assets, specify infra) as per https://docs.platform.sh/overview/structure.htmlThen push to your Platform.sh repo, BOOM! magic happens and you have a working site that you can branch, test, customize, go-live. Dead simple, you don't need Kubernetes, just basic git knowledge.Tech stack is LXC with some Python awesomeness, Puppet, Ceph and GlusterFS. Tooling is in Python and Go. Yep, we are multi-cloud (AWS, Azure, GCP, ...).What I love:• Great work-life balance (remote only company, you can work on a contract, but you also get PTO incl. your national holidays, parental leave)• Lots of smart people from around the world• Work on interesting stuff• Company shares (discretionary)• Good comp package, pick your HW, get reimbursed for trainings and other stuffJoin us https://platform.sh/company/careers/"
    },
    {
        "header": "Matanuska Telecom Association | Software Engineer - Systems Engineer | Full-Time | Alaska (UTC-9): REMOTE",
        "location": [],
        "european": false,
        "description": "MTA is an Alaskan ISP serving the southwest area of the state. The software team consists of 7 devs who support a relatively complex business enterprise environment. We're looking to add another Software Engineer and a dedicated Systems Engineer (DevOps) to our team.As the hiring manager I want to be clear about a few things:- This is a 70 year old enterprise telecom, not a high speed startup- This job may interest you if you want great benefits and long-term job stability- We have an existing environment running onsite on VMWare; the Systems role is designed to support, improve, and make adjustments to our tech stack over time- Our core backend language is F# these days (replacing Haskell after 5+ years in production), frontend is ReactSoftware Engineer: https://mta.csod.com/ux/ats/careersite/4/home/requisition/597?c=mtaSystems Engineer: https://mta.csod.com/ux/ats/careersite/4/home/requisition/600?c=mta"
    },
    {
        "header": "Ride with GPS | Experienced Linux Systems Engineer | Within 2 hours of Portland OR | Full Time | https://ridewithgps.com/about",
        "location": [
            "Portland"
        ],
        "european": false,
        "description": "We are the world's largest library of bike routes, and we enable cyclists to go on better rides, more often. We have a website and mobile apps that allow people to discover the best riding in their area, and get turn by turn navigation using either our mobile apps or the bike computer of their choosing. Come join us in taking Ride with GPS to the next level! We have one opening right now:- Linux Systems Engineer: https://ridewithgps.com/careers/systems_engineer - Work the full deployment stack, from hardware to containers. We are looking for an experienced engineer practiced in the deployment of Linux based machines and services on top of them. We run on a rack of machines that we own, co-located in the Pittock, and we deploy services both directly on Linux as well as via containers. This is part SRE, part DevOps, part classic SysAdmin, with the occasional networking issue. We need someone who is within driving distance of our rack in Portland and who has experience working in a datacenter, but the majority of the job is in the deployment of services on those machines, not the machines themselves. Are you a jack of all trades, comfortable occasionally working with hardware, while being highly proficient in Linux and container based deployments? Maybe you are light on modern container orchestration but are highly capable and interested in learning? We'd love to talk to you!Send resume + cover letter to careers@ridewithgps.com with an optional brief paragraph about your relationship to cycling or the outdoors. Riding bikes is not required, but we do find it helps!"
    },
    {
        "header": "CodeWeavers | St Paul, MN, USA | Full Time | REMOTE | Wine and General Open Source Developers | C-language systems programming",
        "location": [
            "USA"
        ],
        "european": false,
        "description": "https://www.codeweavers.com/about/jobsCodeWeavers needs new, full-time developers to improve Wine's ability to run games and other types of software and integrate well with the native operating system and other system components. Positions are available to work on a variety of Wine-based software, including CodeWeavers's own CrossOver product; the Proton project for Valve Software; and projects for other clients and software internal to CodeWeavers.We are hiring remote programmers, US or international, as well as workers local to Saint Paul, Minnesota. We will consider relocation, if desired, on a case-by-case basis. Please see link above for information, benefits, requirements, and how to apply.Please direct any questions to the email address on our Jobs page."
    },
    {
        "header": "Equal Experts | Multiple Roles | Bengaluru/Pune, India - Hybrid/Remote | Full-time | https://equalexperts.com",
        "location": [],
        "european": false,
        "description": "Equal Experts is an innovative consultancy specialising in the delivery of custom software solutions for blue-chip enterprise and public sector clients across a range of industry sectors. We work on important projects for our clients, deliver market-leading propositions across the digital, online and mobile channels, and are recognised for our leadership in the application of agile and lean delivery methods to assure delivery. We have offices in Australia, Germany, India, South Africa, the UK and the USA.At Equal Experts, we foster a collaborative environment where you can use your diverse skills and work closely with clients, enabling them to enhance their products and add tangible value. It's a world where you collaborate with talented individuals who share your passion, continuously learn new technologies, and implement best practices.Currently, we are actively recruiting for several senior or lead roles, requiring relevant industry experience:  - Front-end Engineer - 6+ yrs\n  - Data Engineer - 6+ yrs\n  - DevOps Engineer - 6+ yrs\n  - Tech Principal - 10+ yrs\n  - Product Owner - 10+ yrs (in Tech) with atleast 5+ yrs in a Product-focused role\n\nIf you are interested, please send your resume to sudeep.giri@equalexperts.com and include \"HN: Who is Hiring\" in the email subject line."
    },
    {
        "header": "Sourcegraph | REMOTE | Full-Time | Head of AI, Head of ML Infra, Applied ML Scientist, Engineering Manager, DevOps, Developer Advocate, Product Designer, Product Manager | https://sourcegraph.com",
        "location": [],
        "european": false,
        "description": "Sourcegraph is a code AI platform that makes it easy to read, write, and fix code–even in big, complex codebases.We are building Cody, an AI coding assistant that uses code search and code intelligence to help devs quickly understand what's happening in code and generate new code that matches the best practices in your codebase. Cody supports AI-enabled autocompletion, fixing bugs, refactoring, test generation, code explanation, and answering high-level questions. You can read Steve Yegge's (our Head of Eng) post on why Cody's code context engine differentiates it from the fast-moving field of AI dev tools: https://about.sourcegraph.com/blog/cheating-is-all-you-need.Apply here: https://grnh.se/0572f98b4us"
    },
    {
        "header": "Figma | https://www.figma.com/ | San Francisco, New York City, and US remote | Full Time",
        "location": [
            "San Francisco",
            "New York City",
            "US"
        ],
        "european": false,
        "description": "Selected job postings here (all compensation in annual base salary range for SF/NY hubs):- Engineering Director - Machine Learning ($280,000—$381,000 USD): https://boards.greenhouse.io/figma/jobs/4953079004- Engineering Director - Server Platform ($282,000—$410,000 USD): https://boards.greenhouse.io/figma/jobs/4868741004- ML/AI Engineer ($168,000—$350,000 USD): https://boards.greenhouse.io/figma/jobs/4756707004- Software Engineer - FigJam ($168,000—$350,000 USD): https://boards.greenhouse.io/figma/jobs/4339815004===Born on the Web, Figma helps entire product teams brainstorm, create, test, and ship better designs, together. From great products to long-lasting companies, we believe that nothing great is made alone. Come make with us!Figma recently made 200 fixes and improvements to Dev Mode: https://news.ycombinator.com/item?id=37226227Keeping Figma fast — perf-testing the WASM editor: https://news.ycombinator.com/item?id=37324121"
    },
    {
        "header": "Goody | Remote within North/South America | $170-240K + equity and benefits | Full-time",
        "location": [],
        "european": false,
        "description": "Goody is hiring a Senior Software Engineer (Ruby, Rails, React) who moves at a startup pace, likes to ship fast, and is motivated by building delightful products.I'm Mark, the technical co-founder and CTO at Goody. Despite being something everyone does, gifting is one of the areas of commerce yet to be disrupted. Our goal is to make people's days by making gifting easy, while building a sustainable business on that market opportunity.We're looking for engineers who like to build at a startup pace, have a critical eye for detail and user experience, and thrive when given autonomy and ownership.Our product is used by Google, Stripe, Meta, NBCUniversal, Notion, and others, and we also offer a developer API for commerce.Take a look at our application (and a cool WebGL thing I built for it) at https://jobs.ongoody.com/swe and feel free to email me at mark@ongoody.com."
    },
    {
        "header": "Da Vinci Trading | Software Engineer | C++, Python | Full-time | Amsterdam, Netherlands | ONSITE | Base salary EUR 80K to 120K",
        "location": [
            "Amsterdam",
            "Netherlands"
        ],
        "european": true,
        "description": "Da Vinci is a small trading company where traders, researchers, and software engineers all work closely together. You can have huge and immediate impact: the code you write may already be in production in a matter of hours, with your users sitting next to you. This is the work environment we offer: here, you get to make a difference, take full ownership of your projects and be an integral part of the core business.Developing a trading system is no simple task, with challenges ranging from building extremely latency-critical applications where nanoseconds matter, to tackling architectural challenges to ensure scalability and robustness.\nIn your role as a software engineer you will be working on a wide variety of applications, including:\n- automated trading strategies,\n- connectivity with various exchanges,\n- risk and compliance controls,\n- data analysis scripts and tools,\n- user interfaces.You can get a feel for how it is to work here by watching: https://www.youtube.com/watch?v=P61dPC4wOxs\nRead more and apply: https://davincitrading.com/job_openings/c-software-engineer/"
    },
    {
        "header": "TriumphPay | https://triumphpay.com | Senior Engineers | REMOTE (USA only) | Full Time | $170-$218K",
        "location": [
            "USA"
        ],
        "european": false,
        "description": "At TriumphPay, we are building the transportation payments network for the future. With our payments and audit products, we touch more than $37B in annualized freight volume in the United States. Our customers use our products to solve real world problems and operate in our software all day every day. This is both exciting and also an incredible responsibility.We are looking for experienced full-stack engineers to join our team of 35+ engineers. You will work closely in a team of 3-5 people on a specific project. Inside this team, you will manage your own backlog and schedule. We rotate teams and work areas quarterly to give you a breadth of experience. We are a fully remote engineering organization that believes strongly in work life balance and strong boundaries. We care about our environment because we know that we do our best work when we are happy and feel valued.We have two stacks we're looking to fill positions in. One made up of .NET/React, and another utilizing Rails (with Sorbet) and Elm.Engineering Role ($170-$218K): https://jobs.tfin.com/senior-software-engineer-open-to-remote/job/26169033"
    },
    {
        "header": "Crusoe | Onsite/Hybrid – SF, Denver, Chicago | Climate Tech, Cloud Compute, Distributed Systems, Crypto | https://www.crusoeenergy.com/",
        "location": [
            "Denver",
            "Chicago"
        ],
        "european": false,
        "description": "Crusoe is on a mission to align the future of computation with the future of the climate.Data centers consume more than 1% of the world's electricity.  We power data centers with stranded energy such as flare gas  and underloaded renewables, so for every GPU hour you use on Crusoe Cloud, you're offsetting 0.5kg of CO2e, or approximately 4.4 metric tons over an entire year. The more compute you use, the more CO2 and other greenhouse gasses you offset.Crusoe Cloud (https://crusoecloud.com/) offers the cleanest and lowest-cost GPU cloud computing solution in the world for workloads including graphical rendering, artificial intelligence research, machine learning, computational biology, therapeutic drug discovery, simulation and more.Here's a quick video so you can see what the systems look like in action, flames and everything: https://www.youtube.com/watch?v=Rlt8k71QuqwHigh Priority Open Roles: \n- Staff/Senior Site Reliability Engineer\n- Staff/Senior Infrastructure Engineer\n- Staff/Senior Software Engineer\n- Solutions EngineerFull list of roles here: https://jobs.ashbyhq.com/Crusoe?utm_source=Hackernews \nQuestions? Email: careers@crusoeenergy.com"
    },
    {
        "header": "InfoSum | Technical Support Specialist | Full-time | London, UK",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "InfoSum provides data clean rooms, a privacy-enhancing technology that powers identity online.If you’re a wiz with AWS, GCP, know your way around SQL and databases, and have some familiarity with adtech, then get in touch with me at my firstname (dot) my lastname (at) Infosum (dot) com.I want to talk to you about our Senior Technical Support Specialist role."
    },
    {
        "header": "Aqora | Senior Frontend Developer (React) & Senior Backend Developer (Python/FastAPI) | Full-time | Paris (HQ) or Remote within Europe",
        "location": [
            "Paris"
        ],
        "european": true,
        "description": "About us:We help corporations quickly get winning results by constructing, launching and managing quantum computing challenges. Think Kaggle but for quantum computing.We have a history of orchestrating successful quantum hackathons around the globe, partnering with major industry players. These collaborations have already yielded six-figure revenues, with more such ventures in the pipeline.This stage marks a greenfield opportunity, offering prospective teammates the chance to sculpt our platform's very foundation.Roles:1. Senior Frontend Developer (React):\nTech Stack: React at its core with a good sense for UI/UX. Experience with quantum computing visualizations or similar tasks is advantageous.2. Senior Backend Developer (Python/FastAPI):\nTech Stack: Python, FastAPI. A passion or foundational understanding of Quantum Computing can set you apart.General Requirements for both roles:- Demonstrable expertise in the specified senior role.- A natural inclination for problem-solving coupled with meticulous attention to detail.- An affinity or existing rapport with quantum computing is considered beneficial.What we offer:- A competitive package- Equity possibilities for those aligning with our vision.- Office space in the famous Station F co-working space in Paris.How to Apply:Email us at contact@quantx.fr with your resume, a concise introduction, and pertinent portfolio or GitHub links.Join the quantum revolution with us and carve out its trajectory!"
    },
    {
        "header": "Grit | Senior/Staff Software Engineers / ML Engineers | New York or (rarely) Remote | Full-time | $150–250k + equity",
        "location": [
            "New York"
        ],
        "european": false,
        "description": "We’re building software to automatically fix technical debt. We do this by combining expressive static analysis tooling (we’ve built a developer-friendly query language for code) with machine learning to automatically migrate code to new patterns and platforms. We’re deployed thousands of successful changes for initial customers and have raised a $7M seed round from top investors (led by Founders Fund). We’ve solving challenges at the intersection of machine learning and programming languages using Rust, TypeScript, and LLMs. We’re hiring for both smart generalists and PL/ML experts who are interested in collaborating on problems like automatically inserting new types into codebases and automated unit test regression-fixes.Here are a few reasons you might be interested in applying:- We’re working on the edge of the possible and doing deep work in parsers/language design and machine learning.- We mostly work in-person in New York, but remote is also possible for outstanding candidates who have proven success in a remote model.- I’m personally committed to providing quick feedback for everyone who applies.Learn more at https://www.grit.io/careers or email morgante@grit.io."
    },
    {
        "header": "PostHog | Full-Time | Distributed systems engineer lead, full stack and ex technical founder engineers | Remote (all remote) | Hiring GMT-8 to GMT+1",
        "location": [],
        "european": false,
        "description": "PostHog helps engineers build better products. we launched on HN during a YC batch in 2020 and have been growing very fast ever since.* open source, building a dev tool. We have a public handbook (posthog.com/handbook) if you want to learn how we work, pay and more in complete detail.* we are a real business... nearly at $10M ARR / profitability in sight / lots of capital* we are growing through more autonomy and transparency not through process.* we are under a ton of pipeline pressure due to how much we've grown usage (~5x per year at the moment) - we need help rewriting our ingestion for the next 2 years of scale whilst dealing with 1 million events/minute being ingested. this will be very hard, but it is the _biggest_ challenge our company faces. revenue and growth are coming easily.* goal is to build a company worth $10s of billions, by building wide first (we are the all in one platform with lots of tools) then going upmarket way later (similar product and go to market to Atlassian). we grow entirely through word of mouth and content marketing, not from outbound sales.* we need: a distributed systems engineer to lead our pipeline team. you'll be working alongside experienced people who've worked at places like datadog/meta/twitter in this small team (currently 4 people).* we are also hiring: ex technical founders and front-end oriented full stack engineers!posthog.com/careers"
    },
    {
        "header": "Democratic Data Exchange | Technical Lead, Development Manager, Product Manager | Remote US Only | Full-time",
        "location": [],
        "european": false,
        "description": "Technical Lead – MIG | Salary Range: $175,000 to $200,000 | https://ddx.recruitee.com/o/technical-lead-migProduct Manager | Salary Range: $150,000 to $175,000 | https://ddx.recruitee.com/o/product-manager-migDevelopment Manager | Salary Range: $120,000 to $140,000 | https://ddx.recruitee.com/o/development-managerFounded in 2019, the Democratic Data Exchange (DDx) is a for-profit company that aims to expand access to data within the Democratic and progressive ecosystem by facilitating the real-time blind exchange of program data across the ecosystem and providing easy-to-use tools to help clients accomplish their goals.https://demexchange.com/"
    },
    {
        "header": "Meliora Therapeutics | San Francisco, CA and Full Remote | Full-time",
        "location": [
            "San Francisco"
        ],
        "european": false,
        "description": "Meliora Therapeutics is leveraging modern biology and machine learning to drastically improve the efficiency of cancer drug development. In short, the vast majority of cancer drugs fail in clinical trials, and off-target effects are often to blame. We're using sophisticated genomic and machine learning techniques to accurately characterize how drugs affect cells and thereby to develop new drugs more efficiently. Our platform has already surfaced a number of interesting candidate drugs with promising laboratory validation and we are just getting started.Our founding team has strong experience in software, machine learning, and biology developed through experience at Google, Verily, Benchling, and the Yale School of Medicine. We are moving with urgency to capitalize on the opportunity ahead of us after raising our $11mm seed round last year. We are backed by leading funds who were early investors in world class companies such as Gilead, Recursion, Insitro, Benchling, and others.We're looking for talented, ambitious, and creative technical experts to join us in building a machine learning-driven cancer drug development engine. Some of our current open roles include:\n- Machine Learning Scientist (Graph Neural Networks, Multimodal ML)\n- Data Scientist, Computational Biology (cancer biology experience is a huge plus!)See our careers page for information on these and other roles and to apply: https://www.melioratx.com/careers. Previous experience in biology or computational biology is not required for every role.If you have any questions feel free to reach out via email: zach@melioratherapeutics.com"
    },
    {
        "header": "Helio https://helio.exchange | Senior Cloud Engineer | Switzerland Zurich, On-Site Hybrid | Full Time (80-100%) | CHF 100-130k + equity and benefits",
        "location": [],
        "european": false,
        "description": "We are a Swiss startup based in Zurich and build the first carbon-aware cloud by increasing the utilization rates of data centers worldwide. We're focusing currently on the 3D render market (providing compute for rendering 3D animations) but will expand to further areas as we grow. We have a core product with scheduling and billing included where you'll mainly work on.Join us as a Senior Cloud Engineer and develop our core and render product further. We utilize various cloud providers and work with Kubernetes and Cluster API. You'll mainly develop Go code and deploy and monitor it on our production cluster. You'll work closely with our Growth team and contribute to the ongoing success of our projects. \nWe are a small team looking to expand to accelerate our growth.Tech Stack:  - Go\n  - Kubernetes (including custom operators)\n  - Cluster-API, ArgoCD (GitOps), Argo Workflows\n  - Windows and Linux containers\n  - Prometheus (Cortex)\n  - PostgreSQL\n\nMore details here: https://helio.exchange/jobs/senior-cloud-engineerTo apply, please email to jobs@helio.exchange. Traditional CVs or Cover letters are unnecessary.Interview process: We review your profile, have a short 30min interview with the Founders, Connect with our team (getting to know them plus technical fit interview) and then join us with a flexible starting date.We're looking also for:  - Senior Fullstack Software Engineer (Remote)\n  - Windows Software Engineer 3D Tools (Remote)\n  - and others, check out https://helio.exchange/jobs for more."
    },
    {
        "header": "AREO | Remote (EU) | Full-Time | Equity | No Visa Sponsorship",
        "location": [],
        "european": false,
        "description": "Roles: [Senior Android Developer, Senior Backend (Ruby on Rails) Developer]Hi, my name is Marius and I am the CTO at AREO (https://www.goareo.com - placeholder because we are still in stealth).We are a young but quickly growing software startup based in Germany that specialises in the development of Augmented Reality (AR) solutions for supermarkets and grocery retail stores.Our B2B SaaS AR platform helps store employees by providing real-time access to inventory, product information, and POIs. The founders (me and Eike) have more than 10 years of experience with startups and grocery retail.We are currently looking for seasoned Android and Rails developers with at least 6 years of experience, a knack for crafting clear, well-documented code, a passion for comprehensive testing and an appreciation for beautifully designed products.For the mobile devs familiarity with AR apps, AR frameworks (AR Foundation, ARCore, ARKit) and AR glasses is a big plus.\nFor both roles being able to understand at least a bit of German would come in handy but is not a must-have :)Backend Stack: Ruby / Rails (7.x), StimulusJS / Hotwire, AlpineJS, Redis, Postgres, Docker, Sentry, DigitalOcean, OpenAPIMobile Stack: Kotlin, Room, Jetpack Compose, ARCorePerks: Work when and where you are most productive, potential for leadership role, sizeable equity in a rapidly growing company, work with cutting-edge AR tech.Apply here: marius[here comes the at sign]goareo.com and mention “HN” in the subject.We’ll respond to every application."
    },
    {
        "header": "OpenRent | London, UK | Full-Time | ONSITE+PART REMOTE | https://www.openrent.co.uk",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "What sucked the last time you rented a house or flat? Come and fix it.OpenRent is a force for good in an industry tarnished by rip-off agencies. Enabled by an unrelenting focus on technology, we now let more properties than any agency in the UK. In the last 12m we let over £45 billion worth of property, to over 5 million registered users, without ever charging any admin fees.You'll be working on things that vary from machine learning models to predict the right price of a property, to the future of property management, all to help tenants find their dream home, and landlords their ideal tenant.We're VC backed, profitable, and have plenty of ambition to maintain our fast growth in this absolutely massive market.We have a bunch of roles available at the moment and keen to find great people like you!- Senior Web Designer | Equity | 75k-100k+ (based on experience) + Quarterly Bonus- Full Stack Engineer (C#) | Equity | £45k-£120k+ (based on experience) + Quarterly Bonus- Senior DevOps Engineer | Equity | 75k-100k+ (based on experience) + Quarterly BonusAll roles visible here: https://www.openrent.co.uk/jobsOpenRent is already impacting millions of tenants and landlords each year, join us and make every tenancy better than the last."
    },
    {
        "header": "FUTO | https://futo.org | Austin, TX or Remote | Full time and interns",
        "location": [],
        "european": false,
        "description": "FUTO is an organization dedicated to the development of software that returns control of computers and technology to the people. We’re particularly interested in giving people more privacy and control from big tech. We also give grants to open source projects in line with our mission (see our site).Bare metal software/systems engineer - https://futo.org/jobs/baremetal-engineer/UI/UX designer - https://futo.org/jobs/ui-ux-designer/Release engineer - https://futo.org/jobs/release-engineer/Interns - email jobs {at} futo.org"
    },
    {
        "header": "CrazyGames | https://about.crazygames.com/ | REMOTE | Full-time | Product Engineer",
        "location": [],
        "european": false,
        "description": "With recent technologies such as WebGPU and WebAssembly, the browser has become a powerful gaming platform. High-quality 3D graphics and near-native level performance are becoming possible without the need for downloads, apps, or platform-specific development. Our browser games platform is already reaching more than 25 million people per month. We are self-funded, profitable, remote-first, and fast-growing. We are currently looking for a Product Engineer to build our product together with a small elite engineering team and a world-class designer:* https://crazygames.recruitee.com/o/remote-product-engineerMore information here: https://about.crazygames.com/"
    },
    {
        "header": "Broad Institute of MIT and Harvard | Cambridge, MA | Software Engineers | HYBRID",
        "location": [
            "Cambridge",
            "MA"
        ],
        "european": true,
        "description": "The Broad Institute of MIT and Harvard is a leading, world-renowned research organization that pioneers new ways to treat and prevent disease. Our dynamic team, comprising a diverse community of researchers and scientists, is at the forefront of genomic medicine and data analysis, always pushing the boundaries of what is possible in biomedical research. You will contribute to projects of global significance and have the opportunity to showcase your work as many of our projects are open-source. We offer a comprehensive benefits package and flexible remote work setting, fostering an inclusive environment. If you're excited about working on groundbreaking projects and making a real-world impact, come join us!Software Engineer: You'll be involved in developing the seqr platform which is used by an international consortium of collaborating clinicians, researchers, and industry partners, to significantly improve their ability to search through large genomic datasets and make discoveries and diagnoses. seqr is core to our efforts both in the Rare Genomes Project and the Broad Center for Mendelian Genomics, and has already enabled us to provide genetic diagnoses to more than 2,000 rare disease families. We are now looking for a full-stack software engineer that will help with the next phase of this project (https://docs.google.com/document/d/16Byq42oUSIIpDomIhy9XIyHs...).To apply, email Larry (lbabb@broadinstitute.org) with a resume."
    },
    {
        "header": "IHI Terrasun | Senior Data Engineer | Remote or Hybrid Chicago, IL",
        "location": [
            "Chicago"
        ],
        "european": false,
        "description": "We are energy storage systems solution provider for some of the largest DC and AC coupled solar plus storage sites in the world. We provide solutions for utility scale sized systems for a variety of purposes including the storage of solar energy, grid stabilization, and peak shifting events. Our solutions help provide consistent power to millions of homes across US and Canada.\nOur team runs edge services which manages metrics ingestion, visualization, alarms and analysis systems needed to understand how the system is behaving, create reports, and suggest preventative maintenance.We process millions of metrics per second and need senior data engineers for developing systems to manage data both in flight and at rest. We primarily work with Python, Golang, Kubernetes, Docker and VictoriaMetrics (Prometheus). Apply here: https://boards.greenhouse.io/ihiterrasun/jobs/4144824005"
    },
    {
        "header": "Viator | Tech Lead and Senior Software Engineer | Full time | Hybrid On-site & Remote | UK, Portugal",
        "location": [
            "UK",
            "Portugal"
        ],
        "european": true,
        "description": "Viator is a Tripadvisor brand that’s looking for engineers to join a growing team to help travellers find the best experiences on their trips.We’re looking for full stack and backend engineers at all levels.  The hybrid roles require you regularly visit an office in London, Oxford or Lisbon but not be there full time.Technical Manager - https://grnh.se/c28030211usSenior Software Engineer - https://grnh.se/ed18386b1usLead Data Engineer - https://grnh.se/f170ae1f1usData Engineer  - https://grnh.se/5091a4a31us"
    },
    {
        "header": "PlantingSpace | Full-time | Remote (EU time zone) with quarterly gatherings | https://planting.space",
        "location": [],
        "european": false,
        "description": "We are building a system which accurately represents knowledge and uncertainty, to enable the discovery of insights and transparent problem solving.Job openings:- Automation Software Engineering: development of tools, infrastructure and processes for our team- NLP Engineering: creating subsystems based on transformer models for natural language and structured data- Software Engineering (mid and -senior): production backend engineering and development of algorithms- Strategy & Business Development: defining our product strategy, pilot customers, and go to marketUseful experience: algorithms, bayesian statistics, symbolic computing, optimization, category theory, information theory.If you want to learn more about our company, get some insights into what it’s like to work in our team and participate in our retreats, check out our YouTube page: https://www.youtube.com/channel/UC3t82qavONuLBAr_JAUCSvATo see a full list of openings, and to apply, follow our Join Us page: https://planting.space/joinus"
    },
    {
        "header": "Tailscale | Windows Software Engineer | US/Canada | REMOTE | Full-time | $180-$265k",
        "location": [
            "Tailscale",
            "US",
            "Canada"
        ],
        "european": false,
        "description": "Unusual role because we do most of our programming in Go, but we are knee-deep in win32 APIs for configuring exotic parts of the Windows networking stack. If you like working with win32, it is a lot of fun!https://tailscale.com/careers/\nhttps://boards.greenhouse.io/tailscale/jobs/4179818005"
    },
    {
        "header": "Anysphere (https://anysphere.co)| Full-time | On-site | San Francisco, CA, USA | ML / Full-stack Engineers",
        "location": [
            "San Francisco",
            "CA",
            "USA"
        ],
        "european": false,
        "description": "We're building Cursor (https://cursor.sh), an AI powered code editor. We're on a mission to automate most of software engineering you do today.About Us: We've raised a seed round from OpenAI. Our product is used by tens of thousands of engineers, and our paid plan is growing extremely fast. Our small team has won IMO/IOI gold medals, published in Nature, and includes YC founders and creators of popular programming competitions.The Roles: We're looking for a fantastic founding full-stack engineer and a founding ML engineer:  * Full-stack: You'll ship fast, own the design and implementation of features end to end, and work on tricky product, infrastructure, and performance problems.\n\n  * ML: You'll be challenged to improve the Q&A, bug finding, and code editing abilities of our editor. You will have access to all the compute you need and will be able to do things with OAI's models almost no one else can.\n\nPlease reach out to hiring@anysphere.co with your resume if interested."
    },
    {
        "header": "Owner.com | Remote | Full-time",
        "location": [],
        "european": false,
        "description": "Owner.com’s mission is to help local business owners survive by leveling the playing field – by giving them an all-in-one solution to take back control of their business and truly own their online presence. The Owner platform powers everything from their SEO-optimized website to their online ordering system, while providing powerful email marketing and loyalty programs, reputation management, recruiting solutions, and more.We use TypeScript, Node.js, Next.js, Vue, and React Native.- Staff Backend Engineer: https://jobs.lever.co/owner/bc10ecf0-9f61-452e-8e47-a6218bf441f5?lever-via=Bbc-wNM4sz- Staff Product Designer: https://jobs.lever.co/owner/1ea22e90-87fc-470d-8045-cb4a1596d0bd?lever-via=Bbc-wNM4sz- Staff Frontend Engineer: https://jobs.lever.co/owner/e469d024-b40d-4232-b906-c07784a893cf?lever-via=Bbc-wNM4sz"
    },
    {
        "header": "Kanary | Backend Engineering Lead | Seattle, Remote (US or Canada) PST Preferred | Comp Estimate: $150k base + 3% Equity",
        "location": [
            "Seattle",
            "US",
            "Canada"
        ],
        "european": false,
        "description": "We’re using large scale browser automation and LLMs to scrub your private info (home address, phone number, emails) off the public internet.We’re a team of 5, backed by top pre-seed VCs like YC and 2048 and privacy leaders like Mozilla. 2 years since our first raise, we’re funded by our customers.Titles at our stage don’t matter much. We’re looking for a strong engineer to help grow the product and the team as we respond to rapid customer growth. The most challenging work at Kanary is backend development. You’ll own projects like:- experiment with novel approaches for anonymously traversing the web (captcha solving, browser fingerprinting, residential IPs). Embrace the cat and mouse game of working against the bad guys.\n- performance engineering - identify and implement optimizations across application code (API, serializers, data models), database and deployment configuration. We use python and django on our backend.\n- minimize QA time and code repetition by working with generative models and extending our templating language using Go.Compensation depends on experience and potential but we aim to be fair and competitive with equity and salary. If this sounds like fun, reach out to our founder, rachel[at]kanary.com.Please format your subject with “HN” in the title for a faster response :)Learn more about our company: https://www.kanary.com/"
    },
    {
        "header": "Rewind (https://rewind.ai) | Full-time | Remote | https://rewind.ai",
        "location": [],
        "european": false,
        "description": "Rewind is a well-funded, 20-person, remote-first startup building a truly personalized AI. Rewind captures everything you see, hear, or say, and makes it searchable. Our investors include Sam Altman (OpenAI CEO), Alexis Ohanian (Co-Founder of Reddit), and many other tech leaders.We are hiring for:Senior/Staff/Principal Windows Engineer - https://jobs.lever.co/rewind.ai/b07e3b06-0e66-4531-a524-823899505af5Head of Hardware Engineering - https://jobs.lever.co/rewind.ai/2f54a17e-923d-43db-bdd2-2f46ac142053Senior/Staff/Principal Applied AI Engineer - https://jobs.lever.co/rewind.ai/0af8dbea-ebd2-481b-9fd4-7b34de3ea83cFor more information about our benefits and culture (including quarterly retreats, top of the line gear, etc), check out https://rewind.ai/careers"
    },
    {
        "header": "Uncountable | SF, NYC, Munich | Full-Stack Engineering",
        "location": [
            "SF",
            "Munich"
        ],
        "european": true,
        "description": "https://www.uncountable.com/hiring/hn\nUncountable accelerates R&D for industrial scientists across leading materials, chemicals, and life sciences organizations. With our SaaS solution, our customers get better products to the market in half the time. Uncountable was founded by MIT and Stanford engineers and has been profitable since 2016. Our team has grown from 20 to 50 over the last two years.\nFull-Stack Engineers | $120k - $220k + Equity---> Uncountable is looking for engineers who can spearhead the development of the Uncountable Web Platform. The position is heavily product-driven and comes with challenges across the stack.--> Senior and principal positions are available.--> Summer internships and working student positions are also available.Learn more: https://www.uncountable.com/hiring/hnUncountable has offices in San Francisco, New York City or Munich. Remote flexibility is available for senior candidates within the SF or NY metro areas.Contact our CTO directly at jason@uncountable.com"
    },
    {
        "header": "Patch | Senior Software Engineer | SF or Remote (USA, Canada) | Full-time",
        "location": [
            "Canada"
        ],
        "european": false,
        "description": "https://www.patch.io/careers - Backed by a16z, Coatue, and Energize Capital, among others.Patch is building the software platform and infrastructure for the carbon market of the future. Our Carbon Access Platform helps suppliers and buyers connect via marketplace (https://www.patch.io/purchase), API (https://www.patch.io/api), or multi-year offtake agreements (https://www.patch.io/offtake). CarbonOS (https://www.patch.io/carbonos) is purpose-built to help carbon credit suppliers run every aspect of their business.We are a small team of experienced engineers, distributed across the US and Canada. We are hiring a few more well-rounded engineers to come help us build a better future for the next generations.Please apply via our jobs page. I can be reached at jean@patch.io and I'm happy to answer any questions."
    },
    {
        "header": "SpruceID (YC W21) | Full REMOTE | Multiple Roles | Full-Time | spruceid.com",
        "location": [],
        "european": false,
        "description": "Spruce lets users control their data across the web. We are creating the world’s best open source software for user-centric digital identity. Instead of users logging into platforms, we think platforms should ask permission to access data vaults controlled by users.We hire programmers who love technology and are committed to intellectual honesty, user privacy, and innovation. Our products are composed from a combination of industry-trusted frameworks, applied cryptography, new interoperable identity standards (W3C, ISO/IEC, IETF, and OpenID), and custom backend libraries.Select roles:Technical Success Manager: Work with external customers and stakeholders, maintaining implementation roadmaps, collaborating on product roadmaps, and documenting user stories, timelines, and implementation strategy at the customer level.Software Engineer, Android: Build software prototypes and product features from start to finish for Android and iOS, embedding our Rust core.See all roles here: https://jobs.lever.co/sprucesystems/"
    },
    {
        "header": "Course Hero | Toronto, Canada; Vancouver, Canada; Remote - India | Various Engineering, Product, Machine Learning, Analytics roles | Full-time, Hub-Based / Remote | https://grnh.se/2ywlpf Course Hero is an online learning platform where students can access over 40 million course-specific study resources contributed by a community of educators and other students. We envision a world where every student graduates, confident and prepared. We were recently valued at $3.6B and are actively hiring!",
        "location": [
            "Toronto",
            "Canada",
            "Vancouver",
            "Canada"
        ],
        "european": false,
        "description": "We are hiring for the following roles: - Senior/Staff/Lead Software Engineers - Front End, ML Platform, & Full Stack (5+ YOE) - Senior Data Scientists (5+ YOE)Our tech stack: React, Typescript, Sass, Go, Python Come join us on our journey to help invent the future of student learning!"
    },
    {
        "header": "Mayo Clinic | $100,256 - $147,389 / year | Remote or Onsite | Full Time | Mayo Clinic will not sponsor or transfer visas for this position including F1 OPT STEM.",
        "location": [],
        "european": false,
        "description": "Mayo is a not for profit -- want to do some cool tech stuff for a good cause and advance the field of neurology?We're still reviewing applicants for a google cloud engineer for the Neurology AI Program at Mayo Clinic. I just presented the work that we've been doing and our architecture at Google Next this week. You can see the presentation here (I start presenting around 11 minutes in).https://www.youtube.com/watch?v=Zrl4daZ_dZMIf you're interested, you can apply here: \nhttps://jobs.mayoclinic.org/job/rochester/it-cloud-engineer-remote/33647/52413165472"
    },
    {
        "header": "FlightAware | multiple roles | REMOTE (US timezones) | Houston / US | https://flightaware.com/about/careers/",
        "location": [
            "US",
            "Houston",
            "US"
        ],
        "european": false,
        "description": "Hello from FlightAware! We are hiring for a few positions, including 2024 summer interns and Senior Software Engineer on our flight Tracking team. Our team is headquartered in Houston, Texas, but we work as a distributed team and accept remote applicants for work within the United States.FlightAware has built the world’s leading aviation software platform, processing over 180 million incoming messages an hour from over 30,000 feeds—over 2TB a day and growing—to provide the best, most complete, and most accurate real-time flight tracking services in the industry. We use Python, Rust, C++, JavaScript, and TypeScript. We are proud to have built a wide variety of successful products on this foundation that have become central to the aviation industry at large."
    },
    {
        "header": "Datable | Senior Full Stack Engineer | Remote / West Coast US | Full-time | $150k-$200k + equity",
        "location": [],
        "european": false,
        "description": "Do you find metrics, logs, and traces fascinating and infuriating in equal measure? We’re doing something about it, so come work with us!Datable is a building an on-premise data pipeline focused on inspecting, transforming, and routing observability data.We are a seed stealth startup based on the US West Coast. Our tiny team has a lot of experience in this space, and we’re looking for an engineer happy to roll up their sleeve and get their hands dirty from Terraform to Tailwind. We strongly believe in the strength of Product, Design, and Engineering collaborating together to build better products. You’ll have a lot of autonomy to try new things along the way, and will have a huge impact on building our first product release.Our work is heavily based on best practices from OpenTelemetry and years of experience in the observability world. Our stack is primarily Typescript, React, NodeJS, and Postgres.Email me directly at julian@datable.io"
    },
    {
        "header": "Snout https://www.snoutplans.com/ | Senior Software Engineer | Remote US | Full Time | $120k + equity and benefits",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Join us at Snout on our mission to ensure no one ever has to make a health decision for their pet based on the cash in their back account. Snout plans pay for 100% of routine veterinary care, unlimited visits, and additional member benefits - think pet insurance, that you will actually use every year.You will be working on our core wellness product, launched late-2022. Work includes the addition of new wellness plan features and capabilities, enhancement of user experience, testing and operation of the wellness platform, and special projects that arise from time to time. We frequently work cross-functionally and you can expect to write code and perform technical operations for our marketing, sales, and support efforts, as well.Our tech stack includes Node.js, React, PostgreSQL, AWS, and Tailwind. We use both JavaScript and TypeScript heavily.We’re a small startup team consisting of fewer than ten people. Successful team members are comfortable participating in spirited and detailed debates to establish product and technical plans, and then taking initiative and ownership to deliver on those plans quickly and effectively. Our team is collaborative. You can expect to meet with the team on a daily basis, pair regularly, and participate in slack discussions throughout the day. We keep pacific work hours and expect the team to be available during 9a-5p at a minimum. If you’re looking for a team where you can carve out your area of responsibility, work with experienced partners who have your back, grow your role alongside the growth of the company, and take a product to the moon, then we should talk.To apply, please email kyle@snoutplans.com.Our typical process is a one hour technical interview followed by a casual 30 minute meeting with our whole team."
    },
    {
        "header": "Coop | Onsite | Austin, TX | Full-time | UI / UX Designers | Computer Vision / Full stack Engineers |",
        "location": [],
        "european": false,
        "description": "My name is AJ Forsythe and I'm the Founder / Chief Chicken Tender at Coop! We're an Austin TX based tech company on a mission to democratize chickens + build the largest decentralized food production network. It's insanely fun to work on and we have a shot at building a huge business in the connected urban farming space. Check out www.Coop.Farm to see what we’ve spent the last 18 months on as we’re building the world’s best chicken coop. We’re a 1 week away from entering production and are seeing hundreds of thousands of dollars of Coop pre-orders - It's a super exciting time and are seeing directional product market fit which I'm thrilled about.We’re a tight-knit team of 6 people with 10+ years of experience working together. We’ve been through Y Combinator, started and scaled multinational million-dollar businesses together, taking them from idea to acquisition by a Fortune 50 company. We’re gritty and passionate without taking ourselves too seriously - and we’re here to build something really exciting that helps people reconnect with their food and the planet.We’re looking to hire: \nFull stack Engineer with Computer vision bonus focus. https://coop.rippling-ats.com/job/479868/-founding-full-stac...UI / UX Product Designer - https://coop.rippling-ats.com/job/512664/-founding-ui-ux-product-designer-build-stuff-that-matters-in-chickens-agtechWe're VC backed (a few $m+) by some of the best investors and are having a blast building this business. if this resonates with you we would love to talk - You can reach me directly at: AJ[at]Coop.Farm. A short email about why you're interesting and the right fit is all we need to get started."
    },
    {
        "header": "Canvas (The Spatial Computing Company) | Full-time | Onsite | Remote |",
        "location": [],
        "european": false,
        "description": "At Canvas, we’re working on spatial computing - using computer vision to 3D reconstruct and understand your surroundings so that software can operate over real-world spaces. We believe it will power the next generation of augmented reality and some of the key parts of virtual reality as well.C++ Engineer (Portugal or Remote Europe) | \nFull Stack QA (Portugal or Remote Europe) | \nWebGL Engineer (Portugal or Remote Europe) | \nSales Development Representative (Remote North America) | \nProduct Manager  (Remote North America) | \nProduct Manager, 3D Modeling Tools (Remote Europe)For detailed information check out https://canvas.io/jobs.Keywords: 3D, computer vision, photogrammetry, geomatics, SLAM"
    },
    {
        "header": "Upwave | Senior Software Engineer | $150k-$175k + equity + benefits | Remote-first (US Timezones) | Full-time | https://www.upwave.com/careers",
        "location": [],
        "european": false,
        "description": "About Upwave:Upwave is a YC/venture-funded SF-based startup that helps large enterprises plan, measure, and optimize brand advertising campaigns. We offer a comprehensive set of tools that help our Fortune 500 clients understand and improve how they’re perceived in the marketplace, how aware consumers are of the value they provide, and how much consumers trust them to provide the value they promise. We've been rapidly expanding our list of enterprise customers and deepening our integrations with \"household name\" partners like Amazon and Clorox. As we grow, we need engineers to help us build even more unique, differentiated, valuable, scalable, and robust analytical SaaS tools and products.About the Role:We are looking for an Adtech-experienced engineer who’s excited about doing the wide variety of technical work that modern SaaS startups need. That includes backend web development (JVM frameworks), frontend SPA development (mostly React), AWS-based cloud engineering, and some data engineering. We are also particularly interested in someone who knows (or is interested in learning) the intricacies of our industry and our business and who is comfortable leading conversations with customers and partners to scope, define, and execute the technical integrations that have become one of our major levers of growth. We're not fixated on years of experience, but this role is unlikely to be right for someone with less than 10. Our team emphasizes high-quality, high-velocity, sustainable software development in a collaborative and inclusive team environment. We’re a small team that gives our engineers a lot of autonomy and empowerment, and we want people who are excited to step in to learn whatever skills or technologies are needed, to contribute wherever in the R&D process they're needed, and to grow their careers by taking on pivotal responsibilities early in their tenure.If you are interested, email me directly: matus@upwave.com or check out the specific role https://www.upwave.com/job/6815819002/"
    },
    {
        "header": "Epistemic AI | Data or Full-Stack Eng | Remote | Full-Time | https://www.epistemic.ai",
        "location": [],
        "european": false,
        "description": "We (Epistemic AI) are looking to hire a new data engineer to work on the data foundations of our Epistemic AI platform – anywhere between UTC-8 and UTC+3.Requirements:- you get shit done- you want to work remotely- you are great to work with- you think that working on democratizing access to AI for biomedical research is a very important personal goalOur technology stack is based on AWS (Cloud), Python 3, Tensorflow, Pytorch (NLP, ML, Deep Learning), Graph databases, Typescript and React (Frontend). We have a CI/CD pipeline and a continuous release process. We train ML and NLP models on clusters of GPUs on Amazon and on Google Cloud TPUs."
    },
    {
        "header": "Metaphor AI | software engineer, AI researcher | SF | Full Time | https://platform.metaphor.systems/",
        "location": [
            "SF"
        ],
        "european": false,
        "description": "Metaphor connects LLMs to the internet's knowledge. We've developed novel representation learning techniques and crawling infrastructure so that LLMs can intelligently find relevant information. Our first public beta, Metaphor V1, is the only internet-scale neural search engine.Email us at hello@metaphor.systems w/ whatever you think is relevant to being successful at our job, whether that's a resume, Linkedin, or just a paragraph about why you're interested in working with us!"
    },
    {
        "header": "Balletic Foods | Onsite positions in Davis, CA | Full Time",
        "location": [],
        "european": false,
        "description": "Fermentation Scientist | Balletic Foods is seeking a motivated and enthusiastic Scientist to lead our fermentation team.Balletic Foods™ is a California based company working towards a sustainable food system by combining science and technology to create new sources of animal-free protein. If you are passionate about using biotechnology to build sustainable new sources of protein, join our team of scientists and entrepreneurs to change the world’s food system.If you are interested in this position, please contact careers@balleticfoods.com"
    },
    {
        "header": "Spacelift | Remote | Europe | Full-time | Senior Software Engineer",
        "location": [],
        "european": false,
        "description": "We're a VC-funded startup building an automation platform for Infrastructure-as-Code, adding a Policy-as-Code layer above it, in order to make IaC usable in bigger companies, where you have to take care of state consistency, selective permissions, a usable git flow, etc.On the backend we're using 100% Go with AWS primitives. We're looking for backend developers who like doing DevOps'y stuff sometimes (because in a way it's the spirit of our company), or have experience with the cloud native ecosystem. Ideally you'd have experience working with an IaC tool, i.e. Terraform, Pulumi, Ansible, CloudFormation, Kubernetes, or SaltStack.Overall we have a deeply technical product, trying to build something customers love to use, and already have a lot of happy and satisfied customers. We promise interesting work, the ability to open source parts of the project which don't give us a business advantage, as well as healthy working hours. We've also got investment days on Fridays, when you can work on anything you want, as long as it could possibly benefit Spacelift in some way.Right now we're mostly looking for engineers for our Growth team, which focuses on accelerating the adoption of Spacelift and reducing the time necessary for new users to get into our platform. The team follows data-driven decisions to track the progress and works closely with business partners and other departments to align product vision.If that sounds like fun to you, please apply at https://spacelift.teamtailor.com/jobs/3006934-software-engineer-remote-europeYou can find out more about the product we're building at https://spacelift.io and also see our engineering blog for a few technical blog posts of ours: https://spacelift.io/blog/engineeringPS: Fear not, no whiteboarding!"
    },
    {
        "header": "BillionToOne | Menlo Park, CA; hybrid (US only) | Full-time",
        "location": [
            "Menlo Park",
            "US"
        ],
        "european": false,
        "description": "BillionToOne, ranked at the top 5% of Y Combinator companies with $300M+ in funding from prominent VC firms, has developed a DNA molecular counter that increases cfDNA diagnostic resolution by over 1,000x. BillionToOne's first product, UNITY™, is the first and only non-invasive prenatal test that can directly screen an unborn baby and assess its risk for common and severe recessive gene disorders and chromosomal abnormalities, as well as fetal sex and fetal antigens, from a single tube of blood from the pregnant mother without paternal testing.We are hiring for the following roles: - Senior/Staff Software Engineers\nOur tech stack: python,django,postgres based application hosted on Heroku/AWS\nCI/CD: CircleCI\nVersion control: github\nObservability: Sentry,Datadog\nBug tracking: JIRAFor more details check out: https://boards.greenhouse.io/billiontoone/jobs/4305991005 and https://boards.greenhouse.io/billiontoone/jobs/4203247005"
    },
    {
        "header": "Loop | loop.com | Product/Design/Engineering | On-site San Francisco, CA, Chicago, IL | H1B OK",
        "location": [
            "San Francisco",
            "CA",
            "Chicago"
        ],
        "european": false,
        "description": "We build connected finance for logistics. We want to make the billing and payment process as smooth as consumers paying for online goods while unlocking hundreds of billions of working capital for businesses. Loop can help trillions of dollars move more efficiently and improve millions of people’s livelihoods.1. Raised $65m from JPM GEP, Founders Fund, 8VC, Susa Ventures, Flexport, Index, and Expa.2. 35 paying enterprise customers with multiple-year contracts; 60+ customers in the pipeline.3. High-caliber team of engineers and operators from Google, Scale AI, Flexport, Uber, Rakuten, Square, Meta, Stanford, Brown, and Yale.4. 9+ years cash runwayProduct Manager, Servicing Platform - https://boards.greenhouse.io/loop/jobs/4826377004Product Designer - https://boards.greenhouse.io/loop/jobs/4126037004Fullstack Engineer San Francisco - https://boards.greenhouse.io/loop/jobs/4102236004If you do not see your role list here but are excited about what Loop is building, send a note to founders at loop.com."
    },
    {
        "header": "Fraunhofer Institute for Digital Medicine MEVIS | Public sector collective wage agreement | Full-Time | Bremen/Lübeck/Berlin, Germany | DevOps Engineer",
        "location": [
            "Berlin",
            "Germany"
        ],
        "european": true,
        "description": "At Fraunhofer MEVIS we pursue a patient-centered and clinical workflow-oriented approach to solving clinically relevant challenges in image- and data-based diagnosis and therapy (e.g., MRI analysis and surgery planning). To deliver excellent results, our research and development teams increasingly rely on our on-premises cluster and cloud infrastructure to compile, test, and deploy our software products, or train state of the art deep learning models.As a DevOps Engineer, you will join a motivated team and improve the on-premise infrastructure. Our daily work involves the HashiCorp stack (Nomad, Vault, Terraform), Puppet, Ansible, OpenStack, and more. Additionally, we support our research personnel with CI/CD setups employing Jenkins and GitLab.For more information, visit our job board  or contact me \ndirectly:https://jobs.fraunhofer.de/job/DevOps-Engineer-Digital-Medicine/904050001/\nsebastian.hoeffner@mevis.fraunhofer.de"
    },
    {
        "header": "Railway | engineering | Remote | https://railway.app/careers",
        "location": [],
        "european": false,
        "description": "Tired of trying to beat kube into shape? Does writing YAML to ship code fill you with utter dread? Dream of a future where deploying software is simple, and you don't need an army of infrastructure engineers to build that perfect janky bash script™ to make life easy?We're Railway, and we think infrastructure can be better. So far we've built out a platform loved by hundreds of thousands of users who simply tell us \"Give me Postgres\", \"Deploy this repo\", and we make it happenWe were recently named to the 2023 Nasdaq \"Enterprise 30\" list: https://www.enterprisetech30.com/listFair warning! The problems are complex: home-rolled hypervisors, cut-above container orchestration, over/under/whateverlay networks, virtio device drivers, edge proxies, IAM that doesn't suck, kitchen sinks - we need to build it and we're looking for likeminded individuals who think this stuff is fun.If that sounds like you, please apply at railway.app/careers. We have a number of roles, but are prioritizing the following:Platform Engineer - GeneralPlatform Engineer - OrchestrationSupport EngineerSolutions ArchitectSee you soon, and happy shipping."
    },
    {
        "header": "Upnext | 100% Remote | Full Time / Contract | Software Eng / Design / ML",
        "location": [],
        "european": false,
        "description": "At Upnext, we are passionate about solving information overload.  Every day we get bombarded with content from social networks, news sites, blogs, messages, etc.  It’s hard to keep up and it’s even harder to find the content that really matters to you.  It takes time and energy to sift through the noise and find what really matters. That's why we created Upnext, our flagship product that lets users easily organize reading, audio, and video content in one neat space.  We’re not stopping there, our latest app helps you stay up to date on the topics and news that you care about by aggregating updates into a single place.  Using our own AI models we’re building in deep personalization from the beginning so Upnext users will always have the most important updates about topics they care about\n.\nWe've got open roles for:- Software developers: our tech stack is TypeScript / Node / React / React Native- Designers: we're creating a seamless, beautiful experience across desktop, native and web- ML research / ML engineer: help us design build and deploy our first generation of recommendation and understanding systems- Marketing / growth: help us get the word out!If you'd like to chat, email me at joe [at] upnext [dot] in!"
    },
    {
        "header": "InScope | Full-Time | Founding Engineer | San Francisco Bay Area, ONSITE",
        "location": [],
        "european": false,
        "description": "I'm Avy, CTO and co-founder at [InScope](https://inscopehq.com), where we're automating financial statements and audits. My co-founders, Mary and Kelsey, suffered many audits first-hand as finance and accounting leaders at high-growth tech companies like Flexport, Miro, Yelp, and Dropbox.Investors and other stakeholders require audited financials from private companies that hit certain growth milestones, ensuring the health of the company before they can receive funding or raise debt. Today, finance teams prepare for their audits using Word, Excel, and a whole lot of human effort. We're seeking to change that with software.We are participating in Better Tomorrow Ventures' fintech accelerator and are looking for an experienced founding engineer. The role will be fast-paced: You will set up systems from scratch, solve a mix of full stack product engineering problems, and build AI-infused data workflows. Our early prototypes are built with Python, Typescript, React, dbt, and DuckDB, but you'll help us choose our production stack.We believe in distributed teams and will be flexible about remote work, but early-on we expect you to be based in San Francisco to allow for fast collaboration cycles.Send me a note at avy@<the-domain-listed-above>, or you can find more info here: https://www.notion.so/Founding-Engineer-Full-Stack-35060b2a2e4f47649dce4ff4d71ba5de"
    },
    {
        "header": "Respondology | REMOTE (US Based) | Full-Stack Software Engineers | Full-time | https://respondology.com/",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Respondology is working on an important mission to eradicate hate, abuse and spam online, starting to dive headfirst into LLM / Generative AI technologies to make social media a better place. We are a small team that just raised our recent Series A round and are rapidly growing.\nWe are looking to hire Software Engineers (Full Stack) [115k-140k + equity].\nOur core tech stack is: React, Ruby-on-Rails, Postgres, AWS.\nWe are based out of Boulder, CO, but the engineering team is distributed across the US.Learn more here: https://respondology.com/careers/ or reach me at huan at respondology.com"
    },
    {
        "header": "Datadog | Software Engineers | ONSITE (Boston, Lisbon, Madrid, NYC, Paris, Tel Aviv) and (some) REMOTE | Full-time",
        "location": [
            "Boston",
            "Lisbon",
            "Madrid",
            "NYC",
            "Paris",
            "Tel Aviv"
        ],
        "european": true,
        "description": "Datadog is a monitoring, tracing, logs system, and more, for your infrastructure and services. We build our own tsdb, event store [1][2], distributed tracing tools, cutting edge visualizations, and more. We love shipping great experiences for customers just like us and are growing fast! We write a lot of Go, Java, Python, Typescript (with React), and a bit of other languages. We run on k8s, and are multi-region and multi-cloud.We're looking for people who can build systems at scale as we process trillions of events per day. Let us know if that's you!https://dtdg.co/hnwhoshiring[1] https://www.datadoghq.com/blog/engineering/introducing-husky[2] https://www.datadoghq.com/blog/engineering/husky-deep-dive/"
    },
    {
        "header": "PBS Distribution | Senior Data Engineer | Arlington, VA | Full-time, Hybrid | https://pbsdistribution.org",
        "location": [
            "Arlington",
            "VA"
        ],
        "european": false,
        "description": "It's a beautiful day to work at PBS Distribution!We bring high-quality public media content like \"Grantchester\", \"Finding Your Roots\", \"Wild Kratts\", Ken Burns documentaries, and yes, \"Mister Rogers' Neighborhood\" to Amazon Prime Video, Apple iTunes, YouTube, and other popular streaming services.This generates a lot of data! Our Data Engineering team is responsible for building in-house systems and working with third-party vendors to turn customer viewing data into actionable insights. Our systems support key decisions about the content we invest in, where it plays, and how it gets promoted.We are looking for a versatile Senior Data Engineer with 3+ years of experience supporting large data systems (1B+ rows) with complicated ETL processes. You should have extensive experience with all of the following keywords: Python, Pandas, SQL, DBT, git, Postgres, Redshift, Docker.Learn more about PBS Distribution here: https://pbsdistribution.orgRead more about the position here and apply here: https://pbsdistribution.org/careers/#available-openings"
    },
    {
        "header": "Walrus Security | Full Stack Developer | Full-time | Remote (US) or onsite in NYC | https://walrusfi.com | $120k–$230k + equity",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Today, there is a massive gap at the core of electronic payments: there is no way to pay someone and be sure you're paying the right person. Many people have been hurt by this problem; losses have been enormous. Walrus is solving it. Our first product has created a new category: it verifies the safe transfer of financial information and assets. It works by combining AI, proprietary authentication, and novel UX. Our sales, which are considerable, have all been from word-of-mouth; the bottom line is that customers love it.\nOur company is well-funded, seed-stage, and very much product-oriented. We are seeking an experienced full stack engineer to join as developer #3, with commensurate equity. You will own new modules and features; examples include payments, reputation, and new kinds of authentication.Tech stack: Vue, Django, Postgres, GCPMore info and application: https://jobs.ashbyhq.com/walrusfi/73368276-b189-4e8a-8ac5-b67c4e1b201c"
    },
    {
        "header": "Computer Science Faculty | Full-Time | Visa Support Available | Onsite (Burlington,VT)",
        "location": [
            "VT"
        ],
        "european": false,
        "description": "Make an impact in computer science education at Champlain College! We're seeking passionate candidates for a Computer Science faculty position in the Division of Information Technology & Sciences. We embrace small class sizes, interdisciplinary approaches, and hands-on learning. Whether you hold a Ph.D. or a master's degree with industry accomplishments, your expertise is valued here. Apply today to be a part of our inclusive and innovative community at Champlain College.We are especially interested in candidates with at least some background in machine learning. Our program is highly applied as we are a professionally focused school. In addition to our core CS curriculum, we offer concentrations in artificial intelligence, software engineering, and mobile application development.As a teaching college, faculty generally teach a 4/4 load with other responsibilities including service and professional development.Explore the full Job Details\nhttps://champlain.interviewexchange.com/jobofferdetails.jsp?JOBID=166088"
    },
    {
        "header": "Horizon3.ai | Multiple Roles | Full Time | Bay Area, RTP, Boulder | https://www.horizon3.ai/join-our-team/",
        "location": [],
        "european": false,
        "description": "The product: NodeZero provides autonomous penetration testing delivered as a self-service SaaS offering. Red Teams use NodeZero as a force multiplier that can conduct infrastructure pentesting at-scale so humans can be a scalpel. Blue Teams rely on NodeZero to proactively harden their infrastructure. SOCs use NodeZero as a sparring partner to tune their security tools. CISOs use NodeZero’s results to prove their security posture to their boards, auditors, and regulators. NodeZero is safe to execute against production systems and is designed to enable a Purple Team culture by helping Red and Blue Teams work together to fix problems that truly matter.The company: Horizon3.ai was founded in 2019 by former industry and U.S. National Security veterans with the mission to help organizations see their networks through the eyes of the attacker and proactively fix problems that truly matter, improve the effectiveness of their security initiatives, and ensure that they are prepared to respond to real cyberattacks.Engineering Roles  - Senior Software Engineer - Backend\n  - Senior Software Engineer - Frontend\n  - Senior Software Engineer - Systems/Platform\n  - Senior Software Engineer - Offensive Security Expert\n  - Technical Product Manager\n  - Senior Application Security Engineer\n\nWe recently raised a $40M Series C round: https://www.crunchbase.com/organization/horizon3-ai"
    },
    {
        "header": "QUOBYTE Engineering | Berlin, Germany | Full-time | ONSITE | https://www.quobyte.com/",
        "location": [
            "Berlin",
            "Germany"
        ],
        "european": true,
        "description": "At Quobyte, we are working on the Data Center File System (DCFS), a highly scalable and fault-tolerant software storage system built around a parallel file system core. Customers use Quobyte DCFS for ML and HPC clusters in industry and academia, k8s and OpenStack infrastructures, streaming, web mail, post production, origin and CGI clusters, and as a scalable backend for SaaS products. There are Quobyte DCFS clusters which span thousands of machines and crunch 100s of GB/s!Under the hood, DCFS is a full-stack storage system, written in Java and C++. The engineering work covers everything from kernel development over our own replicated database system design to distributed algorithms (Paxos!) and performance. In short: lots of real-world challenging and fun problems! We work as a highly efficient engineering team, and do mandatory code reviews, lots of unit and integration testing,Santa Clara, CA:* Customer Success Engineer* Sales EngineerBerlin, Germany:* Software Engineer* Customer Success Engineer* Sales Executive* Marketing ManagerFor detailed job descriptions please and application process, please visit https://www.quobyte.com/company/careers or write to work at quobyte.com."
    },
    {
        "header": "Fy! | Software Engineer | London or Remote (UK) | Full-time | https://www.iamfy.co",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "Fy! is an art, home and living marketplace that lets people discover, create and shop for their home - leveraging unique generative AI-powered shopping experiences that are personalised ‘For You!’Generative AI is transforming how people shop home & living and we’re the first mover globally in this $800bn market. One of Europe's fastest-growing consumer brands, we are an ambitious team of creators, designers, analysts and coders split between offices in London, Berlin and Zoom. We're backed by top European & US VCs and angels who've previously worked or invested in businesses such as Deliveroo, Thread, Instacart, SuperAwesome and ASOS to name a few.We're hiring for a full-stack software engineer. We use Clojure across the stack - previous Clojure experience is not a requirement.More info here: https://iamfy.notion.site/iamfy/Software-Engineer-c29d91cc245f4a26857a0aa9733c57bePlease quote 'HN Who's Hiring' when you apply"
    },
    {
        "header": "Zilliz | Full-time|Software|Marketing|Sales|Engineering| Redwood City, CA| NYC| Onsite -Hybrid -Remote",
        "location": [
            "Redwood City"
        ],
        "european": false,
        "description": "Zilliz is a fast-growing startup developing the industry’s leading vector database company for enterprise-grade AI. Founded by the engineers behind Milvus, the world’s most popular open-source vector database, the company builds next-generation database technologies to help organizations quickly create AI applications.Roles we are hiring for:Staff Software Engineer, Machine Learning Platform |FTE| https://app.careerpuck.com/job-board/zilliz/job/4057480005Staff Software Engineer, Distributed Systems |FTE| https://app.careerpuck.com/job-board/zilliz/job/4057484005Solutions Architect |FTE| : https://app.careerpuck.com/job-board/zilliz/job/4256138005Developer Advocate |FTE| NYC https://app.careerpuck.com/job-board/zilliz/job/4307910005Marketing Coordinator [Contract to Hire] https://app.careerpuck.com/job-board/zilliz/job/4286911005"
    },
    {
        "header": "Wikimedia Foundation| US$85,925  to US$134,289 | Full-Time | 100% Remote | Site Reliability Engineer |https://wikimediafoundation.org/about/jobs/",
        "location": [],
        "european": false,
        "description": "The Wikimedia Foundation,the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects is hiring a mid-level Site Reliability Engineer (SRE) to join our SRE team, where we take care of the infrastructure that runs wikipedia.org and other Wikimedia Foundation projects. We are responsible for the entire infrastructure stack, from multiple data centers, through networking and interconnects, to 1000s of servers and the application stack that runs on them.Fore more information, please visit our job board: https://grnh.se/e30043911us"
    },
    {
        "header": "Sudowrite | REMOTE | Full-Time | Competitive Salary + Equity | Hiring: Machine Learning Engineer",
        "location": [],
        "european": false,
        "description": "- We believe the future of writing is AI & human collaboration. Sudowrite is the best AI for creative writers.- We are profitable with a rapidly growing paying user base.- We've been featured in The New York Times, New Yorker, Verge, etc.- We believe new tools will enable a renaissance in art & creativity and we want to help the next generation of storytellers tell better stories.Wanted: Machine Learning Engineers (who also write!)- We’re 100% remote and support work-life balance. We meet up in person a few times of year, last time in Hawaii. We encourage diverse candidates from all over the world to apply.- Details: https://sudowrite.notion.site/We-re-hiring-engineers-to-make-writing-magical-389c57f5ae3a421d8f8c0b48c8407e88"
    },
    {
        "header": "PlaytestCloud | Tech Lead Ruby on Rails (f/m/d) | Berlin, Germany | Full Time | Visa Support | Remote or Onsite, you decide | www.playtestcloud.com",
        "location": [
            "Berlin",
            "Germany"
        ],
        "european": true,
        "description": "Founded in 2014, PlaytestCloud helps game studios create games that players love! We help studios to reduce churn and drop-out rates while improving user-experience and player satisfaction. By doing so, real players can shape the mobile games of tomorrow. Our product has been used by more than 45 of the top 100 grossing games currently in the Apple App Store. Of the game studios that make these top 100 games, 60% are PlaytestCloud customers - which makes us an undeniable leader in mobile games user research.We're a diverse team of 38 employees, working in 9 countries and representing 18 different nationalities, and we're seeking a Tech Lead Ruby on Rails (f/m/d) to join us across a variety of projects and areas of expertise.At PlaytestCloud, you'll act as the principal engineer, be the primary technical contact person for product management, and lead the software design and development of new features. You will have the opportunity to make a direct impact by bringing exciting new features to market. You will act as the technical lead, working closely with a team of 10 people in our product department. Not being a people manager, you’ll have a great balance between hands-on coding and understanding how to translate business requirements into tech specs.Apply directly at https://playtestcloud.breezy.hr/p/6f96c70c6be2-tech-lead-ruby-on-rails-f-m-d-100-remote-possible or send your resume to talent@playtestcloud.com"
    },
    {
        "header": "Papernest | Back-end/Front-end/Fullstack/QA Engineer | Full Time | Paris or Barcelona, On-Site",
        "location": [
            "Paris",
            "Barcelona"
        ],
        "european": true,
        "description": "Papernest is the solution that revolutionizes the management of your contracts and subscriptions. To move all your arrangements with you, save money on your housing bills, and optimize your daily subscriptions. All this is for free in a few minutes, online or over the phone.Eight years after our launch in 2015 in Paris, more than 1,5 millions users in France, Spain and Italy, a growth from 2 to 900 employees, the opening of 3 new offices in Reims, Barcelona and Warsaw, we are now at a turning point in our growth with the upcoming launching of thrilling projects.After officially becoming our own insurance provider in France in 2021 and an energy provider in France at the beginning of 2023, we are now expanding to the Spanish energy market, and are building the team that will tackle this new exciting opportunity.There are several projects included in this, the tech stack is mainly python/django/drf for the servers, Angular for the clients, deployed on aws.You can send me an email at ivan.prunier (at) papernest.com or visit https://careers.papernest.com/jobs?department=Tech&query="
    },
    {
        "header": "Solar Monkey | Engineering Manager | Remote or On-site | The Netherlands - The Hague | Full-time | https://jobs.solarmonkey.nl/o/engineering-manager-job?utm_ca...",
        "location": [
            "The Netherlands - The Hague   Full"
        ],
        "european": true,
        "description": "Solar Monkey | Engineering Manager | Remote or On-site | The Netherlands - The Hague | Full-time | https://jobs.solarmonkey.nl/o/engineering-manager-job?utm_campaign=2023-09-EngineeringManager&utm_source=HackerNews&utm_medium=blogpostAt Solar Monkey (https://solarmonkey.io/), we love making an impact by accelerating the transition to solar energy. We do this by giving solar installers super powers with our innovative software. This allows them to work much more effectively and install even more solar installations.We are well funded and expanding, and currently looking for a full time Engineering Manager with a passion for leading high-performing software development teams. Do you thrive in fast-paced environments and want to be part of a SaaS scale up that's revolutionising the solar energy industry? If so, we have the perfect opportunity for you!We are looking for a technical leader to inspire, mentor and grow an effective team of software engineers. You have a background in software engineering and your passion for problem solving will be pivotal in helping us scale our team, processes and product. You promote high standards, leading the team by creating a challenging environment and providing the support and guidance needed to succeed.Interested? Here’s the job link: https://jobs.solarmonkey.nl/o/engineering-manager-job?utm_campaign=2023-09-EngineeringManager&utm_source=HackerNews&utm_medium=blogpost"
    },
    {
        "header": "Prequel | https://prequel.co | Senior Software Engineer | Full Time | GoLang, Postgres, Typescript, React, K8s | $150k-$180k + equity | ONSITE in NYC",
        "location": [
            "GoLang",
            "Postgres",
            "Typescript",
            "React"
        ],
        "european": true,
        "description": "Prequel is an API that makes it easy for B2B companies to connect and sync data directly to their customer's data warehouse.\nWe're a small team of five engineers based in NYC. We're solving a number of hard technical problems that come with syncing tens of billions of rows of data every day with perfect data integrity: building reliable & scalable infrastructure, making data pipelines manageable without domain expertise, and creating a UX that abstracts out the underlying complexity to let the user share or receive data. We're powering this feature at companies like LogRocket, Modern Treasury, Postscript, and Metronome.Our stack is primarily K8s/Postgres/DuckDB/Golang/React/Typsecript and we support deployments in both our public cloud as well as our customers' clouds. Due to the nature of the product, we work with nearly every data warehouse product and most of the popular RDBMSs.We're looking for a full stack engineer who can run the gamut from CI to UI. If you are interested in scaling infrastructure, distributed systems, developer tools, or relational databases, we have a lot of greenfield projects in these domains. We want someone who can humbly, but effectively, help us keep pushing our level of engineering excellence. We're open to those who don't already know our stack, but have the talent and drive to learn.// Full job posting here -- https://prequelco.notion.site/Senior-Software-Engineer-Prequel-prequel-co-46e7f02427a14f0bae4fec56c0a95f38// To apply -- email jobs at prequel.co and include [HN] in the subject line"
    },
    {
        "header": "Bond | Technical Product Manager / Platform Engineer / Senior Software Engineer | Full-time | U.S. REMOTE | https://www.bond.tech/careers",
        "location": [
            "U.S."
        ],
        "european": false,
        "description": "Bond is a startup building an embedded finance platform, focusing on credit, that helps brands and fintechs to launch financial solutions quickly with our APIs and SDKs. Here is an article about a product we launched last year: https://www.prnewswire.com/news-releases/bond-launches-life-changing-embedded-credit-product-301608154.htmlWe recently got acquired by FIS, being retained as an independent entity with our own autonomous team and brand, which means we’ve kept the pace and learning-potential of our startup ethos while having the resources of a much larger company to accelerate our R&D.Currently hiring for a few critical roles on our product/engineering team:- Technical Product Manager: someone that'll work closely with myself (VP of Product and Engineering) and our Head of Product to help evolve our product architecture over the coming years.- Platform Engineer: someone that'll work with our team building out the infrastructure of our API platform.- Software Engineer (hiring senior/staff): someone that'll work on evolving our API architecture as we expand financial capabilities on the platform; fintech experience is a plus but not required.Summary of our tech stack: Python backends (flask, django, fastapi), React JS frontends, PostgreSQL, Docker, Kubernetes, Terraform, AWS.\nFind more information and apply for any of these roles here: https://www.bond.tech/careers"
    },
    {
        "header": "Olo | Remote (US) (HQ in NYC) | Full-Time | https://www.olo.com/",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Olo is a leading on-demand commerce platform powering the restaurant industry’s digital transformation. Our customers include many of the largest restaurant brands in the US, and we have a lot of exciting projects in the works.We’re hiring for a remote senior backend .NET software engineer to help build our Olo Pay product: https://jobs.lever.co/olo/2021df5c-3ba8-4a6c-a804-0e63c93e82e9?lever-via=WSee4m3bRzOur tech stack is rooted in .NET (C# and F#) and SQL Server running in AWS infrastructure and modern software engineering tools such as GitHub, TeamCity, Octopus Deploy, Kafka, Datadog, Sumo Logic, and heavy use of OSS."
    },
    {
        "header": "Checker Software | Full Stack Developer | Onsite | Vancouver, Canada | Full-time | $130k",
        "location": [
            "Vancouver",
            "Canada"
        ],
        "european": false,
        "description": "Checker Software is a Vancouver-based start-up that offers a suite of powerful online tools designed to streamline workflows, enhance productivity, and foster seamless collaboration.As a fast growing company, we are expanding our team of engineers to enhance our file comparison tool, Diffchecker Desktop, and add integrations with other platforms.We’re looking for a flexible, self-motivated, and problem-solving senior full-stack developer to join our engineering team. You will be working with the front-end code using React and Redux on the Next.js framework, written in TypeScript. Our back-ends are Node.js written in TypeScript with TypeORM.To apply, visit https://www.checkersoftware.ca/senior-full-stack-developer"
    },
    {
        "header": "SOAR Energy Inc. | Full-Stack Lead (Next.js), Back-end Developer, UI/UX Designer | Full Time - REMOTE | $120k + (depending on experience) | www.soarenergy.com",
        "location": [],
        "european": false,
        "description": "I'm the CTO of SOAR Energy. We're a B2B company and the exclusive tech partner for the largest real estate and mortgage businesses in the US making a direct, tangible impact on sustainability. We're bootstrapped and self-funded, and already profitable-so we're not the traditional startup. But we still develop like one. While our headquarters is in Arizona, our development team is fully remote. Our co-founders each bring over 20 years of experience in the mortgage and real estate sectors. This isn't our first rodeo.Roles Open:Front-end/Full-Stack Developer (Next.js)Tech Stack: Next.js, Typescript, Postgres, Prisma/Graphql, Vercel, Tailwinds\nRequirements: 6+ years in front-end, expertise in typescript, prototyping/MVP building, experience in B2B real estate and mortgage a plus\nResponsibilities: Lead development of our B2B platform, work directly with founders, turn business needs into tech solutionsBack-end DeveloperTech Stack: Next.js, Node, Postgres, Prisma/Graphql, Vercel\nRequirements: 5+ years in back-end, API design, Vercel, AWS S3, etc.\nResponsibilities: Lead backend engineer for all data aggregation, custom API integrations for internal and third-party toolsUI/UX DesignerRequirements: 5+ years in UI/UX, developer/technical experience, Figma, B2B portfolio, real estate, mortgage, and solar sales experience\nResponsibilities: Lead UI/UX designer for our platform and customer-facing reports, completely own client user experience, Interface design, collaborate with developersInterested? Send your CV and linkedin/github profile to cory |at| soarenergy (after the beep) com"
    },
    {
        "header": "Doppler | Developer Advocate - Hacker News | Remote, US | Full-Time | $150-$170k + benefits",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Doppler is building the future of SecretOps. We are the uncomplicated way to sync, manage, orchestrate, and rotate secrets across any environment or app config with easy-to-use tools. We have amazing investors like Google Ventures, CRV, Sequoai, YC, Greylock, and so on… we are also backed by incredible leaders from companies like Github, Vercel, Figma, OpenAI, and more.We are looking for someone who comes from an engineering background who is passionate about Hacker News and who wants to spend their days understanding how to create content to deeply engage the Hacker News audience. This person will work very closely with our CEO, Brian Vallelunga.You can apply here: https://www.doppler.com/careers#open-roles or reach out to Emilie.sperling@doppler.com"
    },
    {
        "header": "Ockam | Remote (some US only, others global) | We make tools to allow developers to build systems that are secure by design.",
        "location": [
            "US"
        ],
        "european": false,
        "description": "* Senior Engineer - Elixir* Senior Engineer - Messaging Protocols* Senior Engineer - Rust* Senior Engineer - Rust (CLI)* Senior Engineer - Infrastructure, DevOps, SRE (Platform Engineering)* Staff Engineer - SRE | Platform Engineering* Senior Engineer - k8s* ... and also a few sales roleshttps://www.ockam.io/team#open-rolesYou can read our Team Handbook (https://www.ockam.io/blog/team_handbook) which also covers our approach/philosophy towards comp. In short though, way pay Bay Area comp irrespective of where you live."
    },
    {
        "header": "** Trunk Tools | Computer Vision / Search / LLM Engineers | Full-Time | US REMOTE or ONSITE NYC **",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Trunk Tools creates software to make construction more efficient and cost effective, we have significant revenue and are growing extremely quickly! We're a team with prior experience at SpaceX, PlanGrid, Carta, LinkedIn, Uber, etc.We're looking for:  * Computer Vision engineers with degrees in AI/ML/CS/Math, and who have 2+ years professional experience building products\n  * Search engineers with degrees in AI/ML/CS/Math, and who have 2+ years professional experience building products\n  * LLM Engineers with degrees in AI/ML/CS/Math, and who have 2+ years professional experience building products\n\n\nFeel free to email your resume and a note over to rob+sep23@trunk.toolsMore info: https://trunk.tools"
    },
    {
        "header": "AE Studio | LA Office | Multiple Roles | Full-Time | Remote | ae.studio",
        "location": [],
        "european": false,
        "description": "We are a development, data science and design studio that works closely with founders and executives to create custom software and machine learning solutions.\nWe are hiring top notch professionals passionate about software development, data science, design or product management to work with our amazing team creating human agency increasing software!Full descriptions: https://ae.studio/join-us"
    },
    {
        "header": "Genpax | Full-stack/product engineer | London, UK | ONSITE (hybrid/flexible) | https://www.genpax.co/",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "We're building a game-changing bacterial analysis platform. Using bioinformatics, we can help hospitals take early and effective action against outbreaks of MRSA and other pathogens.Our goal is to radically increase the utility, scalability, and speed with which whole genome sequencing (WGS) data delivers infection control solutions for human and animal healthcare worldwide. This will enable proactive control at early stages of outbreaks, and appropriate responses to more dangerous or more antibiotic resistant strains. We have developed a unique solution to address the challenges and our goal is to provide access to these solutions in a fully scalable system.I'm looking for an experienced full-stack (/'product') engineer to join our small engineering team - initially to focus on building out a novel interactive tree-based UI. There are some interesting challenges throughout the stack. We're using Python, GraphQL, React/TypeScript, Postgres and AWS, but open minded to adopting technologies that make sense.Ideal candidates would:  - Have an interest in working in BioTech/HealthTech (experience not necessary)\n  - Have a strong academic background\n  - Be based in/around London\n  - Be self-motivated, and have experience working in a high-output team\n  - Mention these things when getting in touch (and not be CC-ing every e-mail address on this page!)\n\n£55-100k + equity, based on experience.jfreeman+hn@genpax.co"
    },
    {
        "header": "Canopy Connect | https://usecanopy.com | US and Canada Fully Remote | Full time | Sorry, no visa sponsorship",
        "location": [
            "US",
            "Canada"
        ],
        "european": false,
        "description": "We're a well funded startup building the Plaid for Insurance that leads the industry in terms of customers, coverage and speed. We're growing quickly and are expanding our team of 16. Our team is located throughout the US and Canada and we are fully remote. We have one onsite each year in November in a rotating city in North America.We use node, react, postgres and tailwind hosted on AWS. We're hiring for the following roles immediately with more to come.- Customer Success Onboarding Specialist - https://boards.greenhouse.io/canopyconnect/jobs/4948745004- Backend Engineer - Carrier Integrations Team - https://boards.greenhouse.io/canopyconnect/jobs/4076674004- Full-Stack Software Engineer, Product Team - https://boards.greenhouse.io/canopyconnect/jobs/4958076004I'm the COO here at Canopy Connect and got my job through \"Who is hiring\"."
    },
    {
        "header": "Overleaf | Multiple Roles | Full-time | REMOTE | UK, Canada, US, Europe | Senior Full-Stack Engineer | Principal SRE |",
        "location": [
            "UK",
            "Canada",
            "US"
        ],
        "european": true,
        "description": "Overleaf builds modern collaborative authoring tools for scientists — like Google Docs for Science. We have over 13 million registered users from around the world. Our primary product is an online, real-time collaborative editor for papers, theses, technical reports and other documents written in the LaTeX markup language. It’s used by around 500,000 people each day and hosts over 100 million projects.We are currently looking for full-stack engineers to help improve our group-collaboration features and improve our rich-text editor to better support non-LaTeX users.We are also looking for a Principal Site-Reliability Engineer to help us achieve faster delivrey by helping us with scaling, observability and continuous delivery.Some reasons you'd enjoy working with us:- Most of our code is open-source, and we're big fans of free software.- We are based on the “Shape Up” development process, using an 8-week cycle to ensure regular delivery of improvements to the product.- You’ll be working alongside a cross-functional team, including designers, product managers and developers, to help Overleaf become the go-to place for scientific writing.\n- Working hours can be flexible to your needs. Our core hours are 2pm–5pm UK time. Applicants must be based in the UK, EU, US or Canada.- Remote is a first class citizen; even before the pandemic, all founders and employees worked remotely and this is part of our values: https://www.overleaf.com/about/values. We get everyone together (usually in London) a few times a year for valuable face to face time.Apply here: https://digitalscience.pinpointhq.com/?department_id=%5B9336%2C8567%5D&structure_custom_group_one_id=%5B823%5D#js-careers-jobs-block"
    },
    {
        "header": "88stacks | Fully remote team | Full-time and part-time | https://88stacks.com/",
        "location": [],
        "european": false,
        "description": "We currently have several internships open for full-stack development, machine learning, and DevOps. We are a fast-growing startup, making it easy for anyone to train custom image generator models and use them anywhere using stable diffusion and other machine learning models. Our platform runs on Python and Ruby. We are looking for people who are eager to learn and have experience in training interns.Feel free to send your resume here: https://88stacks.com/contact"
    },
    {
        "header": "Loft Orbital | Various Roles | Full Time | San Francisco, CA; Golden, CO; Toulouse, FR",
        "location": [
            "San Francisco",
            "CA",
            "Golden"
        ],
        "european": false,
        "description": "Loft Orbital's goal is to make space simple! Loft Orbital builds space infrastructure based on “shareable” satellites, providing a fast & simple path to orbit for organizations that require access to space. Powered by our hardware & software products, we operate satellites using different buses, fly various customer payloads, and handle entire missions from end to end - significantly reducing the lead-time and risk of a traditional space mission.We've got a lot of different roles open across both our Corporate and Federal teams, ranging from Embedded Software to Backend Software to Flight Software. We're looking to grow our team to help support a wide variety of programs, all of which are looking to redefine how we interact with satellites. All of our job listings can be found on our hiring sites, listed below. If you do apply, let them know that Reuben L. sent you from HackerNews in the Additional Details box!Loft Orbital: https://www.linkedin.com/company/loft-orbital-solutions/\nLoft Orbital Federal: https://jobs.lever.co/loftfederal"
    },
    {
        "header": "Stacklok | Fully Remote | Multiple Open Roles",
        "location": [],
        "european": false,
        "description": "We are an innovative startup founded by the creators of Kubernetes, Sigstore and the folks who bootstrapped foundations such as the CNCF and OpenSSF.Our mission is to revolutionize the software industry by providing a secure and trustworthy software supply chain. With our deep expertise in open-source technologies and commitment to enhancing software security, we are seeking a highly skilled and motivated individuals in multiple roles.* Senior FrontEnd Engineer* Senior Site Reliability Engineer* Staff Product Manager* Staff Security Software Engineer* Staff Site Reliability Engineer* Staff Software Engineer - Core Platforms and OSS* Staff Software Engineer - ML/AIPlease apply at: https://www.stacklok.com/careers"
    },
    {
        "header": "Struct.AI | Founding Frontend Engineer | 120K - 180K / year + 1%-2.5% equity | San Francisco, Remote (US timezone)",
        "location": [
            "San Francisco",
            "US"
        ],
        "european": false,
        "description": "Chat platforms today are inherently broken. Slack and Discord, the most commonly used chat platforms, while useful for real-time communication, create knowledge black holes, hindering the effective storage and retrieval of information.For the past 6 months, my team and I have been tirelessly building a new kind of chat platform – Struct.AI . Struct is reshaping the very concept of what a chat platform can be, reinventing chat. Struct is a unique combination of a chat platform for public communities (like Discord) and teams (like Slack). It tackles the hard job of marrying real-time chat with a thread-first approach to conversations while utilizing AI to generate context.Join us on this exciting journey as we redefine communication. As a Founding Product Designer, you will play a vital role in shaping this innovative platform.Tech Stack: Frontend is React / Typescript / Next.JS. Backend is Go / Postgres / Typesense. Using OpenAI APIs / intfloat/E5 for vector embeddings.This is my second startup. It's a small team of 3, aiming to keep the team under 6 over the next 12 months. Previously founder of Dgraph Labs, which I ran for 6 years. Before that, spent 6 years in Google Web Search + Knowledge Graph Infra. You can reach out to me with a resume at manish [at] struct.aiLet's reinvent chat together!"
    },
    {
        "header": "Interactive Brokers | Senior Python Developer | Mumbai India | Hybrid www.interactivebrokers.com",
        "location": [
            "Mumbai",
            "India"
        ],
        "european": false,
        "description": "You want to break into the finance industry?\nYou want to learn about trading and investing?\nAre you tired of endless meetings and just want to code?\nIf you love designing greenfield projects in Python, this is the job for you.\nWe are a small technology team in a fast growing, multi-billion dollar company.\nWe are seeking a self-starter that enjoys the craft of coding and developing innovative solutions.\nThe ideal candidate is someone who can communicate well and design libraries and systems in Python from scratch. Experience with Object oriented design, design patterns, building systems, and SQL a plus.\nPositions are a hybrid model 3 days in office 2 days remote.\nIB has grown through tough economic times. We have continued to hire while others have cut employees. If you are looking for a great place to innovate, apply today.\nWe have two positions open in our Mumbai India office.\nApply Online here: https://boards.greenhouse.io/ibkrexternal/jobs/6744936002"
    },
    {
        "header": "Senior Data Manager | ONSITE | Location: Norway, Stavanger | Full-time",
        "location": [
            "Norway"
        ],
        "european": true,
        "description": "In Cegal we are determined to unleash the digital potential of sustainable and meaningful industries. As Senior Data Manager in our Energy Consulting Team you will play a key role in shaping the digital future as we help influence our customers' further data and insight journey.You also have a passion for technology and are:\nSuper -skilled within data and information management, such as:- Seismic, well and production data management- In-depth GIS knowledge- Python or other scripting tools/data-science-ecosystem development skills- Application geodata administration- Data formatting, quality control and loading- Document management, procedures and documentation- Data governance and business processes- Industry common products like Petrel, OpenWorks, ArcGIS, FME, etc.- Diskos and other data sourcesDo you find yourself in any of the bullet points?Competencies are important, but we are convinced that your motivation and your personal qualities are as important success factors. If you found yourself in one or more of the bullet-points, we challenge you to apply!Apply here: https://nordictechjobs.com/posts/640"
    },
    {
        "header": "Focsec | Data Engineer | Full-Time | Remote | Europe (within +/- 2 hours of central european time) | https://focsec.com/",
        "location": [],
        "european": false,
        "description": "We are building the most advanced Threat Intelligence API and platform. We help businesses and public agencies reduce fraud, detect suspicious logins and signups, block spam and bots. Our core technologies are Python, Redis, MongoDB and PostgreSQL.We're looking for a Data Engineer (preferably 3+ years of experience) who enjoys dealing with large data sets. That means cleaning and optimizing data, building complex data pipelines, automating things, performing migrations, creating monitoring dashboards and sometimes visualizing things.Your qualifications:- 3+ years in the field of data engineering and/or data science- hands-on experience in dealing with very large data sets- in-depth understanding of MongoDB and Redis data structures and query performance- ability to identify performance bottlenecks and tackle themAdditionally, any of the following is considered a plus:- strong understanding of common network protocols and networking fundamentals- strong linux server and command line skillsTo apply, send your CV to hackernews@focsec.comWebsite: https://focsec.com/(Please NO recruiters, agencies or outsourcing firms)"
    },
    {
        "header": "Bonside | Senior Full Stack Engineer | New York City (NYC) | Onsite few days a week | https://bonside.com/",
        "location": [
            "New York City"
        ],
        "european": false,
        "description": "Bonside is an NYC-based fintech startup providing financing to brick-and-mortar businesses. The company recently announced their seed round (https://techcrunch.com/2023/06/07/bonside-growth-capital-brick-and-mortar-fintech/) and is hiring an experienced full-stack engineer to join as a founding member. Bonside has already deployed ~$3 million to brick-and-mortars in less than a year and is on track to more than double that in the coming months.The team is currently 6 people and focused on hiring curious, ambitious, and thoughtful teammates. This opportunity presents a strong growth trajectory for a skilled engineer who will be instrumental in both the architecting of systems and the scaling of the engineering team. The company is at an exciting inflection point with a variety of interesting engineering challenges that include data engineering, an investment marketplace, and brick-and-mortar specific software. This role will work closely with our Head of Engineering (prev. Netflix).Full job description: https://wellfound.com/l/2zfn1vTech Stack: Typescript, NextJS, tRPC, Tailwind, Node, Python, Prisma, Postgres, Vercel, Supabase, Retool, ClickHouse, MetabaseFeel free to apply on the site or email me at andrew@bonside.com"
    },
    {
        "header": "GoCardless (YC11) | Senior Software Engineer | Full-time | London or Riga| https://boards.greenhouse.io/gocardless",
        "location": [
            "London",
            "Riga"
        ],
        "european": true,
        "description": "GoCardless is used for domestic and international payments by 75,000+ organisations and counting, processing more than $30 billion across 30 countries.Come work on new products, or gnarly scaling challenges.Stack: Ruby, Rails, PostgreSQL, GCP, Reacthttps://boards.greenhouse.io/gocardless or DM me."
    },
    {
        "header": "Bluesky Social PBC | Backend Developer | Remote US | Full Time",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Bluesky's mission is to transition the social web from platforms to protocols. As a backend dev, you'll be writing protocol and backend code that will be a critical part of transforming social media.Responsibilities:• Scale our existing services to millions of users• Develop and maintain the TypeScript AT Protocol implementation• Create SDK and API tools for an ecosystem of protocol developersFor more information and to apply: https://blueskyweb.xyz/join/ts-developer"
    },
    {
        "header": "Generally Intelligent | Senior Software Engineer | Remote or San Francisco | Full-time",
        "location": [
            "San Francisco"
        ],
        "european": false,
        "description": "Generally Intelligent was founded with the vision of fostering a more abundant and equitable society through the deployment of safe, generally capable agents. We believe that practical methods, strategies, and policies for safety need to be part of the design process from the very beginning.Much of the work we do at Generally Intelligent is effectively pure software engineering. Our perspective is that even machine learning research ends up being about 90% software engineering, so even without any prior machine learning knowledge, there is plenty to contribute as a normal software engineer. Even most of our machine learning research tends towards the software engineering side of the spectrum, as we prefer to automate the types of work that academic researchers typically do (ex: tuning hyperparameters, experimenting with small variations in network architectures, etc).For more example projects and benefits, see the full job description: https://generallyintelligent.ai/careersTo apply, email: nicole@generallyintelligent.com or apply through the website above."
    },
    {
        "header": "SINTEF | Software Engineers and Research Scientists | Oslo, Norway | ONSITE (hybrid) | Immigrants are welcome",
        "location": [
            "Oslo",
            "Norway"
        ],
        "european": true,
        "description": "SINTEF is one of Europe's largest research institutes, with multidisciplinary expertise within technology, natural sciences and social sciences. For more than 70 years, our research has delivered innovation and revolutionary solutions for the society and our clients around the globe. It has made SINTEF one of the most popular employers in Norway. As an important team member with us, you get trust, challenging tasks and a good opportunity for professional and personal development.The SINTEF foundation is a non-profit research foundation.Software engineers - Big Data and AI for digital twins:\nhttps://www.sintef.no/en/sintef-group/sintef-is-looking-for-the-next-generation-of-problem-solvers/vacant-positions/position/145395/Research Scientists (MSc/PhD) – Data Engineering for AI and digital twins: https://www.sintef.no/en/sintef-group/sintef-is-looking-for-the-next-generation-of-problem-solvers/vacant-positions/position/145395/In case you decide to apply, consider spending the time to write a tailored cover letter. It doesn’t have to be long."
    },
    {
        "header": "Cryptic Vector | Vulnerability Researcher | Full Time | Onsite | Cincinnati/Dayton, OH",
        "location": [
            "Cincinnati"
        ],
        "european": false,
        "description": "Cryptic Vector is a 100-employee research & development (R&D) defense contractor located in Cincinnati, where we are dedicated to mission success. Our focus is on creating a culture where the best and brightest want to grow, learn, and stay. If coming up with out-of-the-box solutions is your specialty, then you'll feel right at home at Cryptic Vector. We are solving America's most unique technical problems in an environment where problem-solvers and hard workers thrive.We are looking for Vulnerability Researchers who are excellent at their craft. We perform VR and reverse engineering on applications, operating systems, and custom platforms/firmware (both user and kernel modes). You can expect to perform static and dynamic analysis (including custom fuzzers); critically analyze device memory, execution flow, and communication protocols; and design/develop/productize exploits and stealth solutions. Low-level experience working with machine/assembly languages would be helpful--along with a hacker mindset.[0] crypticvector.com\n[1] crypticvector.com/careers\n[2] https://recruiting.paylocity.com/recruiting/jobs/Details/1702677/Cryptic-Vector-LLC/Vulnerability-Researcher"
    },
    {
        "header": "Koddi | Currently seeking FT employees in the following locations: Ann Arbor, MI | Fort Worth, TX | Austin, TX or Remote Open roles: Sr. Software Engineers (Go, Java, C, C++), Sr. Data Scientist, DevOps Engineer (Azure and K8s experience) and Product Managers Looking to become a major player on a diverse team? Want to make a big impact on an engineer-driven roadmap in your next career adventure? Koddi Engineers drive innovation by embracing challenges and deploying emerging technologies to solve complex problems in software development. Koddi is a global technology company with software and services that empower marketplace monetization through commerce media. Our enterprise platforms leverage first-party data to drive marketplace revenue and profit by improving user experience and target shoppers throughout the purchase path. Koddi’s platforms enable any advertiser, any marketplace, in any industry to increase awareness, generate demand, and drive revenue. Based in Fort Worth, Texas, Koddi has additional offices in New York, Ann Arbor, and Düsseldorf. Ranked by Forbes, Deloitte, and the Inc. 5000 as one of the fastest-growing companies in the nation, we’re growing rapidly and looking for innovative problem solvers to join our team. Review all open roles at www.koddi.com/careers and apply directly, or send your resume to matthew.myller@koddi.com. Please reach out with any questions. We are not currently seeking external recruitment partnerships at this time. All candidates must be based in the US and either US Citizens or Green Card holders.",
        "location": [
            "Koddi",
            "Ann Arbor",
            "MI",
            "Fort Worth",
            "Fort Worth",
            "Texas",
            "Koddi",
            "New York",
            "Ann Arbor",
            "US",
            "US"
        ],
        "european": false,
        "description": ""
    },
    {
        "header": "Neocom | Senior Backend Engineer | Full-Time | Munich, Germany | ONSITE | VISA",
        "location": [
            "Munich",
            "Germany"
        ],
        "european": true,
        "description": "At Neocom, we empower every company to understand their prospects and turn them into delighted customers.With our guided product advisors, we eliminate choice overload and use zero-party data to deliver profound customer insights to our clients.\nJoin us our mission to revolutionise how people  find products by making product discovery effortless!.Our Stack:* Python is our main language (we use Django).* Go is used for high throughput services.* We deploy via Docker containers.* We offer parts of our API via REST and parts via GraphQL.* We use Postgres for Master Data and Clickhouse for data intensive queries..About the company:* Startup, post 1M ARR* 20 people, 4 in R&D* Very recently secured new funding round for the 2 years.What we are looking for:* True senior, who takes over ownership.* Has worked in Startups with less than 100 people in the past.* Knows her/his tools by heart..This is us: https://www.neocom.ai/careers"
    },
    {
        "header": "Critical Juncture | Rails Developer | SF Bay Area or Remote | Full-time | https://criticaljuncture.org/",
        "location": [],
        "european": false,
        "description": "Critical Juncture works to support government transparency and improved healthcare outcomes through the design, development, and maintenance of award-winning, intuitive web applications. Our small team is able to do so through years of focus in these areas and through deep partnerships with domain experts. As a full-stack developer at Critical Juncture, you will be an integral part of a small and dynamic team that works on important problems every day.You are an experienced Rails developer with strong Ruby and Javascript fundamentals, an insatiable desire to learn, and high attention to detail. You get excited about translating domain knowledge into tools and user interfaces that allow our users to work more effectively. You believe that understanding why something does or doesn't work is just as important as making it work in the first place. You are self-motivated, communicative, and comfortable working in a virtual environment. You love the challenge of working across a breadth of services and quickly assimilating bits of information into a coherent whole.https://criticaljuncture.org/jobs/2023-08-03-full-stack-rails-developer.html"
    },
    {
        "header": "Raylu | Full-Stack Engineer, Product Engineer | AI Chat Assistants (using LLMs) | Seed stage ($4M raised) | NYC Onsite only | $130K-180K + equity + generous benefits",
        "location": [],
        "european": false,
        "description": "Raylu makes it incredibly easy for software teams to build and integrate powerful AI assistants that far surpass the functionality of traditional chatbots or ChatGPT. Raylu’s AI assistants make it possible for software to be a partner that can accomplish what you ask of it, making the idea of “doing work” in software obsolete.What it’s like working at Raylu: \n- We are a small team of 4 (soon to be 6) all based out of NYC working out of our office in midtown manhattan everyday (with WFH flexibility when needed).- Everyday we tackle new unsolved challenges (e.g. how the heck do you we make this LLM released yesterday solve our problem? how can we innovate on chat UX?)- We work hard. We don’t believe in hustle culture, toxic workplaces, and sacrificing balance, but startups are really hard - so we put in the time and effort needed to succeed.- We are courageous yet humble with our work. Everyday we sprint into unknown territory courageously building what we think is the thing everyone wants, but we have the humility to hear feedback, fail gracefully, and rebuild quickly.Learn more about us, the role, and link to apply at https://careers.raylu.dev/"
    },
    {
        "header": "Darkhive.com | United States | REMOTE | Full-time | $150-220k + early shares, employee #5-10",
        "location": [
            "United States"
        ],
        "european": false,
        "description": "Public safety and military robotics systems are unintegrated with existing equipment and applications. They require too much specialized training, making them incredibly niche and significantly inhibiting broad adoption.Darkhive is creating a palm-sized, autonomous drone optimized to demonstrate the capabilities of our software stack. The integrated software and hardware solution are key to realizing the full potential of the product in our target markets.If ROS2, DDS, sUAS, GTSAM, SolidWorks, and aerospace are things you're familiar with or interested in, let's chat. Maybe you're working an another UAS/Drone company that's larger and want to flex your brain to have more direct impact and ownership of your creations. Apply below and mention HackerNews.We're looking for early hires to build out our SLAM stack, optimize the airframe, and build novel autonomous solutions. Our robots are designed and built in the USA. Let's make drones more affordable and accessible to public safety, humanitarian, and defense applications.- Position can be 100% remote (US Only). Relocation to San Antonio, TX preferred.\n- We do in person meetings when needed. We are just 10 people.\n- We're a startup, but we have funding and contracts. We're all mid-career so we want a sustainable, mature, diverse working environment.\n- This position will involve defense work. However, we will never build drones that can harm people.For more details on available positions check out:\nhttps://apply.workable.com/darkhive/"
    },
    {
        "header": "Formbay | Front-end React developer | 80K-150K | ONSITE Sydney, Australia | https://www.formbay.com",
        "location": [
            "Australia"
        ],
        "european": false,
        "description": "Formbay is the leading Renewable Energy Certificate Trading company in Sydney. We provide Digital Workflow and Compliance solutions in the renewable energy industry and document processing.We are looking for a capable and enthusiastic developer with strong front-end skills to complement our product team and back-end technical staff in our Sydney office as we expand into new industries.Essential requirements: React/JavaScript; tertiary education or appropriate experience; strong verbal & written communication skills; Linux.Knowledge of any other technologies in our stack are nice to have only: PHP, Python, Haskell, Elasticsearch, Kafka, Stripe, AWS, NixOS, Docker, Terraform, GitLab.Wide salary range reflects our willingness to consider eager graduates and experienced developers alike.Apply: documents (at) formbay.com.au (HN in subject)"
    },
    {
        "header": "Stealth GovTech Start-Up | Technical Cofounder | Full Time | US Only, REMOTE  | ⅓ of Firm Equity (or less if cash compensation preferred)",
        "location": [
            "US"
        ],
        "european": false,
        "description": "We’re building TurboTax for responding to government RFPs – making it 10x easier for small businesses to source, screen and win government contracts.We’ve hacked together a prototype built on OpenAI’s API that can already save customers dozens of hours in manual review and response time. We have pilot customers excited about what we’re building. We have ‘funding secured’ - with capital from our founding team giving us runway for the next two years and plans to raise a meaningful round of outside capital from our affluent networks in the near-term.What we don’t have is you – a badass technical cofounder excited about applying AI to solve an acute customer problem in a comically large market.I know it’s cringe when two “business guys” are on the hunt for a technical founder…but we know our lanes: we love to sell, have customer relationships and capital and while we’re resourceful enough to make wireframes and muscle out a prototype, we’re eager to give the space and respect to a true business partner to build and scale this company together.Who We Are:\nI’m a second time founder turned investor – now turning founder again – and my co-founder is a GovTech operator who was a hedge fund investor for a decade. We’ll share more once we meet...If you're interested email us directly at team@yourgovguide.com."
    },
    {
        "header": "Afiya Health (Digital Health Tech) | Full stack SWE | Contract | Remote",
        "location": [],
        "european": false,
        "description": "Afiya Health is a digital health startup focused on making it easier for individuals to optimize their health and slow down their aging. Our platform measures longevity biomarkers, creates a personalized action plan and helps keep users accountable to their goals to reduce risks across metabolic, cardiac, cognitive and mental health. We go beyond the standard lagging metrics of primary care and focus on leading indicators to prevent disease before it occurs.We’re a scrappy and fast paced team looking for someone to help expand our platform with experience in Python/Django and a general attitude to get stuff done whatever needs to happen. We’re 100% remote and asynchronous first, hiring world-wide.Interested? Send your inquiry to leadership@afiya.health"
    },
    {
        "header": "PixLab (https://pixlab.io) & FACEIO (https://faceio.net) | Full-or-part-time | Remote | Computer Vision / Full stack Engineers |",
        "location": [],
        "european": false,
        "description": "PixLab, a leading provider of Machine Vision, Face Recognition & Media Processing APIs is looking for:* Embedded C & Computer Vision engineer(s) to work on the SOD (https://sod.pixlab.io), embedded computer vision library.* Senior Python engineer with proficiency in PyTorch to work on FACEIO (https://faceio.net), our facial authentication web framework for web sites & apps.* C++ developer with ML expertise to work on the port of Tiny-Dream (https://pixlab.io/tiny-dream), our embedded Stable Diffusion C++ library from ncnn to ggml.* React/Vue JS Web developer(s) with expertise in fabric.js to work on a brand new, web based photo editing software backed by generative AI.Reach out to Vincent via contact AT pixlab.io with your resume if interested."
    },
    {
        "header": "CourtDrive | Perl Developer | REMOTE| Market | Full-time | CourtDrive.com & CourtAPI.com",
        "location": [],
        "european": false,
        "description": "At CourtDrive.com and our sister website, CourtAPI.com, we are building solutions that enable law firms and other power courthouse website users to become more efficient by automating daily tasks. Conceptually we’re building an ETL system with fuzzy data sources and an API in front of the end results. We’re based in Los Angeles but have a remote team worldwide (Canada, Europe, Armenia to name a few). We’re looking for a Perl developer to help us advance our mission by: building new webservices by scraping state court websites and court emails, building and supporting our CourtAPI solution, and helping keep our modern Perl codebase well oiled. Currently on Perl 5.38.Testimonial from a team member: “Long story, but I worked there for maybe 6ish months part time a while back. They offered me full time, but I ended up going to a startup because I wanted to learn some specific technologies + up my skills in Data Science. That job was definitely good for some people, but it wasn’t as remote as they advertised it (had me fly in a lot), and the team was somewhat difficult to work with ;) I ended up starting my own consulting and at the same time CourtDrive reached back out to me (perfect timing). Point I was trying to make was that I went back to work with them because they were so nice to work with. Not super demanding and very open to listening to ideas/suggestions - just a pleasant environment.”Full job listing and specific skills we are looking for: https://docs.google.com/document/d/1zezDxt7FM59oInpS2kNhqEpn1oWp2opwlGleyejTd9o/edit?usp=sharingTo apply, email: michael (at) courtdrive.com"
    },
    {
        "header": "https://sitewire.co | Senior Full-Stack Rails Engineer | Remote | Full-time | USA (only)",
        "location": [
            "USA"
        ],
        "european": false,
        "description": "Sitewire improves cash flow for real estate developers and members of the skilled trades. Our mobile-first, self-service draw process empowers workers with instant payments while combating fraud. The product maintains a fiercely loyal customer base and is ready to expand. We’re looking for an experienced and entrepreneurial Full-Stack Rails Engineer (senior or above) to help us achieve an ambitious growth plan.We're transforming our web app from a beloved product into a rock-solid, enterprise-grade solution. Our customers rely on us for project budgeting, virtual inspections, and draw management. This is no shopping app; Sitewire is mission-critical to our customers. You will be a core member of the engineering team, working alongside peers with the support of a mature founding team expert in construction, mobile, and IoT.Technologies: Ruby on Rails, Hotwire (Turbo / Stimulus), Tailwind, Postgres, Sidekiq, React NativeFor more details, or to apply, visit:https://wellfound.com/jobs/2771968-full-stack-rails-engineerI review every application and can answer any questions you have through Wellfound!"
    },
    {
        "header": "Kick Health || Remote || Full-Time || Lead Product-Focused Full Stack Web Engineer",
        "location": [],
        "european": false,
        "description": "Performance Medicine (Sleep + Public Speaking) https://www.gokick.com\nWhere Product-Focused Engineers tired of coding soulless products instead create meaningful impact at scale in the lives of hundreds of thousands of people...Kick Health is the first online Performance Medicine clinic. We help patients with sleep difficulties and presentation fears become the best performing versions of themselves (and not in the cliched, social-media influencer way).We've been featured in the New York Times, Stat Medical News, Slate, Business Insider, and Bloomberg.We are looking for an entrepreneurial and experienced Full Stack Engineer with strong product sense to join our team. As a Product-Focused Full Stack Engineer, you will play a key role in designing, developing, and delivering consumer and doctor-facing products.You'll report directly to and work closely with the technical CEO, who previously helped start AllTrails, the #1 app for the outdoors with over 50 million users in 100+ countries.Hope to start your own startup one day? This is a chance to join a quickly scaling startup to learn about achieving product-market fit and scaling rapidly.You will work on a developer-driven, modern tech stack, including Golang, React JS, GraphQL, Postgres, Kubernetes/Docker, and Google Cloud. We are seeking a candidate who can handle any part of this tech stack and has a deep understanding of building and scaling consumer-facing products.Sound enticing? Please reach out to us at hnjobs@gokick.com and tell us a bit about what makes you amazing."
    },
    {
        "header": "LeagueApps | Office in NYC, or Remote almost anywhere in US | Full-time | https://leagueapps.com/",
        "location": [
            "US"
        ],
        "european": false,
        "description": "LeagueApps is a youth sports management SaaS. We help youth sports organizers run their business, providing the tools they need to manage registration, scheduling, payments, and more. We believe that every kid should have the opportunity to play, and we provide 1% of our revenue to youth sports accessibility.We're hiring an Engineering Manager: https://grnh.se/3948b0e73us ($144,500 - $212,500, plus equity)Find other roles on our Job Board: https://grnh.se/0b718ab43usYou can also use this link to join our talent community, and our recruiters will reach out when new positions become available: https://grnh.se/b1bedbd53usThese links are all referral links, but you can also apply via https://careers.leagueapps.com/"
    },
    {
        "header": "Stream | Multiple Positions | Amsterdam, NL and Boulder, US | Remote possible | Full Time | Visa Sponsorship",
        "location": [
            "Amsterdam",
            "NL",
            "Boulder",
            "US"
        ],
        "european": true,
        "description": "Stream's Chat Messaging & Activity Feed APIs are used by over a billion end-users, and are powered by Go, RocksDB, and Raft - with response times typically measured in single-digit milliseconds.\nWe reached a new industry benchmark for scaling real-time chat as-a-service, with 5 million concurrent connections supported in a single chat channel.\nWe’re currently one of the fastest growing startups in Europe and Colorado on our Series B round of $38 mln: https://tcrn.ch/3peCYXl, and we just announced the launch of our newest product (Video & Audio API).We’re hiring for the following positions:* Staff Backend Software Developer (Golang)* Flutter SDK Team Lead* Flutter SDK Developer* React Native SDK Team Lead* React SDK Developer* Front End Team LeadAs a part of Stream, you'll have a chance to make a huge impact on the product within a team of the strongest engineers all over the world (over 35 countries aboard).\nIf you are interested in becoming a part of what we do, apply now! https://getstream.io/team/#jobs"
    },
    {
        "header": "Character.AI | https://beta.character.ai | Full-time | Front-end Engineering in Palo Alto and other roles",
        "location": [
            "Palo Alto"
        ],
        "european": false,
        "description": "Want to build at the intersection of cutting-edge LLMs and rocketship consumer products? Apply to Character.AI. We’re building personalized superintelligence and looking for excellent people across the stack.Our momentum is incredible, and – since we build everything from the LLM to the UI – we have been able to create a product that already has millions of active users (30x DAU in 6 months) spending 2+ hours per day on average.Now we are assembling a top-tier frontend team to create even more delightful web and mobile applications. The goal is to empower everyone to access infinite AI capabilities, so the opportunity for creativity and impact is massive. If you’re a rockstar in react, react native, typescript, and/or redux, we would love to chat with you.We are also hiring for a variety of other roles. If you want to build AI that feels alive, please apply through our career page with a resume and a short description of why you are interested: https://jobs.ashbyhq.com/character"
    },
    {
        "header": "Heroku | Engineering and Product Roles | Remote",
        "location": [
            "Heroku"
        ],
        "european": false,
        "description": "We have a large number openings recently posted as we are making a big investment in Heroku. We're seeking individuals with expertise in AI, DX, Tooling, Data, Operational Excellence, Operations, and more.\nHeroku is a remote-friendly team.https://www.heroku.com/careers#openings"
    },
    {
        "header": "Structura Biotechnology | Product Engineer | Full-time | ONSITE (Toronto) | https://structura.bio/",
        "location": [
            "Toronto"
        ],
        "european": false,
        "description": "We're hiring a Product Engineer to join our team building scientific software systems used by thousands of scientists at pharmaceutical companies, biotechs and academic research labs to compute and visualize 3D structures of proteins and other important biomolecules as part of their research and drug discovery loops.This role would comprise of full-stack development of user-driven tools that interface with our software systems and high-performance compute backend. This position is for someone with a wealth of experience building software on a team. It is not solely focused on development, but also necessitates understanding of user workflows in order to creatively design and build UI features to empower scientists.We've been shipping Svelte in production since 2020 - our stack is now primarily SvelteKit and TypeScript.You can learn more about the role and apply here: https://structura.bio/careers/product-engineer"
    },
    {
        "header": "WHOOP | Director of Machine Learning Platform Engineering | Onsite | Full-Time",
        "location": [],
        "european": false,
        "description": "At WHOOP, we're on a mission to unlock human performance. WHOOP empowers its members to perform at a higher level by providing a deep understanding of the interactions between their unique physiology and chosen behaviors.\nWe’re looking for a talented leader for our ML platform team. This team owns a suite of tools and services that scientists use during the research, experimentation, and production phases of ML development to enable state of the art data science. You will play a pivotal role in ensuring the reliability, scalability, and performance of our machine learning infrastructure, enabling WHOOP to continue pushing the boundaries of human performance. The ideal candidate has a proven track record leading a cross-functional team, is able to identify new opportunities to leverage our large and growing dataset, and is excited to work with physiological data.https://jobs.lever.co/whoop/18467795-9a63-4208-924d-34eb1d624356?lever-via=wSoj0Eyopb"
    },
    {
        "header": "Monadical.com | Senior Full-Stack Engineer | Full-Time Canada | REMOTE",
        "location": [],
        "european": false,
        "description": "We're a full-stack consultancy, committed to building software that outlasts us. We have a wide variety of interesting projects including building unified data formats for neuroscience labs to share data sets, developing custom medical software for doctors, developing a brand new MOBA game, creating platforms for real estate agencies, crypto, and more. We're growing quickly and we’re short on engineering talent. We're looking to hire people, who are driven and want to play a lead role in growing an exciting company. We have dedicated time for self-improvement, blogging, talks, and contribution to FOSS. Our goal is to be a workplace with a strong focus on learning, where client projects provide a base of capital for us to all work on dream projects of our own. We have an inclusive, transparent culture with a public company principles handbook.See more info and apply here:  https://careers.monadical.com/If you have any questions, drop us a message at apply at monadical dot comWe’re looking for:• Senior Full-Stack developers strong at Python and/or JS, experience in client relations, project management, UX, React. Experience with AI, NLP, ML, and mobile development is a plus.Some perks of working with us include:    • Work from home (we’re fully remote!) \n    • Flexible working hours \n    • Six weeks of paid vacation \n    • Competitive salary \n    • Strong culture emphasis on individual autonomy and impact on company direction"
    },
    {
        "header": "knowd.ai | Senior Frontend Developer | UI Engineer | Toronto, ON | Full-Time | Hybrid | Startup | Equity",
        "location": [
            "Toronto"
        ],
        "european": false,
        "description": "Knowd is an early stage startup creating a visual knowledge editor.We combine the unique blend of HCI research and LLM's to augment knowledge workers.At the moment, we are looking for a Frontend Developer to join our team and seek a candidate with an interest in being an early member of our startup for the long term.Ideal candidates will possess a mix of technical expertise in JS and tailwind and have an eye for design. Knowd is solving many challenging technical problems and bringing SoTA research into product innovation.You can reach us at team@knowd.ai. Please send us your portfolio! One of the co-founders (Thomas) will be in touch with you.Website: https://www.knowd.ai/"
    },
    {
        "header": "AppLovin | Software Engineer, Android Engineer | Full Time | Palo Alto, CA | https://www.applovin.com/",
        "location": [
            "Palo Alto"
        ],
        "european": false,
        "description": "AppLovin enables developers with the best tools to grow and monetize their applications. It is one of those companies that few people have heard of but nearly everyone has used our product. Our platform reaches 700M DAU and we are processing 7PB of data daily.Senior Backend Engineer, Java: https://grnh.se/90772bd16usSoftware Engineer II, C++: https://grnh.se/d2bf833e6usSenior Backend Engineer (Java, Kotlin): https://grnh.se/7e7c635d6usSenior Android Engineer (Android, Java, Kotlin): https://grnh.se/7bb811cf6us"
    },
    {
        "header": "Pomelo Care | Software Engineer | Remote (US) or SF or NYC | Full Time | https://www.pomelocare.com",
        "location": [
            "Pomelo Care   ",
            "US",
            "SF"
        ],
        "european": false,
        "description": "Pomelo Care is transforming outcomes for pregnant people and babies with evidence-based pregnancy and newborn care at scale. Our technology-driven care platform enables us to engage patients early, conduct individualized risk assessments for poor pregnancy outcomes, and deliver coordinated, personalized virtual care throughout pregnancy, NICU stays, and the first postpartum year. We measure ourselves by reductions in preterm births, NICU admissions, c-sections and maternal mortality; we improve outcomes and reduce healthcare spend.We are searching for generalist, product-minded Software Engineers to join our small team (6 eng) and help shape our core platform. Team members will have an outsized impact on our clinical experience and patient insights at this early stage.Pomelo is venture backed, most recently raising $25mm from Andreessen Horowitz, First Round Capital, and others.Check out https://www.pomelocare.com/careers?gh_jid=4905110004 for more details on the position."
    },
    {
        "header": "Zoox | Staff Engineer Secure Embedded OS, Threat Analysis and Security Standards Lead, more | ONSITE Foster City, CA (US) | Full-time | Visa sponsorship",
        "location": [
            "Foster City",
            "US"
        ],
        "european": false,
        "description": "Zoox was founded to make personal transportation safer, cleaner, and more enjoyable—for everyone. We will provide mobility-as-a-service in dense urban environments. We will handle the driving, charging, maintenance, and upgrades for our fleet of vehicles. The rider will simply pay for the service. In 2020, Zoox joined forces with Amazon as an independent subsidiary.Job descriptions: https://jobs.lever.co/zoox/a2c2d43d-3394-4b72-a0e9-16a9338211cf and https://jobs.lever.co/zoox/12e7f753-c980-4903-a371-9162ccac2...Both of these roles are on teams \"organizationally close\" to me. Apply using the links above, reach out directly to our recruiter via rchatkara at ourcompanyname dot com, ask me questions via mtimchenko at the same domain."
    },
    {
        "header": "Attendi | Senior Frontend Engineer | Amsterdam, ON-SITE hybrid | Full-time (80-100%)",
        "location": [
            "Amsterdam"
        ],
        "european": true,
        "description": "Healthcare professionals have to spend too much time on administrative tasks, when they should be spending that time delivering great care. Attendi allows healthcare professionals to report with their voice. This saves them precious time and removes the screen between client and caregiver, allowing more personal and effective care to be given. We provide an extraordinary work environment: getting paid well to work with smart people on things that directly have a positive impact on society.Healthcare professionals perform all their administrative tasks in electronic health record (EHR) systems. Attendi voice-enables EHR vendors' applications by developing speech-to-text and textual understanding APIs. Our EHR vendor partners also integrate our UI components, like a microphone that implements UX best practices for recording and transcribing audio, into their applications.As our senior frontend developer, your will maintain and improve our microphone component across the web, Android, and iOS platforms, while also creating new components that will be integrated into our partners' applications.We are a small startup team with fewer than ten members, which means no bullshit, moving fast, and getting a generous slice of equity. We're post product-market fit, profitable, and on the cusp of scaling up in the Dutch market.Check out https://attendi.recruitee.com/o/frontend-developer for more details on the position.Feel free to send any questions to berend [at] attendi [dot] nl."
    },
    {
        "header": "ML6 | Machine Learning Engineer, Data Engineer | Python, TensorFlow, Google Cloud Platform | Full-time | Amsterdam, Berlin, Ghent (EU) On-site/hybrid",
        "location": [
            "Amsterdam",
            "Berlin"
        ],
        "european": true,
        "description": "We are a Machine Learning consulting company that builds end-to-end Machine Learning solutions. By applying the latest AI research, we keep our clients at the forefront of innovation.If you are interested check out: https://www.ml6.eu/resources/resource-library and https://www.ml6.eu/client-casesYou will mostly work with TensorFlow and Python to solve hard Machine Learning tasks and help to put these into production. As a Premier Google Cloud Service Partner, ML6 has a very strong relationship with Google, providing you options to collaborate and alpha test a lot of their latest ML tools.We are looking for:• Senior Machine Learning Engineer• Machine Learning Engineer• Senior Data Engineer• Data Engineer• Project Manager• Business Development Consultant• Cloud Partner (AWS, Azure)• Junior Accountant• Administration OfficerApply at: https://ml6.eu/join-us"
    },
    {
        "header": "Opvia (YC S20) | Sales Development Representatives| REMOTE (US based)| opvia.io",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Opvia wants to be the software layer for regulated manufacturing companies. Regulated industries (Pharma, biotech, F&B) need better software to go to market faster, get insights from their data, and comply with the regulations. Opvia makes it easier to build exactly the procedures and workflows companies need with its no-code platform.Drop me a line (alberto@opvia.io) if you need further info or are looking for a different position"
    },
    {
        "header": "Spring Discovery | Senior Software Engineers | Full-Time | SF Bay Area | ONSITE or REMOTE",
        "location": [],
        "european": false,
        "description": "Spring Discovery is accelerating the discovery of therapies by empowering scientists with superpowers.We're an interdisciplinary team of biologists and technologists developing a new approach to scientific analysis – one where machine learning, great software, and cross-team collaboration is at its heart. We apply these techniques in partnership with other biopharma companies to help them search for drugs, and we also license our software / technology to other scientific teams.We're looking for senior engineers with a bent on making a difference in the scientific space. Experience with scientific datasets/products is a bonus, but not at all required. Other things we'd be interested in: strong systems thinkers, production experience handling large amounts of customer data, and Rust proficiency.Get a sense of some of the technology we build and the promising results they've uncovered by reading our blog posts:https://www.springdiscovery.com/blog/megamap\nhttps://www.springdiscovery.com/blog/multi-diseaseWe're fortunate to have great backing from top investors, including General Catalyst, First Round, Laura Deming's Longevity Fund, Felicis, Caffeinated Capital, Sam Altman, and more.Small team. Tons of ownership. Hugely impactful space at intersection of ML + science. If this sounds interesting to you, head on over to https://ats.rippling.com/spring/jobs"
    },
    {
        "header": "Qventus | REMOTE (USA & LATAM) | Engineering / Product | www.qventus.com",
        "location": [],
        "european": false,
        "description": "Qventus provides a real-time decision-making platform for hospital operations. Our mission is to simplify how healthcare operates, so that hospitals can focus on delivering the best possible care to patients. We use artificial intelligence and machine learning to create products and solutions that help nurses, doctors, and hospital staff anticipate issues and make operational decisions proactively. We work with leading public, academic, and community hospitals across the United StatesWe are actively hiring for the following positions:*Remote US:Data Platform Architect - 5+ YOE, Multi-cloud architectures, Supporting DS/ML ModelsData Engineer ll - 3+ YOE, Python, ELK, DBT, Snowflake, AWSData Modeling Lead / Architect - Expertise in healthcare data relationships and workflows, hands on understanding of EHR data structures and managementManager, Data Platform - 2+ YOE as a Manager, 3+ YOE hands on Data Modeling, DBT, AWS, SnowflakeSenior Data Scientist - 3+ YOE working with a wide variety of statistical and machine learning techniquesTechnical Product Architect - 4+ YOE in Solutions Architecture, Data Integration, Technical Product Management, (EHR Integration exp required)*Remote LATAM:Data Engineer ll - 3+ YOE, Python, ELK, DBT, Snowflake, AWSFront End Engineer - 2+ YOE, React, ES6, Typescript, React Native, AWSUseful experience: Previous Healthcare/ Health tech experienceTo see a full list of openings, and to apply, follow our Join Us page: https://jobs.ashbyhq.com/qventus?utm_source=DQpNjMYvxbNOTE: We are currently unable to support visa sponsorships or transfers at this time."
    },
    {
        "header": "Val Town | Founding Software Engineer | ONSITE (Brooklyn)",
        "location": [
            "Brooklyn"
        ],
        "european": false,
        "description": "Val Town is a social website to write and deploy code with zero friction or setup: just open a tab, write some TypeScript, and click run. We think of a “val” as a new web primitive, like a Tweet or Github Repo, that can be forked, liked, shared, commented on, and run. To make it all fit together, we’re building an editing environment, a sandboxed runtime, logging & observability for user code, and social tools like leaderboards, comments, likes, and sharing.Everybody should be able to code. Coding should be fun. Come build the future of programming with us!Website: https://val.townJob posting: https://about.val.town/founding-engineer-at-val-townWe've been on HN before: https://hn.algolia.com/?q=val+town"
    },
    {
        "header": "Coefficient (https://coefficient.io/about/) | SF Hybrid Onsite | Full time",
        "location": [],
        "european": false,
        "description": "VC-Backed startup Coefficient is a fully remote, Series A SaaS startup based in the SF Bay Area. Started by repeat founders with successful past exits, Coefficient has raised $24.7M from Battery Ventures, Foundation Capital, S28 Capital, and prominent angel investors such as Eric Yuan, Zoom founder/CEO. Coefficient enables users to create custom business tools and real-time dashboards—powered by our platform's composable no-code building blocks and two-way connectivity to the user's cloud data sources—all from the familiar canvas of a spreadsheet. We're a team of ~40 and growing quickly. Our stack is TypeScript/React/Python/Flask/Postgres and runs on AWS.Contact: hannahs@coefficient.ioRoles:\nSenior Backend Engineer (SF) - https://boards.greenhouse.io/coefficient/jobs/4005679006"
    },
    {
        "header": "Continua AI | Software Engineers - ML, Infra/backend or Client specialists | NYC, SFO, SEA | http://continua.ai",
        "location": [
            "Infra"
        ],
        "european": true,
        "description": "Continua was founded by a Google Research Distinguished Engineer with a goal to apply the latest innovations in ML/AI to reinvent how people interact with information, with services, and with each other.We're very early, and our product is still in the proof-of-concept phase, but we're working on several ideas to create persistent, ambient personal agents that give their users superpowers. This is an opportunity to join and help set the product direction of this brand-new company!We have open roles for ML engineers, infra/backend engineers, and client/front-end engineers.Stack (still a work-in-progress!): Flutter | Python | C++ | GCloudIf you are passionate about building innovative new products, and you’re eager to work in a dynamic startup environment, we would love to hear from you. Please send your resume to jobs [at] continua.ai and let's embark on this exciting journey together!"
    },
    {
        "header": "76 Software Engineering Group | Oklahoma City, OK | FULL-TIME | ONSITE | U.S. CITIZENSHIP REQUIRED",
        "location": [
            "Oklahoma City",
            "U.S."
        ],
        "european": false,
        "description": "76 SWEG is a civilian software engineering organization operating under the United States Air Force. We are hundreds of (civilian) scientists and engineers that provide software, hardware, and engineering support solutions to a variety of Air Force and military platforms. We are located on Tinker Air Force Base in Oklahoma City, OK. We often operate like a contractor to other parts of the military and federal government by providing independent engineering services without seeking a profit. We have dozens of active projects using C/C++, C#, Java, , Python, JavaScript, LabVIEW, Visual Basic, Assembly, Ada, Fortran, and other more esoteric languages. We have immediate opportunities available to hire candidates with degrees in Electrical Engineering, Computer Engineering, Computer Science, or closely-related fields.If you are interested in learning more, please e-mail 76SMXG.Tinker.Careers@us.af.mil and tell them Jake sent you."
    },
    {
        "header": "GoGoGrandparent (YC S16) | FULLY REMOTE |  Full-time | Able to work 4+ hours overlap with mainland US (UK, South Africa, Europe, etc.) | Senior/Staff Backend/Full-Stack Engineer",
        "location": [
            "US",
            "UK",
            "South Africa"
        ],
        "european": true,
        "description": "Build high-quality, robust engineering at the rarest of things - a Silicon Valley startup that is both wholesome AND profitable. We have 7-figure revenue, are YC-backed, and growing fast.Tech stack (required): Back-end heavy (Node, Typescript, MySQL, REST*+GraphQL), front-end (Vue), deploy (AWS, Docker/K8s)Minimum 4 years experience (with Node). If full-stack, you must be strongest on the backend.2-stage interview process.If you want to help older adults and people with disabilities, send your LinkedIn/CV to william@gogograndparent.com (keep it brief) or apply at https://www.ycombinator.com/companies/gogograndparent/jobs (UK jobs can be applied for from anywhere and salary ranges can be adjusted for the right candidate)"
    },
    {
        "header": "Minimax Labs | Full-stack, optimisation, software, cybersecurity, PhD and junior engineers | London, UK | ONSITE/UK REMOTE, FULL-TIME | https://minimaxlabs.com We optimise complex, global operations for billion dollar energy businesses worldwide, creating massive value out of thin air and a little cloud. To support rapid growth across the globe we seek high calibre engineers and scientists who want to have a real-world impact to join our elite team of PhD scientists and engineers in central London. Come work on exciting new projects and development of our proprietary technology and world-leading product if you love challenging, complex real-world problems, high performance applications (Java, AWS) and working with real business users.",
        "location": [
            "London",
            "UK",
            "UK",
            "London"
        ],
        "european": true,
        "description": "DevSecOps Engineer - DevOps: Python, Java, Jenkins, maven, Docker, AWS (EC2, S3, lambda), Azure (AD), linux & windows server command line & admin, experience of infrastructure monitoring & security - Security/Cyber: encryption/cryptographic protocols (TLS, SSL, certificates, Hashing), intrusion detection/monitoring, Java.\nFull Stack Engineer Working with Java, Spring/Boot, Angular10+, Maven, Docker, Jenkins. Design & build distributed systems and clean RESTful APIs. Nice to have: Interest in cybersecurity, AWS.Optimisation Engineer Working with Java, comfortable with complex codebases. Broad knowledge of real-world optimisation algorithms (PhD/research preferred). Nice to have: AWS (EC2, S3, lambda).Software Product Engineer Working with Java, JUnit, Spring-boot. Reasoning/problem solving and modelling ability. Nice to have: Keen interest in cybersecurity/AWS/DevOps/etc.Product Analyst - Graduate in mathematical science, strong problem solving - Communications: experience of teaching, training non-technical audienceWrite to us with a CV or similar to learn more: hiring@minimaxlabs.com"
    },
    {
        "header": "Mattermost | Senior Security Engineer | Engineering | Full-Time | UK, Germany, Spain, Greece | Fully Remote",
        "location": [
            "UK",
            "Germany",
            "Spain",
            "Greece"
        ],
        "european": true,
        "description": "Read more about the role and apply here: https://jobs.lever.co/mattermost/c3f73b37-ab07-4bf0-a1fb-f96e64b20d9eAbout: Mattermost is an open source platform for secure collaboration across the entire software development lifecycle. Read more about us here: https://mattermost.com/about-us/The role: We are seeking a result-driven and analytical Senior Security Engineer to help monitor, build, and maintain our company and SaaS security infrastructure along with processes across the company.Some responsibilities of the role include: Leading security projects to enhance security posture of infrastructure and company, Detect, respond to, and remediate security incidents\nDevelopment, review, and enforcement of company-wide security policies and processes, Ownership of company-wide IAM solution, Setup and maintenance of monitoring infrastructure, Setup and maintenance of incident response and forensic toolkit.Background: 3+ years of demonstrated experience in security engineering and incident response, security monitoring systems, security controls for cloud environments such as AWS, GCP and/or Azure, knowledge of Linux systems, experience with Kubernetes and Docker.Preferred background: Experience with certification processes such as SOC2, ISO 27000 series, FedRamp, etc., experience in one or more programming languages, ideally Go or Python, Certifications in the domain of penetration testing, incident response or computer forensics (e.g. OSCP, GCIH, GCFA, etc.), experience working in open source communities."
    },
    {
        "header": "Labviva | Boston, MA | Full-time | Hybrid",
        "location": [
            "Boston",
            "MA"
        ],
        "european": false,
        "description": "Labviva is a well funded Boston based start-up that is on a mission to accelerate the pace of life science research. We connect researchers with suppliers of reagents, chemicals and instrumentation in an intuitive user-friendly platform that supports the priorities of scientists while staying compliant with purchasing rules.We are a collaborative, curious group of individuals that are passionate about helping our customers improve efficiencies in their labs and procurement processes.We’re currently looking for Software Engineers to support the company in a number of different roles:-Vice President, Engineering-Engineering Manager, Inventory-Senior Data Engineer-Senior Engineer, Data Support Services Team-Senior Engineer, MarketplaceTo learn more about each role and to apply, please visit our careers site at: https://app.trinethire.com/companies/35521-labviva/jobsWe are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas at this time."
    },
    {
        "header": "National Grid | Remote from NY, MA, ME, CT, PA, NJ, RH, NH | Full-Time",
        "location": [
            "PA"
        ],
        "european": false,
        "description": "National Grid is an energy company but currently highly committed to a large digital transformation, along with green energy efforts and DEI. My current team is hiring at least 3 more people to work on replacing the current mobile app that serves all of National Grid's customers in the US. There are many other roles open as well, though not all teams provide remote options.Senior Mobile Engineer: https://jobs.nationalgrid.com/USA/job/Brooklyn-Senior-Mobile-Engineer-NY-11217/1057246500/Senior Software Engineer: https://jobs.nationalgrid.com/USA/job/Brooklyn-Senior-Software-Engineer-NY-11217/1057261500/"
    },
    {
        "header": "Propel | Brooklyn, NY or Remote (US) | Onsite, Remote, or Hybrid - You decide!| https://www.joinpropel.com",
        "location": [
            "Brooklyn",
            "US"
        ],
        "european": false,
        "description": "Propel builds modern, respectful, and effective technology that helps low-income Americans improve their financial health. Over 5 million people use our app, Providers, to check their benefits balances, stay up to date on critical government programs, save money, and earn income. In addition, we’re expanding further into the financial services space by building a new debit card, specifically designed to help low-income Americans.To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: https://www.keyvalues.com/propelSee all of our open roles here: https://boards.greenhouse.io/propel?gh_src=1d7cfa302usSome key roles we're hiring for:* Principal Product Designer: https://boards.greenhouse.io/propel/jobs/6871092002?t=1d7cfa302us* Head of Design: https://boards.greenhouse.io/propel/jobs/6631955002?t=1d7cfa302usTech Stack: Infrastructure:\nAWS, Cloudwatch, Kubernetes, Ingress, Helm, Route53, Nginx, Jenkins, Sentry, RDS / PostgreSQL, Redis, Istio.Backend: Python 3, Flask, Redis, RDS / PostgreSQL, Peewee, Nginx, Kubernetes, Docker.Frontend: TypeScript, Vue.js, Capacitor, SASS, \nVuetify."
    },
    {
        "header": "Tulip | https://tulip.co/eng | Boston, MA, Munich, Germany, and Budapest, Hungary | Full time | Onsite",
        "location": [
            "Boston",
            "MA",
            "Munich",
            "Germany",
            "Budapest",
            "Hungary"
        ],
        "european": true,
        "description": "Do you want to help transform manufacturing? We are building the best team in the industry to bring consumer-grade user experiences to a space dominated by ancient enterprise technology. Our platform enables our customers to create apps without code and to connect their apps to machines, sensors and smart tools. These augmented production lines would otherwise rely on paper to share information.We have offices in Somerville, MA, Munich, Germany and Budapest, Hungary. We just closed a $100m series C and are using that capital to grow dramatically. Our customers include some of the largest manufacturers in the world across numerous verticals of the manufacturing industry.We'd love to talk to anyone interested, but in particular we are looking to bring folks on in:- SRE/DevOps: Kubernetes-admin, scalable monitoring across the firewall, hybrid cloud/on-prem deployment- Web Development: React+Redux frontend, NodeJS+Mongo+Postgres+Redis backend, syncing data with Meteor, delivering useful, real-time experiences in the browser and on Electron- Data & Pipeline Engineering: planning, implementing, and finding insights with our next generation of process & sensor analytics- IoT/Embedded Software: delivering a reliable, extensible HW platform across arm and x86, all manner of bus/IO tech- Machine Learning & Computer Vision: build end-to-end ML and CV products to track and extract valuable insights from raw data, interact with clients to solve real-world problems with data.Apply at https://tulip.co/careers or email us at jobs@tulip.co"
    },
    {
        "header": "OtterTune | REMOTE | Full-time | https://ottertune.com",
        "location": [],
        "european": false,
        "description": "OtterTune is a database optimization-as-a-service company based on research out of Carnegie Mellon University. We use ML to automatically improve the performance of MySQL/PostgreSQL databases running on Amazon. We are a remote-first company. We are backed by VC's at IntelCap, RaceCap, Accel and the co-founders of Snowflake, DataBricks, SingleStore, CockroachDB, and Duolingo.\n* Senior Full-Stack Engineer: https://jobs.lever.co/ottertune/762d0365-f00b-43de-a3a1-37f7257ba11fLegit compensation + equity. 401k w/ matching. Unlimited PTO + sickdays + paid FMLA.Email me if you have questions: dana@ottertune.com"
    },
    {
        "header": "Populate | Senior Software Engineer (BE & FE roles) | New York | Remote (USA)",
        "location": [
            "New York"
        ],
        "european": false,
        "description": "I'm the Founder and CTO of Populate, a rapidly expanding Healthtech startup that fully automates doctors' workflows. Having recently closed our second VC funding round, we're now on the lookout for multiple Senior Engineers to join our team.If the prospect of making a substantial impact on technology, product, and culture in an early-stage startup with proven traction excites you, we'd love to hear from you.Backend: C#\nFrontend: React + TypescriptApply Directly:\nzubair[at]populate[dot]comJob Postings: https://boards.greenhouse.io/applytopopulate\nWebsite: www.populate.com"
    },
    {
        "header": "http://modash.io/ | Senior Product Engineer | Remote | Full-time | Europe",
        "location": [],
        "european": false,
        "description": "Hey there! Meet Modash.ioWe're a fun and dynamic startup shaking up the influencer marketing industry. Our goal? To help brands and creators create awesome connections with their target audiences using data-driven influencer marketing magic . With our super cool tech and savvy data analysis, we're giving our clients the insights and tools they need to knock their marketing campaigns out of the park!Who are we looking for?We're on the hunt for passionate Senior Product Engineers who love working with AWS, Vue, NodeJS, Typescript and a passion for product. If you're all about remote work, and can't wait to make a real impact, we'd love to chat!Interview Process?Say goodbye to pineapple tree sorting and Leetcode-style tasks! Our interviews are all about practical challenges and real-world scenarios, so you can show off your skills in the most relevant way possible.More details here: https://www.modash.io/blog/engineering-interviews-at-modashHow do I apply?Ready to join the adventure? Shoot an email to kristiine@modash.io and tell us all about your experience. We can't wait to meet you!What’s the salary range?Curious about the salary and job details? You can find all the info you need right here:https://www.modash.io/careers/senior-product-engineer"
    },
    {
        "header": "SmarterDx | 180 - 230K + equity + benefits | Remote first (but U.S. only due to data confidentiality) | Full time",
        "location": [
            "U.S."
        ],
        "european": false,
        "description": "We are an early stage health tech company using AI to improve hospital revenue cycle (making healthcare costs lower and allowing doctors to focus on patient care). The team is small but high functioning (MD + data scientist combos, former ASF board member, Google and Amazon engineers, Stanford LLM researchers, etc.) and initially scaled the company to $1MM+ in contracted revenue without raising capital.We have been backed by top investors including Floodgate (Lyft, Twitch, Twitter), Bessemer, and are currently on pace to 30X in revenue over a two-year time period.Plus we have 4 full years of runway.Who we are looking for:- Data scientists- Analysts- Healthcare data engineers- EMR integration specialistsBe part of the journey as we hone our PMF and build to scale! For more, see: https://smarterdx.com/positions.htmlIf interested email us at hiring at smarterdx dot com"
    },
    {
        "header": "Invisible | Remote (GMT +/- 4) | Full Time | https://inv.tech/invisible-engineering",
        "location": [],
        "european": false,
        "description": "Invisible builds a platform for Operations to run Business Processes. We stand at the intersection of humans and machines building scalable, repeatable processes for business using a combination of automation and human interaction. We've built an in house platform that handles the execution of these processes (think Zapier or IFFT that combines automations and human agents) and are solving interesting problems on teams ranging from Infra (Kubernetes, GCP) to UI (Python, Django, Typescript, React, Next.js).\nWe're currently focusing on hiring Principal and Senior level Full Stack and ML engineers, but we are interested in dynamic engineers at any stage in their career."
    },
    {
        "header": "Tenpu (https://tenpu.eu) | Amsterdam, The Netherlands | Software Engineer, Full-stack | Full-time | ONSITE (we meet in Amsterdam for half a day every 2 days)",
        "location": [
            "Amsterdam",
            "The Netherlands",
            "Amsterdam"
        ],
        "european": true,
        "description": "We’re building a web application for public buyers to manage their procurement processes. Our software will assist public buyers with different types of sourcing events like Request for information (RFI) and Request for Proposals (RFP).We are looking for a passionate, self-driven colleague to join our team. We value the creativity of an engineer to find solutions that delight our customers and we value high integrity individuals who love their craft and strive for excellence.Our tech stack is: Typescript with Next.js, tRPC, zod, Tailwind UI, remirror for rich text editing, Prisma as ORM over Postgresql DB. We deploy to Azure.If this sounds interesting to you email me at: valentin.zberea@tenpu.eu"
    },
    {
        "header": "Faktory.com | Frontend, Full Stack | Remote or On-site | US (New York, Miami) | Full-time",
        "location": [
            "US",
            "New York",
            "Miami"
        ],
        "european": false,
        "description": "Faktory is a flexible data discovery, task automation and content transformation platform. We allow users to build custom workflows, applications, proprietary search functionality by combining public and private data, APIs, language models, and much much more all using natural language.Frontend Engineer - We are looking for an experienced frontend engineer to lead the development of our core product Faktory.You will be responsible for leading the frontend team and help create a delightful experience for our users.Strong skills in javascript, html/css and react is needed, python experience a plus.Full Stack - You will be working with a core team of python developer and ML experts to expand our platform of LLMs, APIs and Transformers. ML experience a plus.If you are interested email thomas@faktory.com"
    },
    {
        "header": "Matchory | Remote/Onsite | Europe | Full-time | Senior Software Engineer | https://matchory.com/",
        "location": [],
        "european": false,
        "description": "We are Matchory, a Germany-based, internationally operating startup with a vision to provide automated, data-driven sourcing to nearly all industries - at the touch of a button. With this in mind, we have developed the world's largest database of digital, holistic supplier profiles. Uniform, comparable profiles are created from billions of data points. So buyers can find matching suppliers at any time, all over the world.We’re looking for senior engineers to join our team. You can expect lots of interesting challenges, an enthusiastic team, and great benefits. If you love data, have experience with any of Python, PHP, TypeScript, Java, Postgres or Elasticsearch, we have a great job for you.Contact us at jobs@matchory.com."
    },
    {
        "header": "Knoetic | NYC | HYBRID ONSITE , 2-3 days per week | Visas welcome",
        "location": [
            "Visas"
        ],
        "european": true,
        "description": "Hiring a Fullstack Software Engineer (6+ YOE), fluency with React, Typescript and NodeHiring a Backend Software Engineer (8+ YOE), to own data ingestion and pipelines.Check out the job descriptions, and apply here: https://www.knoetic.com/careersEmail lauren@knoetic.com directly if you have any questions!"
    },
    {
        "header": "ROCKSTAR GAMES | NYC-San Diego-New England| FULL-TIME | .NET SOFTWARE ENGINEERS | Existing Visa Transfers Welcome",
        "location": [],
        "european": false,
        "description": "A career at Rockstar Games is about being part of a team working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium. You would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the most talented people in the industry.RESPONSIBILITIESDevelop highly scalable server-side features for our online game console clients using object-oriented development in C#, ASP.NET, and SQL Server.Develop back-end services and APIs. Actively practice Test Driven Development (TDD) while developing new features and refactoring existing code.Work in an AWS cloud-based, event-driven microservice architecture with a high priority on web performance optimization.Collaborate with other Rockstar technology teams across our worldwide studios.New York: https://www.rockstargames.com/careers/openings/position/4187292003San Diego: https://www.rockstargames.com/careers/openings/position/4110900003New England: https://www.rockstargames.com/careers/openings/position/4161863003You can see our other openings here: https://www.rockstargames.com/careers/"
    },
    {
        "header": "Sirona Medical| ONSITE| Full-time| Quality Assurance Engineer |San Francisco",
        "location": [
            "San Francisco"
        ],
        "european": false,
        "description": "Sirona is a SF based Series B healthcare startup with a mostly remote team, including about 25 engineers and data scientists. We have a seasoned, high performing team and are looking to add one Quality Assurance engineer to work on building and shipping features used by radiologists every time they sit down to care for patients.Python (Django), React, AWS, CI/CD, deploy minimum every 2 weeks. Work with product team, other engineers and internal and external radiologists (tons of voice of customer!) to solve problems of scale, latency and 2 and 3D image rendering (WebGl, D3, Three.js ) of radiology images (massive images rendered via Chrome browser)Learn more: https://sironamedical.com/join/ Salary ranges posted on each job description."
    },
    {
        "header": "PackageX | NY, Pakistan, Remote | https://packagex.io/",
        "location": [
            "Pakistan"
        ],
        "european": false,
        "description": "PackageX is a headless logistics cloud for retail and commercial logistics. Unlike other providers, which lack modern solutions for data ingestion or operate in a silo and block data visibility, PackageX digitizes and connects logistics to drive workflow improvements, customer retention, and, ultimately, profitability.View all our open roles here: https://packagex.io/careers* Image Processing Expert (Paris, Remote): https://bit.ly/43uTA0c\n* Senior NodeJS Developer (U.S., Remote): https://bit.ly/3MN8Uy9"
    },
    {
        "header": "AmpUp | Remote/Hybrid – Santa Clara, Boston | Electric Vehicles, Software, Climate Tech, Utilities | https://ampup.io",
        "location": [
            "Santa Clara",
            "Boston"
        ],
        "european": false,
        "description": "AmpUp is the leading electric vehicle (EV) charging operating system that enables drivers, hosts, and fleets to charge stress-free. Our technology makes it easy for businesses and property owners to manage multiple charge stations and locations on one platform. We enable our customers to achieve their electrification goals faster and easier than they imagined possible.We are seeking an experienced and motivated Government & Utility Analyst to support sales across US & Canada. The analyst will be responsible for identifying, responding, and winning RFPs as well as support new business opportunities within the electric vehicle charging market.Please email 'gnu@ampup.io' with your resume and cover letter if interested."
    },
    {
        "header": "Ascertain | 170-200K + bonus + equity + benefits | NYC + US Remote | Full time",
        "location": [],
        "european": false,
        "description": "We're a well-funded health tech venture studio starting a project in healthcare operations. We're building products to remove manual and repetitive tasks from provider workflows and have partnered with Northwell Health, NY's largest health system, to bring our solutions to market. Our small team has significant deep tech, startup, and healthcare experience (ex-CEO 4Catalyzer, MD + Head of AI/ML for healthcare at Amazon, Co-founder of VC-backed clinical AI startup etc.) and we're looking to build out our engineering team.We're hiring:- Fullstack Engineers- Backend Engineers- Frontend Engineers- ML Engineers- Senior Data EngineersCheck out the job postings here and apply here: https://boards.greenhouse.io/aegisventuresPlease reach out to hello at ascertain dot com if you're interested or have questions."
    },
    {
        "header": "Clincierge | https://www.clincierge.com/ | Staff Software Engineer (Full Stack) | Remote | Full Time | $180 - $200k",
        "location": [],
        "european": false,
        "description": "TypeScript, React, GraphQL, Postgres, AWSAt Clincierge, we support patients in clinical trials worldwide. The key to our success is our collaborative and innovative environment. We are always looking for new ways to invent solutions to ensure the clinical trial process is easier and more personalized.What we’re working on:• Launching a travel portal serving the clinical trial logistics needs of patients, trial sponsors, and medical centers• API Integration with ridesharing platforms, travel agencies, and clinical trial management software• Powering customized data analytics/business intelligence reportsStaff Engineer Role: https://grnh.se/2d4b5e4c4us"
    },
    {
        "header": "Foxglove | Remote (US time zones) | Full Time | Open Source | https://foxglove.dev/",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Foxglove is the leading observability platform for robotics developers. Join our small (~20 person), experienced, and fast moving team to help robotics and autonomous vehicle companies log, ingest, organize, and visualize multimodal data.I'm currently looking for a unicorn - our first Lead Sales Engineer to partner with our AEs, ideally with some robotics exposure, strong infrastructure fundamentals, and a passion for winning customers. If that sounds like you, please reach out!https://foxglove.dev/careersEmail in my profile if you have questions (no recruiters please)."
    },
    {
        "header": "Bright Network | Various Positions | Edinburgh, UK | Hybrid | Full-time",
        "location": [
            "Edinburgh",
            "UK"
        ],
        "european": true,
        "description": "At Bright Network, we use modern technology and data science to connect ambitious young people from all backgrounds with the best career opportunities. We currently have 800,000+ members and 300+ top-tier graduate employers.We've just taken new investment, a large fraction of which will go into growing our tech and product teams from 11 to 20 this year.We currently have the following open roles:- Senior Python Engineer (https://boards.greenhouse.io/brightnetwork/jobs/4952163004)- Senior TypeScript Engineer (https://boards.greenhouse.io/brightnetwork/jobs/4952192004)- Senior Data Scientist (https://boards.greenhouse.io/brightnetwork/jobs/4949124004)- Senior Machine Learning Engineer (https://boards.greenhouse.io/brightnetwork/jobs/4949151004)- Senior Product Manager (https://boards.greenhouse.io/brightnetwork/jobs/4918157004)- Senior BI Data Engineer (spec coming soon)Mid-level roles to follow. If you don't see a perfect match above but are interested in finding out more, it may still be worth getting in touch.You can expect:* To work alongside people who are really proud of the products they're building - putting our customers first* To work in a collaborative, ego-free & supportive team* To have time in each sprint to focus on your own L&D to help you growPlease get in touch with me if you're interested or have any questions — email in my profile!"
    },
    {
        "header": "TestFit | QA Lead | Full-time | Remote (CST +/- 2)",
        "location": [],
        "european": false,
        "description": "We design buildings in milliseconds. Our real-time automation allows real estate developers and architects to design projects in a fraction of the time required with traditional CAD software packages. It can be hard to describe so I'd encourage you to get a quick glimpse of our neighborhood layout tool at https://testfit.io/release/testfit-3-07-subdivision-configurator-main-planning-update/We are hiring an engineering-minded QA Lead to architect and build a world-class QA practice. As TestFit’s initial QA hire, your will be responsible for designing and implementing TestFit’s QA practices, testing TestFit’s flagship software application and related services, and testing TestFit’s web platform. Our web platform will be the centerpiece of TestFit’s efforts to revolutionize real estate feasibility via collaboration and convenience only possible with cloud-based software solutions.The ideal candidate is an experienced QA engineer with a passion for software quality, an intense attention to detail, and an ability to solve hard problems. We want someone who thinks beyond the traditional QA silo and views QA as an engineering practice. You should have the ability to read and write code, participate in code reviews, and have a genuine understanding of software architecture and coding practices.A candidate with a degree in Computer Science is preferred but not required. You should be able to read and write JavaScript, be proficient with SQL and JSON, and have experience with API testing tools such as Postman, Swagger, and Selenium.Apply online at https://jobs.lever.co/testfit/6daab9b5-2957-442f-b970-a2bf83cd8003 and/or email your resume to brian [at] testfit.io."
    },
    {
        "header": "Aha! (https://www.aha.io) | Rails / React / Devops | REMOTE",
        "location": [],
        "european": false,
        "description": "Aha! is the #1 tool for product managers to plan strategy and roadmaps. We serve more than 700,000 users worldwide. We are looking for:* Javascript and geometry expert? Help us build our HTML canvas based whiteboard & mockup tool.* Experienced full-stack, front end and platform engineers to work on the Aha! product. Our application is built in Ruby on Rails, with React on the frontend for rich client-side experiences.* Devops engineers with Ruby experience. We focus on the \"dev\" and all of our operations driven by code.Aha! is profitable, you can work from anywhere in North or South America, and we offer excellent benefits. We use our own product to manage our work (which is especially rewarding) and we deploy continuously.Our entire team has always been 100% remote - in North American timezones so we can collaborate during the work day."
    },
    {
        "header": "Powertools Technologies | Junior Engineer | Lisbon, Portugal | Full-time | ONSITE",
        "location": [
            "Lisbon",
            "Portugal"
        ],
        "european": true,
        "description": "Looking for a junior engineer for work on software related to Electronic Design Automation and/or Software Development. Candidate should at least have (or graduate shortly) a 3 year university degree in engineering. Most suitably Electronic/Computer Engineering or Informatics. Software Developers are more than welcome to apply.Site: https://www.powertools-tech.com . Growing a small experienced team with international industrial and academic track, willing to train new hire in fairly uncommon skill set. Candidate should be capable of quality detail work, and have good communication abilities, to provide support to international design teams in fabless semiconductor companies.Email your interest and CV to hr@powertools-tech.com, please."
    },
    {
        "header": "SingleStoreDB (formerly MemSQL) (https://singlestore.com) | India, Portugal | Full Time | Remote",
        "location": [
            "India",
            "Portugal"
        ],
        "european": true,
        "description": "SingleStoreDB is a database focused on high performance and hybrid workloads (HTAP). Our customers include half of the top 10 US banks, 2 of the top 3 US telcos, and 12% of the Fortune 100.Our product is a distributed, relational database that handles both transactions and real-time analytics at scale. Querying is done through standard SQL drivers and syntax, leveraging a broad ecosystem of drivers and applications.We have been building SingleStore since 2011, and building a database-as-a-service product involves a bunch of interesting technical challenges such as:\n* Compilers and code generation* Distributed computing and fault tolerance* UI and User Experience* Integrations with connectors and third-party tools (e.g., Business Intelligence tools like Tableau)* Infrastructure that scales to dozens of thousands of database clusters across GCP, Azure and AWSWe have several positions open:* Site Reliability Engineer (Remote - India, Remote - Portugal)* Software Engineer, Managed Service (Remote - India)* Software Engineer, Managed Service (Remote - Portugal)Careers page with individual links for each open position: https://www.singlestore.com/careers/jobs/.If you want to learn more about the engineering work we do, check out https://www.singlestore.com/blog/category/engineering/.Feel free to email me directly via david at singlestore dot com."
    },
    {
        "header": "Vanilla | Fully Remote (US Based) | Full-Time Positions Domain: Financial and Legal Tech Vanilla is a financial and legal technology company that is changing the way that people interact with their end-of-life planning. We are a series B company and are growing fast.",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Full Stack Engineer (Mid to Senior Level)- ReactJS/Typescript / Familiarity and interest in modern React ecosystem - GraphQL / Apollo- Rails and Postgres- Design / UI Focused- Familiarity with Figma/Storybook/modern design tools- Experience with AWShttps://justvanilla.applytojob.com/apply/bf59tN3CdR/FullStack-Engineer-MidSeniorJobs are fully remote but US based only please!https://www.justvanilla.com/careersEmail kei.yasui@justvanilla.com if interested."
    },
    {
        "header": "SpaceX | Onsite positions located in LA, the Bay Area, Seattle, Washington DC, and Starbase, Texas | Full Time",
        "location": [
            "LA",
            "Seattle",
            "Washington DC",
            "Starbase",
            "Texas"
        ],
        "european": false,
        "description": "*SPACEX*Our engineers support the development of reusable rockets, spaceships & satellite constellations! Check out our latest updates: www.twitter.com/SpaceX?s=20*SECURITY*Security Engineer, New Grad: https://grnh.se/40d386c52usSecurity Software Engineer: https://grnh.se/367f9d682usSr. Security Engineer: https://grnh.se/367f9d682usPrincipal Security Engineer: https://grnh.se/f68645542us*SOFTWARE*Software Engineer: https://grnh.se/fb8b22db2us (Hawthorne, CA)Software Engineer: https://grnh.se/3d8cd9fc2us (Redmond, WA)Software Engineer, Build & Flight Reliability: https://grnh.se/d965277c2usSr. Software Engineer, GPU: https://grnh.se/fc8126d62usSr. Site Reliability Engineer: https://grnh.se/2a8c52502usSpaceX conforms to U.S government ITAR regulations: https://www.pmddtc.state.gov/ddtc_public?id=ddtc_kb_article_page&sys_id=24d528fddbfc930044f9ff621f961987"
    },
    {
        "header": "Finch | Onsite/Hybrid – SF, NY, Toronto | HR-Tech | https://tryfinch.com/",
        "location": [
            "NY",
            "Toronto"
        ],
        "european": false,
        "description": "Our mission is to democratize access to the infrastructure that underpins the employment sector, unlock much-needed innovations, and create tremendous products for employers and employees.\nGain instant compatibility with hundreds of employment systems. Finch powers integrations for innovators across Employee Benefits, HR Tech, B2B Fintech, and moreDeveloper Success Engineer\nEngineering Manager\nSenior Software Engineer, Backend\nSenior Software Engineer, Fullstack\nSoftware Engineer, Backend\nSoftware Engineer, FullstackFull list of roles here: https://www.tryfinch.com/careers#roles Questions?"
    },
    {
        "header": "Gaia Family | Software Engineer, Senior - Staff | £80,000 - £120,000 | Full Time | London, UK | ONSITE",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "Gaia combines reproductive health data with financial technology to make IVF treatments more accessible, affordable and individual. We remove the ambiguity of IVF with a personalised success prediction and tailored insurance plans to protect yourself from spiralling costs and financial unknowns. That means unique and supported fertility journeys with the option to get reimbursed if things don’t go your way. Family starts here.We are looking for someone to build the financial backbone for our insurance and lending products.Reach out to me or apply via https://grnh.se/8859cde2teu"
    },
    {
        "header": "Community Phone | DevOps Engineer & Product Engineer | Global | Remote | Full Time",
        "location": [],
        "european": false,
        "description": "Come kill spambots with our global, tight-knit, scrappy engineering team!We are hiring our first Infrastructure/DevOps Engineer and expanding our engineering team.Our Stack: Typescript | React | Python | DjangoWe figured out how to deploy a full VoIP stack within the voice LTE network itself. We keep the landline alive and help both the senior and small business community to better connect to the people they care about.If our mission resonates with you, check out all our open roles here: https://jobs.ashbyhq.com/CommunityPhone?utm_source=HN"
    },
    {
        "header": "Chestnut | Founding Software Engineer | Remote (US only) | Full-Time | https://jobs.ashbyhq.com/Chestnut",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Chestnut is a well funded (a16z) close-knit seed stage insurtech - building next-gen enterprise infrastructure for the insurance industry. If you are a passionate full stack Golang Developer with a track record of building high-quality applications and want to be part of a vibrant team that embraces innovation, we'd love to hear from you!Golang, PostgreSQL, React, k8s, AWShttps://jobs.ashbyhq.com/Chestnut/c6df5678-829e-4c98-9dbb-82fef53b1605If interested, you can apply directly or email nick [at] chestnutfi.com if you have any questions."
    },
    {
        "header": "Hampden-Sydney College | Hampden-Sydney, VA | Onsite | Full-time | Tenure-track computer science faculty | www.hsc.edu",
        "location": [
            "Hampden",
            "VA"
        ],
        "european": false,
        "description": "We are looking to fill a tenure-track or long term Computer Science faculty position beginning August 2024. We seek enthusiastic candidates with a commitment to undergraduate education. The teaching load for this position is six 3-credit hour courses per year, with an additional course every third year. Applicants should have a Masters degree or Ph.D. in computer science or closely related field.  We encourage candidates with a wide range of specialties to apply. For more information and to apply, see* <http://apply.interfolio.com/131318>."
    },
    {
        "header": "Rollbar | https://rollbar.com | US Remote | Engineering Manager, Infrastructure",
        "location": [],
        "european": false,
        "description": "About Rollbar:* We're a ~40-person team (SF, Barcelona, Budapest, and remote US) with a mission to help developers build software quickly and painlessly* We help tens of thousands of developers find and fix errors faster.* Our backend handles billions of errors with low latency and high reliability* Our front-end allows developers to discover and drill down across millions of errors in real-time* Our customers are some of the best engineering teams in the world, including Twilio, Duolingo, Salesforce, and Twitch* Our values are honesty, transparency, pragmatism, and dependabilityWe're currently hiring for:- Engineering Manager, Infrastructure (US Remote)Please apply via: https://rollbar.com/jobs"
    },
    {
        "header": "ReMatter | Engineering & Product | Remote | Full-time | https://rematter.com/careers",
        "location": [],
        "european": false,
        "description": "Our mission is to enhance the sustainability, resilience, and robustness of the global metal supply chain while minimizing its carbon footprint. ReMatter is a scrap metal recycling software company founded by Forbes 30 Under 30 Stanford grads, building modern solutions for the $100B+ scrap metal industry.Our stack includes TypeScript, React, Node, GraphQL, AWS (Lambda, Cognito, S3, RDS), GitHub Actions, and Docker. Experience with our stack is a plus, but we believe in your ability to learn new technologies quickly.Join us to create a meaningful impact on the lives of recyclers. We offer competitive salary, meaningful equity, flexible schedules, remote work, and engaging company events.Apply at:- Software Engineer: https://rematter.com/careers/?ashby_jid=a55462d8-70d8-42ca-9c80-3efc0df49335- Mobile Software Engineer: https://rematter.com/careers/?ashby_jid=e78089d3-542c-4c6b-96c4-a919c00b749a- DevOps Engineer: https://rematter.com/careers/?ashby_jid=eae31e1a-794f-4149-9865-e7e9be9d65ce- Product Manager: https://rematter.com/careers/?ashby_jid=99e79271-47d0-415b-a066-65a624831547If you don't see a position on our site that fits your skillset or interests, reach out to jobs 'at' rematter.com"
    },
    {
        "header": "Scale AI | Berlin, Germany | Software Engineer | Hybrid/ONSITE | Full-time",
        "location": [
            "Berlin",
            "Germany"
        ],
        "european": true,
        "description": "At Scale AI, we are building tools across the AI development lifecycle, to help companies get the data they need, whether it's for self-driving vehicles, AGI, or robotics. The Berlin team is part of the Autonomous Vehicles & Computer Vision sector of Scale, which builds the tools for labeling Lidar pointclouds, annotating image and video feeds, and linking them together to build perception models.In this role, you will be an integral member of the founding engineering teams as part of our expansion into Berlin. You'll be given the opportunity to own critical parts of various products to meaningfully drive millions of dollars in revenue.Stack: TypeScript, Node, React, AWS, Python, Postgres, MongoIf interested, reach out to jean.ferreira [at] scale.com"
    },
    {
        "header": "Osmo | osmo.ai/careers | Full-time | Machine learning engineer, data analyst, in NYC and other roles",
        "location": [],
        "european": false,
        "description": "We have digitized vision, and hearing, but not scent — our oldest and deepest sense. Join Osmo on our mission to give computers a sense of smell to improve human health and happiness."
    },
    {
        "header": "Neem | Full-time | NY (Remote in EST or CT only)",
        "location": [],
        "european": false,
        "description": "Neem is a VC backed, seed stage startup building modern, cloud-based SaaS for Dental Practice Management. We believe the dental industry today presents an exciting opportunity to build a valuable software company as it remains largely overlooked by modern, cloud-based technology despite its massive scale.Open Role:\nFounding Front-End Eng: Javascript/Typescript, React, Tailwind CSS (1+years of exp - Required), Strong CS Fundamentals, 10+ years of industry experienceWebsite: https://www.getneem.com/*We are not sponsoring visas at this timeEmail resumes to: alex@getneem.com (mention HackerNews in subject line)"
    },
    {
        "header": "Mayvue Solutions (Pittsburgh, PA) | Software Engineer + other roles | REMOTE",
        "location": [
            "Pittsburgh",
            "PA"
        ],
        "european": false,
        "description": "Check our careers page at https://mayvue.com/careers to see current openings and apply. Our current open roles are at the bottom of this post.As a company, we are in a unique position. We’re a relatively new company and still have a “startup culture” but our team is comprised of experienced individuals and our hard work has us poised for explosive growth in the future. Working for a startup company, requires you to be a self-starter and team player. You are individually responsible for your own success, and the success of Mayvue.As a developer at Mayvue, you will have the opportunity to build software that is used by a trillion-dollar industry and a critical part of the infrastructure that United States rely on. You need to be comfortable working at any level of the stack and enjoy influencing the technical design and future direction of a product. Your growth can and will only be limited by your desires and career aspirations!Tech stack: C#, .NET Framework 4.8 and .NET 7, SQL Server, Oracle, Vue 2 and Vue 3We are ramping up work on a greenfield application that replaces our legacy bridge management software. It’s an exciting time to join the company – you WILL have an impact on everything that we do at Mayvue.Software Development Lead/Managerhttps://mayvue.applytojob.com/apply/xH3SkGM058/Software-Development-ManagerLeadSenior Software Engineerhttps://mayvue.applytojob.com/apply/I9Fnz7IWqS/Senior-Software-EngineerSoftware Optimization Engineerhttps://mayvue.applytojob.com/apply/OUjrlHteRO/Software-Optimization-EngineerAccount Manager (Software Sales)https://mayvue.applytojob.com/apply/VxAHbaLUte/Account-Sales-Manager"
    },
    {
        "header": "Resemble AI | San Francisco Bay Area or Toronto, ON | Full-Time | Full-Stack Engineer, Deep Learning Researcher, Frontend Engineer, Product Designer Resemble AI creates high-quality synthetic voices that capture human emotion. We're a venture-backed high-growth startup that's looking to shake up an entire industry with state of the art AI. Our product changes the way that thousands of brands, media companies, creative agencies, and game studios create speech content. We’re a remote-first team that thrives on flexibility and creativeness. We cover expenses for office space, equipment, and all of the other perks and benefits that make you productive. We also believe that to build an enticing product and solid team is by encouraging innovation is by enabling continuous education. That's why every Friday is a day that you can use to work on anything you want, Resemble-related or not. We're hiring for four roles:",
        "location": [
            "Toronto"
        ],
        "european": false,
        "description": "Full Stack Engineer - Can you break the entire stack? You're the right person for this job. Work on our Rails app, with sprinkles of React, and Python for the deep learning. Everything is dockerized, and we use Kubernetes to deploy.\nDeep Learning Researcher - Come build large ML models for voice synthesis! We already have the SoTA Speech Synthesis models, so this role is all about thinking outside of the box and running huge experiments on tons of compute. Experience in deep speech fields like TTS and ASR is desirable alongside proficiency in Python and DL/ML frameworks like PyTorch, TensorFlow, and Keras.Frontend Engineer - We're hiring a Frontend Engineer proficient in React, TypeScript, and Ruby on Rails to shape our user experience. Join our team to develop user-friendly interfaces and collaborate on building exceptional web experiences.Product Designer - As a Product Designer, you will lead the end-to-end design process, from concept to implementation, ensuring a seamless and delightful user experience. You will collaborate with cross-functional teams to define product vision, conduct user research, create visually compelling interfaces, and develop interactive prototypes.If interested, reach out directly to me: zohaib [at] resemble.ai"
    },
    {
        "header": "Songtrust/FUGA | Senior or Mid Software Engineer | Remote Europe | Full Time",
        "location": [],
        "european": false,
        "description": "Hello, HN! SongtrustⓇ, the world's largest technology solution for global music publishing royalty collection and administration, is hiring on. Our goal is to simplify music rights management and remove the complex landscape of publishing. We're currently looking for an experienced Software Engineer who can collaborate effectively with our dedicated cross-functional team.We're looking for someone back-end focused or full-stack capable. Our stack is Python/Django/Typescript/React/Postgres/AWS.See more at https://fuga.com/jobs/?gh_jid=6834790002"
    },
    {
        "header": "Taro Finance | Full-time / Contractor | Founding Engineer(s) | Fully Remote (US working hours)",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Taro Finance is a recent Techstars graduate (S23) that automates & digitizes the capital raising & lifecycle investor management process for private companies & funds while providing seamless access to liquid secondary markets.We're a fully remote company and looking to grow out our initial team at all technical levels levels. We're in the process of coming out of stealth mode, but you can learn more at tarofi.ioPlease send a resume or short blurb to jobs@tarofi.io with Hacker News in the title.Techstack: Typescript, React, AWS, Solidity / Rust / Ink"
    },
    {
        "header": "Endpoint | Remote (USA) | Full-Time | Sr. Backend Python",
        "location": [],
        "european": false,
        "description": "My team at Endpoint is looking for Senior Backend Engineers (7+ years) in Python - Remote. Its a great role if you love building backend applications in Python (Fast API, Celery, etc).We are a digital title and settlement company built from the ground up to make home closing easy for all.Details / apply here:https://www.linkedin.com/jobs/search/?currentJobId=3675879629&f_C=18588073&geoId=92000000&originToLandingJobPostings=3675875880%2C3664670973%2C3634038448%2C3606689334%2C3685415050%2C3675879629"
    },
    {
        "header": "GenHealth.ai | Remote, US only | All Eng Roles| full-time | https://GenHealth.ai See positions https://genhealth.ai/jobs 5 month old startup with $13m seed funding started by a veteran team building generative AI foundation models and apps on top of healthcare data! If you know healthcare data and transformers please apply. Ai eng, frontend, API eng, data science Email work@genhealth.ai with your resume",
        "location": [
            "US"
        ],
        "european": false,
        "description": ""
    },
    {
        "header": "Sleeper | Senior Software Engineers | Remote (US only) | Full-Time | https://sleeper.com/jobs",
        "location": [
            "US"
        ],
        "european": false,
        "description": "We connect people over sports.Salaries start at $150k for mid-level and $200k for senior software engineers.Competitive equity and benefits. At least 4 get-together outings a year.Remote but we prefer you be located in one of our hubs - SF Bay Area, Seattle, LA, NYC"
    },
    {
        "header": "Skyglass | Founding iOS Engineer | Full Time | Remote | $100K–$110K + 2%–4% equity",
        "location": [],
        "european": false,
        "description": "Skyglass is a 3D green screen app for shooting videos in virtual locations. We leverage Unreal Engine cloud rendering and pixel streaming to achieve Hollywood-quality visuals in real time with just an iPhone.We are looking for an experienced Swift/SwiftUI developer to lead iOS app development. Our app uses ARKit, WebRTC, and Metal to track, stream, and composite virtual production frames.We’re building the future of filmmaking by making the tools of Hollywood accessible to everyone. Email me: ryan [at] skyglass.comhttps://www.skyglass.com"
    },
    {
        "header": "Brenger (https://www.brenger.nl) | Senior Python Engineer | Amsterdam, The Netherlands | ONSITE (hybrid) | VISA SPONSORSHIP",
        "location": [
            "Amsterdam",
            "The Netherlands"
        ],
        "european": true,
        "description": "Come join Brenger as a Senior Python Engineer to build the transportation platform that solves the surprisingly unsolved problem of shipping bulky goods economically, optimizes the utilization of vans on the road, and reduces CO₂ emissions along the way!Check out the full job listing and apply at: https://careers.brenger.nl/o/pythoneng"
    },
    {
        "header": "Hevy | Senior Mobile Engineer | Remote | Full-time | https://hevyapp.com",
        "location": [],
        "european": false,
        "description": "We’re looking for a lead mobile/full-stack engineer to join our team. You’ll take full technical ownership of a mobile+web app used by +2 million users. You’ll architect and implement features, and lead a small team of developers.Our tech stack includes: React, React-Native, iOS, Android, Next.js, Node.js, express.js, Postgres.Learn more about the position here: https://www.hevyapp.com/careers-lead-full-stack-engineer/"
    },
    {
        "header": "MoneyDolly | Senior Flutter Developer | US Remote | Full-Time",
        "location": [],
        "european": false,
        "description": "MoneyDolly is transforming the North American fundraising industry by putting more money into the hands of students and allowing them to do what they love.We are looking for a senior flutter developer who's loves wearing multiple hats and able to help us define, implement, and architect our mobile fundraising app.We are a small team of 6 developers that have a high degree of trust with all of our team members. We are looking for someone who thrives in an environment of high autonomy while keeping a sane work/life balance (most of us have families).If interested, please send your resume over with \"HN Flutter\" in the subject to (CTO/Tech Lead): justin [at] moneydolly.com"
    },
    {
        "header": "University of Colorado Boulder | Atlassian Administrator | Boulder, CO | Full-time | REMOTE",
        "location": [
            "Boulder"
        ],
        "european": false,
        "description": "Student Affairs IT is looking for a talented Atlassian Administrator to join our team. You'll take over daily administration of our Jira Software, Jira Service Management, and Confluence instances, as well as be a part of shaping the campus migration to Cloud. Key for this role is being able to work with end-users to turn their business needs into technical solutions.https://jobs.colorado.edu/jobs/JobDetail/Atlassian-Administrator/51127"
    },
    {
        "header": "MahiGaming | DevOps Engineer | Multiple Locations, USA | Full Time | On-Site",
        "location": [
            "USA"
        ],
        "european": false,
        "description": "MahiGaming is an industry-leading game development company with multiple studios specializing in the development of online games with a wide audience of players all around the globe.The DevOps Engineer will manage, develop and improve tools for the enhancement of the Development Operations. The individual will integrate IT with the different teams to ensure the timely shipping of our products.Interested candidates should have experience with GitLab CI, Docker, and Kubernetes.Learn more and apply at: https://www.mahigaming.com/careers/"
    },
    {
        "header": "AllSpice | https://allspice.io/ | Boston, MA | Full time | Remote/Onsite | Sr. - Principal/Lead | golang, Vuejs",
        "location": [
            "Boston",
            "MA",
            "Vuejs"
        ],
        "european": false,
        "description": "At AllSpice, we're building the future of hardware development and collaboration, applying modern software design principles to the hardware industry with revision control, design review, and automated test (think GitHub/Bitbucket for hardware). AllSpice is unlocking the next generation of smart vehicles, IOT devices, rockets, medical devices, robotics, and much more.https://techcrunch.com/2022/01/31/allspice-thinks-hardware-developers-lack-their-own-github-so-it-is-building-one/We have a highly-capable, tight-knit, remote-first team with a flex office in Somerville, MA and competitive benefits. We strongly value continuous communication and personal development. See more on our careers page [https://allspice.notion.site/AllSpice-Careers-3173d0cd518b4257b186ba5c8f34dc44]We’re hiring primarily for:Sr. Product Manager - Help take our product to the next level by crafting detailed user journeys, mocking up novel/new UI/UX, contributing to our business strategy, and working with our engineering team to implement new features intersection of hardware and software.\nMore info here: https://allspice.notion.site/Sr-Product-Manager-950a0b1f3d0e442787177fd8e9cf28b6Infrastructure Lead - Join our incredible engineering team by helping coordinate our infrastructure team and supporting enterprise clients. You'll work on automating our deployments, scaling infrastructure, and testing/planning architecture to support new feature development. More info here: https://allspice.notion.site/Infrastructure-Lead-8ab323ed2cdc45de9babad4bd3f7fa1bTech Stack: Docker, Terraform, GoLang, Rust, Python, VueApply by emailing us at jobs@allspice[dot]io with [HN] in the title and a link to your GitHub/GitLab profile and/or resume."
    },
    {
        "header": "Cradle Bio | Machine Learning, Backend and Full Stack Engineer | Full-time | Onsite | Zurich/Amsterdam | Visa",
        "location": [
            "Zurich",
            "Amsterdam"
        ],
        "european": true,
        "description": "We are looking to grow our engineering team with people who are excited to peek out of the virtual world and join us on designing a platform for optimizing biological systems. Be ready to witness first hand what happens when you leave the bits and bytes behind and try to solve challenges with nature’s constraints and complexity.Details and application form https://jobs.cradle.bio/"
    },
    {
        "header": "Vivint | Home Automation - IoT, making cool stuff | Boston, MA | onsite",
        "location": [
            "Boston",
            "MA"
        ],
        "european": false,
        "description": "At our Boston Innovation Center, we're delivering an integrated platform, award-winning products and the industry's first artificial intelligence for the smart home. Check out our openings and join the #SmartHomeRevolutionWe are looking for designers and engineers across multiple functions, but here are just a few:- Backend Python/goLang engineers- Product Managers- Mobile UX designerCheck out all of our openings here: https://www.vivint.com/company/careers/team/technologyPlease email matt.deangelo1@vivint.com"
    },
    {
        "header": "Saildrone | Staff Software Engineer, Security | Full-time ONSITE in Alameda, CA",
        "location": [
            "Alameda"
        ],
        "european": false,
        "description": "Saildrone is on a mission to help scientists and sailors better understand the ocean and everything in it, to preserve a healthy ocean and a safe, sustainable planet.  We make autonomous sailing robots that travel the oceans, measuring almost everything they can find along the way.  Think of them as floating maritime tricorders.  Saildrones have discovered new underwater mountains[1], circumnavigated Antarctica[2], and even traveled right through hurricanes[3], including Idalia just this week!We are building a new Security team, and are looking to hire our first IC(s).  You would be working with me, alongside our engineering, manufacturing, and operations teams in Alameda, to ramp up our security efforts across the board and ensure that our drones and networks are producing reliable data for our customers.Check out the full job description here: https://careers.jobscore.com/careers/saildrone/jobs/staff-software-engineer-security-cfFMfAefzjd4Z2miiWSviu[1] https://www.sfchronicle.com/climate/article/underwater-mountain-california-alaska-17852430.php[2] https://web.archive.org/web/20190809011553/https://www.bloomberg.com/news/articles/2019-08-05/saildrone-s-journey-around-antarctica-uncovers-new-climate-clues[3] https://web.archive.org/web/20230609092913/https://www.nytimes.com/2021/10/03/us/saildrone-boat-hurricane-video.html and https://www.pmel.noaa.gov/saildrone-hurricane2021/index.html"
    },
    {
        "header": "Steelhead | FullStack Engineer | On-site (Calumet, Michigan) or Remote (EST) US only | FTE",
        "location": [
            "Michigan",
            "US"
        ],
        "european": false,
        "description": "Steelhead is a SaaS for job shops.\nOur customers rely on Steelhead to do work like PowderCoating, Anodizing, and Plating for customers like Tesla and John Deere.Linux/Docker/Postgres/AWS/Node/GraphQL/TypeScript/Reacthttps://gist.github.com/markhalonen/d626e288128f634b67e14e69...Email me mark |at| gosteelhead.com"
    },
    {
        "header": "mod.io | https://mod.io | Onsite (Melbourne, Australia) / Remote | Full-time | Senior Backend Developer | PHP",
        "location": [
            "Melbourne",
            "Australia"
        ],
        "european": false,
        "description": "I am the co-founder and VP of tech of a gaming middleware startup based in Melbourne, Australia but happy with remote for the right applicant.We are looking for a senior backend developer to help us grow our web backend infrastructure to the next level. We currently have 165+ games powered by cross-platform UGC solution across 11 platforms. Our backend is a few monoliths (Laravel / Lumen) which serve roughly 50M API requests per day and growing. If you have dealt with systems at scale that would be highly beneficial for the role.Skills Required / Expected: PHP / Laravel / Lumen / MySQL / Redis / Git.If you, or someone you know might be interested please reach out to me at pat [at] mod.io."
    },
    {
        "header": "JUPUS GmbH | Senior Full Stack Developer | Remote | Full-time | Europe",
        "location": [],
        "european": false,
        "description": "At JUPUS we are doing client onboarding for lawyers for the German market. Currently in seed stage, got funding earlier this year. Product launch in may this year, great traction so far. Our tech stack is Python/Django (ninja API) + TypeScript/Vue.js.We are looking for a senior full stack developer. Ideally someone who is experienced and wants to build a team of software engineers for the next stages of the company.Contact me directly at jannis.gebauer@jupus.de"
    },
    {
        "header": "Felt | Frontend Engineer | Oakland, CA or REMOTE (US timezones) | Full Time | https://felt.com",
        "location": [
            "Oakland",
            "US"
        ],
        "european": false,
        "description": "Felt is the best way to make maps on the internet. It's surprisingly hard to make a map today, and people in 15+ industries rely on them to do their jobs. Climate change and the resulting natural disasters are forcing even more people to become map-makers, and Felt is here to meet that need. It's the first easy-to-use collaborative mapping software, founded by a team of technologists with a proven track-record. My co-founder and CEO, Sam, is a former YC founder who sold his previous company [1] and I'm an early Uber engineer.We are on the lookout for our next frontend engineers. At this role, you will help build our beautiful interactive mapping front-end, pushing the boundaries of what's possible on an infinite canvas. Ideal candidates will have experience with Canvas, WebGL and other web graphics technologies, comfortable with complex UIs that work in multiplayer settings. Feel free to check out our blog on some of our work [2][3] and see if this excites you.We are well-funded and and you can read more about it our funding here [4], and our announcement here [5]. Our terms are employee-friendly terms such as early exercise, a 10-year exercise window and even a matching 401(k).[6]If you are an experienced frontend engineer, please reach out via hello@felt.com and mention HN![1] https://techcrunch.com/2021/03/09/via-buys-mapping-startup-remix-for-100-million/\n[2] https://felt.com/blog/from-svg-to-canvas-part-1-making-felt-...\n[3] https://felt.com/blog/svg-to-canvas-part-2-building-interact...\n[4] https://techcrunch.com/2022/05/31/felt-maps-15-million-serie...\n[5] https://felt.com/blog/public-beta-15m-series-a\n[6] https://felt.com/careers"
    },
    {
        "header": "trivago | Multiple Positions | Düsseldorf, Germany | Onsite (3 days per week) | Full Time | Visa Sponsorship",
        "location": [
            "Düsseldorf",
            "Germany"
        ],
        "european": true,
        "description": "trivago is a well-known travel tech company enabling users to find the right accommodation. We save our users time and empower them to get more out of travel by comparing accommodation from leading booking sites. At trivago we have talents from over 80 different countries and work on some of the most interesting technical challenges within the accommodation meta-search space.We are looking for:• Data Engineer – Data Intelligence• Data Analytics Lead• and many more…Apply at:https://careers.trivago.com/join/open-positions/"
    },
    {
        "header": "Teamworks | $150K-$180K | Remote (US) | Full-time | Senior Frontend | https://teamworks.com",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Teamworks is the operating system for college and professional sports.- We are looking to hire an experienced front-end engineer- Someone who is proficient in React and TypeScript- Python + Postgres experience is a plus- ReactNative experience is a plusEmail me at bbarbin@teamworks.com if interested."
    },
    {
        "header": "Enthought | Python Software Development | Hybrid | Tokyo, JP",
        "location": [
            "Tokyo"
        ],
        "european": false,
        "description": "www.enthought.com/careers\nScientific Software Developers, IT Consultants, Project ManagersEnthought powers digital transformation for science. Our technology and deep scientific expertise enable faster discovery and continuous innovation. We solve complex problems for the most innovative and respected organizations across the life sciences, material sciences, chemical, and semiconductor industries.Competitive salary, stock options"
    },
    {
        "header": "OpenSpace | Full-time | 100% REMOTE OpenSpace provides next-generation 360° construction photo documentation software, powerful integrations and the smartest analytics tools in the industry. We completed our Series D funding last year at $111 million and we are hiring for many roles.",
        "location": [],
        "european": false,
        "description": "https://www.openspace.aiJobs:Sr. 3D Front End Engineer: https://grnh.se/a5e2f9793usSr. Back End Product Engineer: https://grnh.se/3fcc3d103usSr. Front End Engineer - Web: https://grnh.se/c61b43de3usSr. Machine Learning Engineer: https://grnh.se/7ac138983usInside Sales Representative (Northeast U.S.): https://grnh.se/948327bd3usInside Sales Representative (AUS Sydney): https://grnh.se/e73512833usCustomer Success Manager (Netherlands): https://grnh.se/f47951dc3usCustomer Success Manager (Midwest U.S.): https://grnh.se/bc2f30b93usAccount Executive - Territories (Southwest U.S.): https://grnh.se/b30d624d3usI am the Director of Engineering for the front-end team and I'm hiring engineers for React, Typescript, Three.js, React 3 Fiber,  Cypress, etc..Company perks: 100% remote, competitive pay & equity, 401(k) + match, 90% healthcare coverage for employee and 75% for family, free vision and dental, $100/month DoorDash with free delivery, Monthly internet allowance, $500 home office stipend, great work/life balance, flexible time off"
    },
    {
        "header": "rings.ai | Fullstack Engineer | Remote (USA, Canada, LATAM) | EST/PST Timezone | Full-time",
        "location": [
            "Canada",
            "LATAM"
        ],
        "european": false,
        "description": "Tech: DynamoDB, Lambda, Python, AWS Serverless, NextJS, GraphQL/AppSync, NoSQL/SQL, FlaskWe're a small team looking for an experienced fullstack engineer to help us build a multi-tenant \"XRM\" used by private equity, recruiting, wealth management and other relationship-driven industries. Early stage startup with a high-paced working environment means you'll be taking direct ownership of building complex features. We won't sugarcoat it - you'll be faced with challenging problems that come with building a multi-tenant app and shipping features faster than ever, but you'll learn a lot a long the way.Backed by top tier funds like Founders Fund, Galaxy Digital, and others, the work we're doing here can be extremely rewarding if you're looking for a challenge.If interested, please email ilya [at] rings [dot] ai, include \"[HN]\" in the title, and tell us a little bit about how you've worked with our technologies, your experience in fast-paced startups, and make sure to attach your resume."
    },
    {
        "header": "Kombo (YC S22) | €70K - €90K EUR | Full-Time | Berlin, Germany | ONSITE",
        "location": [
            "Berlin",
            "Germany"
        ],
        "european": true,
        "description": "Kombo builds a unified API for HR, payroll and recruiting systems. We're working with companies of all sizes - from Fortune 500 companies down to early stage startups - to help them integrate dozens of software vendors within a few days instead of months.Reasons you might want to work at Kombo- Modern, yet robust tech stack (TypeScript, Prisma, tRPC, PostgreSQL, Docker, Kubernetes)- Extremely strong team - backgrounds from Oxford, Harvard, TUM, CODE and more- Grew from 4 to 11 people within a year, and looking to 2.5x next year as well- Early enough to make a significant contribution and have the 'early stage' startup' feeling; late enough to be significantly derisked (we are already profitable)- Strong onsite culture in hip Berlin office- Competitive salaries and equity compensationWe're looking for senior engineers to join us in various positions and are actively hiring! :) We are into radical candor, shipping code fast and sometimes being a bit crazy. Feel free to reach out to me at arne@kombo.dev or apply at https://www.workatastartup.com/companies/kombo (mention Hacker News) if this sounds interesting!"
    },
    {
        "header": "Coram AI | Backend Engineer | Full-Time | London, UK | ONSITE",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "Started in 2021, Coram.AI is building the best business AI video system on the market. Powered by the next-generation video artificial intelligence, we deliver unprecedented insights and 10x better user experience than the incumbents of the vast but stagnant video security industry.Our happy customers range from warehouses, schools, hospitals, hotels, and many more, and we are on the brink of rapid growth in 2023 and 2024.We are experts in AI and robotics and serial entrepreneurs. Our engineering team comprises industry experts with decades of research and experience from Lyft, Google, Zoox, Toyota, Facebook, Microsoft, Stanford, Oxford, and Cornell. Our go-to-market team consists of experienced leaders from Verkada. We are venture-backed by 8VC, revenue-generating, and have multiple years of runway.We are looking for a backend engineer responsible for a large part of our stack familiar with FastAPI, Postgres, Python3, Docker, Redis, Celery.Read more about job at https://www.linkedin.com/jobs/view/3688614702/Apply by sending email to peter@coram.ai or through linkedin link."
    },
    {
        "header": "Beacon AI | https://beaconai.co | Full-Time | SF Bay Area Hybrid",
        "location": [],
        "european": false,
        "description": "Do you want to join a company building R2-D2 for pilots? Beacon AI does this through a vertically integrated aviation platform. Our team has relevant industry expertise in aviation and autonomy, and we are building features that improve flight safety and efficiency by augmenting pilots.Join a founding team of former Cruise AI engineers and two former fighter pilots, with a world-class advisor team, talented developers, and amazing investors, including Sam Altman, Zach Perret, JetBlue Technology Ventures, and Countdown Capital. Learn (a little bit) more at https://www.beaconai.coWe are currently prioritizing hiring for these two roles to deliver impact on ongoing and future engagements. We expect many more openings within the next 6 months:\nhttps://www.beaconai.co/careersSWE Robotics (C++, Flight Software/Feature Engineer)\nThis role builds the pilot augmentation features (R2-D2)\nSWE React Web App (Front End)\nThis builds critical 3D software to support live flights and flight playback.Apply directly at https://beaconai.co/careers and mention that you found this post on HN!"
    },
    {
        "header": "Beautiful.ai | Full-Time | Remote in US & CAN | 150k - 250k Base Salary + Equity ",
        "location": [],
        "european": false,
        "description": "SaaS B2B Presentation Software | Series B | 16M Funding | AI Industry\nSenior Software Engineer - Full Stack Highly Preferred\nhttps://www.beautiful.ai/careers"
    },
    {
        "header": "Cooper Pet Care | Business Developer, Content Writers | REMOTE (EU) or Amsterdam, the Netherlands | VISA Sponsorship Available | https://cooperpetcare.com/",
        "location": [
            "Amsterdam",
            "Netherlands"
        ],
        "european": true,
        "description": "Cooper Pet Care is the leading telehealth veterinary provider in the Netherlands.* Business Developer: Help us expand our distribution channels. You will be at the front of the company and will have the dedication to create and apply an effective sales strategy. You will work closely with company founders and will have a first-hand opportunity to shape and define the future of Cooper Pet Care. Dutch native.* Dutch Writers: Are you a pet person and speak Dutch? We help our readers and users answer important questions about pets and their health. Help us to craft amazing blog posts and other content that knocks our readers’ socks off."
    },
    {
        "header": "Axle Energy | London, UK (Onsite 2 days/week)| Full Stack Engineers",
        "location": [
            "London",
            "UK"
        ],
        "european": true,
        "description": "We're building software to adapt electricity usage to the vagaries of renewable energy: using more energy when we have lots of cheap, green electrons and less when the grid is fossil-fuel heavy and costly.We're B2B, building tooling for companies to optimize EV charging, heat pumps, and batteries.Software Engineers (£50-80k + Equity): https://axle-energy.notion.site/Work-at-axle-26aa7e9c1088449c8f433cd0e3b65045?pvs=4Related post on HN: https://news.ycombinator.com/item?id=34358795Contact: co-founder & CTO Archy archy@axle.energy"
    },
    {
        "header": "University of California, Davis | Davis, California, USA | Software Engineer | Full-time | Remote (You must live in the USA for this job) | Salary: $40k-$100k depending on experience, interview performance, and location (if working remotely)",
        "location": [
            "California",
            "USA",
            "USA"
        ],
        "european": false,
        "description": "https://www.ucdavis.edu/The University of California, Davis is an R1 research university in Davis, California, USA. It is part of the University of California system. It is a top 50 USA university.Tech stack: JavaScript, React.js, Redux, MongoDB, Express.js, D3.js, Node.js, Python, Java, TypeScript, HTML 5, CSS 3 (You do not need to know all of these prior to applying to this job).Email resume to evo [at] ucdavis [dot] edu"
    },
    {
        "header": "Replit | US/Canada (Remote) | Full-Time",
        "location": [
            "US"
        ],
        "european": false,
        "description": "Replit is building the world's most ubiquitous AI-powered programming environment. We serve everybody from first time coders to startup founders and growth stage companies. And we serve them on every device around the world. At only 50 engineers, you'd be joining a fast-paced engineering/design led company with a flat org structure.Open roles:* Applied AI/ML Engineer - Expand the power of what Ghostwriter can do by fine tuning foundation models, training new models from scratch, and partnering with leading research institutions.* Python Expert - Your charter is to improve the daily lives of millions of coders using Python on Replit. You’ll improve things like packaging, runtime, environment setup, editor features, debugging, and testing and get to rethink what this experience looks like on Replit.* Platform Manager - As an Engineering Manager on the Platform team, your job is to build and lead the team that makes the secret sauce behind Replit. The Platform team gives a free computer in the Cloud to anybody who wants to create software, supports any language/framework they desire, and then scales to handle any project they can imagine.* Workspace Engineer - Your charter as a Software Engineer on the Workspace/IDE team is to improve the core software creation experience on Replit, while also enabling other engineers to expand Replit’s power. You’ll work directly on core features like the editor and window management.* Director of Product Engineering - As the Director of Product Engineering, you will play a pivotal role in driving the technical direction, strategy, and execution of our product roadmap.* Platform Engineer - Build the infrastructure that powers Replit’s development environments and application hosting. Unlock more power to serve our growing professional use cases.* Site Reliability Engineer - Drive operational excellence across the company. Make Replit more reliable, more cost efficient, and keep engineering moving fast while staying stable.* Support & Internal Tools Engineer - Build internal systems for managing and triaging user issues, tracking user analytics, and better integrating user documentation into Replit.Example technologies we use: Go, Rust, Typescript, React, CodeMirror, Linux, Nix, Kubernetes, Postgres, Redis, Spanner, GCP, OpenAI.See more Replit opportunities here - https://jobs.ashbyhq.com/replit?utm_source=HackerNews"
    },
    {
        "header": "Roboflow | Multiple Roles | Full-time (Remote, SF, NYC) | https://roboflow.com/careers?ref=whoishiring0923",
        "location": [],
        "european": false,
        "description": "Roboflow is the fastest way to use computer vision in production. We help developers give their software the sense of sight. Our end-to-end platform[1] provides tooling for image collection, annotation, dataset exploration and curation, training, and deployment.Over 250k engineers (including engineers from 2/3 Fortune 100 companies) build with Roboflow. We now host the largest collection of open source computer vision datasets and pre-trained models[2]. We are pushing forward the CV ecosystem with open source projects like Autodistill[3] and Supervision[4]. And we've built one of the most comprehensive resources for software engineers to learn to use computer vision with our popular blog[5] and YouTube channel[6].We have several openings available, but are primarily looking for strong technical generalists who want to help us democratize computer vision and like to wear many hats and have an outsized impact. Our engineering culture is built on a foundation of autonomy & we don't consider an engineer fully ramped until they can \"choose their own loss function\". At Roboflow, engineers aren't just responsible for building things but also for helping figure out what we should build next. We're builders & problem solvers; not just coders. (For this reason we also especially love hiring past and future founders.)We're currently hiring full-stack engineers for our ML and web platform teams, a web developer to bridge our product and marketing teams, several technical roles on the sales & field engineering teams, and our first applied machine learning researcher to help push forward the state of the art in computer vision.[1]: https://roboflow.com/?ref=whoishiring0923[2]: https://roboflow.com/universe?ref=whoishiring0923[3]: https://github.com/autodistill/autodistill[4]: https://github.com/roboflow/supervision[5]: https://blog.roboflow.com/?ref=whoishiring0923[6]: https://www.youtube.com/@Roboflow"
    },
    {
        "header": "Atlas Alpha Inc (Storepass) | $80,000 - $120,000| Full-time | San Luis Obispo, CA, USA | Staff/Senior Software Engineer | Onsite or Remote",
        "location": [
            "San Luis Obispo",
            "CA",
            "USA"
        ],
        "european": false,
        "description": "We're building SaaS for for board game and TCG stores. You can see our products here: https://storepass.co. Our onboarding pipeline is starting to explode and we're starting to hire to keep up with demand for new features and integrating with new customers.The stack is NodeJS, React, MongoDB.Please contact: Trent Ellingsen (CEO) trent@storepass.co."
    },
    {
        "header": "SW Engineer | SF | Onsite/Hybrid | Full-time",
        "location": [
            "SF"
        ],
        "european": false,
        "description": "New Startup in the AI Space Looking for Founding SW Engineers!Our new AI startup is a novel take on making AI useful and usable for everyone, and is funded by top VCs. It was founded by some of the earliest engineers at YouTube who recently connected again. We are currently looking to hire our first software engineers to work with us in San Francisco.Interested? If so, please reach out to henry@stealthmode.co with a resume to learn more."
    },
    {
        "header": "Steadily.com | Austin | Senior Product Manager | $200K",
        "location": [],
        "european": false,
        "description": "Build embedded insurance at a Series B startup as first product hire."
    },
    {
        "header": "virt.so | USA | Full-Time | Remote or On-Site whatever you prefer.",
        "location": [
            "USA"
        ],
        "european": false,
        "description": "VC-BackedCreating a CO-RE eBPF loader daemon to allow anyone to unlock superpowers for Linux and deploy / manage BPF objects easily on their infrastructure.- Looking for real Unix hackers. People who genuinely love, live, and breathe computers.Building in Rust, Python, and Typescript.info@virt.so"
    },
    {
        "header": "Levels.fyi | Remote | Timezone UTC+0 through UTC+5; Example: Europe through India | Full-time | Backend Engineer, Senior Frontend Engineer | https://www.levels.fyi",
        "location": [
            "India"
        ],
        "european": false,
        "description": "Levels.fyi's mission is to help every professional build a better career through the most accurate insights and services. We're building the future of compensation & hiring by centering ourselves around professionals.You'll be joining a close-knit team of 3 engineers currently to work across our product verticals. You'll have the opportunity to lead and own new projects / initiatives from idea to production end-to-end (architecture to deployment). We move fast and have come an incredibly long way on a tiny team. We're looking for a self-starter and resourceful engineer with strong communication skills and experience building things from scratch.Backend Engineer: https://levelsfyi.notion.site/Backend-Full-stack-Software-Engineer-f32fbbe2a89b4ba4a1b6e781fa47574e\nFrontend Engineer: https://levelsfyi.notion.site/Frontend-Full-stack-Software-E..."
    },
    {
        "header": "Giskard - Testing framework for ML models| Multiple roles | Full-time | France | https://giskard.ai/",
        "location": [
            "France"
        ],
        "european": true,
        "description": "We are building the first collaborative & open-source Quality Assurance platform for all ML models - including Large Language Models.Founded in 2021 in Paris by ex-Dataiku engineers, we are an emerging player in the fast-growing market of AI Quality & Safety.Giskard helps Data Scientists & ML Engineering teams collaborate to evaluate, test & monitor AI models. We help organizations increase the efficiency of their AI development workflow, eliminate risks of AI biases and ensure robust, reliable & ethical AI models. Our open-source platform is used by dozens of ML teams across industries, both at enterprise companies & startups.In 2022, we raised our first round of 1.5 million euros, led by Elaia, with participation from Bessemer and notable angel investors including the CTO of Hugging Face. To read more about this fundraising and how it will accelerate our growth, you can read this announcement: https://www.giskard.ai/knowledge/news-fundraising-2022In 2023, we received a strategic investment from the European Commission to build a SaaS platform to automate compliance with the upcoming EU AI regulation. You can read more here: https://www.giskard.ai/knowledge/1-000-github-stars-3meu-and-new-llm-scan-featureWe are assembling a team of champions: Software Engineers, Machine Learning researchers, and Data Scientists ; to build our AI Quality platform and expand it to new types of AI models and industries. We have a culture of continuous learning & quality, and we help each other achieve high standards & goals!We aim to grow from 15 to 25 people in the next 12 months. We're hiring the following roles:* Software Engineer - https://apply.workable.com/giskard/j/AD2C90B581/ (Python, Java, Typescript, Vue.js, Cloud skills)* Machine Learning Researcher - https://apply.workable.com/giskard/j/E89FE8E310/ (post-PhD)* Data Science lead - https://apply.workable.com/giskard/j/2CA6D2ABDA/ (ML + consulting experience required)"
    },
    {
        "header": "TileDB, Inc. | Full-Time | REMOTE | USA, Greece | https://tiledb.com",
        "location": [
            "USA",
            "Greece"
        ],
        "european": true,
        "description": "TileDB is the database for complex data, allowing data scientists, researchers, and analysts to access, analyze, and share any data with any tool at global scale. Here are some active projects you could work on:- vector search, utilizing TileDB and TileDB Cloud for seamless scaling: https://tiledb.com/blog/why-tiledb-as-a-vector-database (library: https://github.com/TileDB-Inc/TileDB-Vector-Search)- single cell genomics: in collaboration with the Chan-Zuckerberg Initiative, we recently released TileDB-SOMA for single cell data, with APIs for both Python and R built around a common storage specification: https://tiledb.com/blog/tiledb-101-single-cellWith TileDB, all data — tables, genomics, images, videos, location, time-series — across multiple domains is captured as multi-dimensional arrays. TileDB Cloud implements a totally serverless infrastructure and delivers access control, easier data and code sharing and distributed computing at global scale, eliminating cluster management, minimizing TCO and promoting scientific collaboration and reproducibility.Website: https://tiledb.com | GitHub: https://github.com/TileDB-Inc/TileDB | Blog: https://tiledb.com/blogWe offer the ability to work remotely for anyone with legal residence in the US or Greece. We have several open positions aimed at increasing TileDB’s feature set, growth, and adoption. You will have the opportunity to work on innovative technology that creates impact on challenging and exciting problems in genomics, geospatial, machine learning, distributed systems and database internals, and more.We are actively seeking:- Javascript library Engineer- Senior Software Engineer: Backend (Golang, CGo, k8s, Terraform, MySQL/MariaDB)- Senior Software Engineer: Python API (pybind11, Python, C++, CMake, scikit-build, conda)- Senior Software Engineer: Python Data Science Tooling (Jupyter plugins)- Senior Software Engineer: Build (CMake/C++, conda, wheels, and other packaging systems)- Senior+ Software Engineer: Database Internals (C++, database query planning/execution, distributed execution)Apply today at https://tiledb.workable.com!"
    },
    {
        "header": "Open edX / OpenCraft | Full-time | TRUE REMOTE (async/worldwide) | Senior Open Source Developer on Open edX - React, Python/Django, AWS/Kubernetes",
        "location": [],
        "european": false,
        "description": "Do you care about contributing to open-source, and appreciate a good challenge? We do too! :)Open-sourceWe are a team of veteran open-source developers, working on educational and community-based projects in an open-first environment – and we are looking for new members. By joining us, you will work full-time on open-source, pushing your changes to free software projects upstream through pull requests, contributing features, documentation, or help on public forums.We care deeply about contributing our work upstream. You will see the results of your work reused and recognized across the educational community, increasing access to quality education for everyone, everywhere.Remote-firstUnlike companies who reluctantly started to accept remote workers recently, we have embraced it from day 1. For the past 7 years, we have based and refined our way of working around remote-friendly workflows, from the ground up. No day-long video meetings, mandatory work hours, or risk of being forced back into an office one day -- as long as you have a good internet connection, it’s none of our business when or where you work from. :)We are all working remotely, from all continents (except Antarctica, at least so far - applicants welcome!). We use remote-friendly and timezone-agnostic workflows based on asynchronous principles and good documentation practices.Online educationWe are one of the main contributors to the Open edX project, the main open-source MOOC platform created by MIT, Harvard and many other top universities. It powers sites like edX.org, the MIT Open Learning Library, and the national online learning platform for France. We provide development and hosting for institutions like Harvard Medical School, Harvard LabXchange, Cloudera, Autodesk, and several governments. We are not affiliated with edX.org, but we contribute and work with them on various projects.Our handbook, like much of our work, is publicly viewable and you can find it at https://handbook.opencraft.com/.Apply for this PositionSee the full details and apply at https://opencraft.com/jobs/open-source-developer/Job description: https://docs.google.com/document/d/1VgA7geR5oAsHzTRnldm6KU7LK9c7pvbMAbSkt0ihNho/edit"
    },
    {
        "header": "Lightning Labs | Senior Engineering Manager, Lightning Protocol Engineer, Senior Security Engineer| San Francisco | Remote | Full-time",
        "location": [
            "San Francisco"
        ],
        "european": false,
        "description": "https://lightning.engineering/\nhttps://lightning.engineering/join-ushttps://github.com/lightninglabsLightning Labs is hiring! We’re looking to expand our team to build technology that'll bring Bitcoin to the next billion people. Our current focus is the development and deployment of the Lightning Network, an open blockchain scalability protocol. We push the edge of innovation with regard to blockchain scalability, privacy-preserving smart contracts, and cryptocurrency UX. If you’re interested in one of the positions below, please apply using our careers page: https://lightning.engineering/join-us. And if you know someone who might be a good fit, we'd very much appreciate any referrals.{Protocol Engineer}:Experienced systems software engineer versed in applied cryptography, peer-to-peer networks, distributed systems, open source software, and cryptocurrency protocols to design and implement core protocol and algorithmic components of the Lightning Network as well as the Bitcoin Network. Solid programming skills, experience with Go, C, or C++. Prior contributions to crypto protocols and open source software collaboration preferred.{Senior Security Engineer}:Seeking to hire a Security Engineer for the ongoing scaling of our growing engineering organization. This is a hands-on role that consists of devising and implementing policies and procedures around best practices in systems security. The ideal candidate has experience in securing web, Bitcoin, and other public-facing network services, penetration testing, and both automated and manual source code security reviews. Due to the domain in which we work, experience with Bitcoin and the Lightning Network is extremely desirable as is knowledge of the cryptographic aspects involved in this area.{Senior Engineering Manager}:Seeking to hire a Senior Engineering Manager to help scale our growing engineering organization. The ideal candidate has experience managing remote teams across several time zones, has managed their own open source projects or actively contributed to such projects in the past, and has high level working knowledge of Bitcoin. Due to the nature of our software, our ideal candidate is also highly technical as we regularly face novel and challenging decisions that require nuanced and comprehensive analysis of related tradeoffs. In addition, the ideal candidate should have a passion for our mission, as well as for Bitcoin as a whole. Candidates in this position will work directly with the CTO to scale our engineering organization, as well as work across functional team boundaries to ensure proper resource allocation, product quality, and team agility."
    },
    {
        "header": "Storyteller.ai https://storyteller.ai | Multiple Roles | Atlanta, GA + Remote | Full-time",
        "location": [
            "Atlanta"
        ],
        "european": false,
        "description": "We’re building the one-person Hollywood film and music studio.  Backend / Systems (3 Open Positions)\n  ====================================\n\nWe are looking for engineers with backend systems development experience to help power our film and music generation platform.We use Rust, Actix, MySQL, Redis, and Elasticsearch for our web API. You’ll also be maintaining job systems that execute machine learning inference tasks. These generate audio, video, and images, and they often entail additional processing with Rust media libraries such as Symphonia.There is a fair bit of fun algorithmic and systems design work, too.  Graphics / Game Engine Engineer (1 Open Position)\n  =================================================\n\nWe’re looking for a Bevy (Rust game engine) maintainer or a candidate with deep experience developing game engines, particularly animation and UI systems.We deploy Bevy to the browser (WASM) and to the server and use it for our core scene generation capabilities.You’ll be building our user-driven 3D film tool. Users can place animated models, skyboxes, and other user-generated assets. You’ll build camera and animation tools for the user, persist scene changes to the backend, render sampled video frames on the backend, and more.  Notes\n  =====\n\nAlthough it’s ideal if you have experience with Rust, we can train you.We’re trying to build our office (WFH-friendly) in Atlanta, but we’re open to remote candidates.Get in touch with us at jobs@storyteller.ai"
    },
    {
        "header": "MixRank (YC S11) | Software Engineers | 100% REMOTE (Global) | Full-Time",
        "location": [],
        "european": false,
        "description": "MixRank processes petabytes of data every month from web crawling. We have hundreds of customers using our data products including Google, Amazon, Facebook, Intel, and Adobe, across industries Sales, Marketing, Finance, and Security.Team is 37 full-time, full-remote from 20+ countries. We're growing, profitable, employee-owned, no dependence on outside funding. Applicants from all geographies and backgrounds are welcome.We are looking for passionate individuals for whom programming is not just a job but it’s something they love to do. We're obsessed with computers, programming, big data, databases, compilers, hardware, math, data science, and the internet. Does this sound like you? Please apply to join our team.Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, Rust, SQL, Javascript/TypeScript, and Nix. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.We operate at a larger scale than typical startups. We operate two datacenters with high performance servers we've built that are capable of dealing with the volumes of data we process. We've implemented our own distributed file system. We do full-scale web crawls. We download and perform static analysis on the entire universe of Android APKs and iOS IPAs that are published. Unlike a typical startup where you'll spend half of your time in meetings, and the other half fixing bugs from Jira tickets— at MixRank you'll get to challenge yourself with difficult technical problems that will help you to grow as an individual.--Junior Software Engineer - Remote (Global), Full-TimeWe're looking for remote junior engineers that have 0-3 years of professional experience in software, and 5+ years of curiosity exploring computers, programming, and technical hobby projects. This is an open-ended entry role with mentorship and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend/backend web development, APIs, data mining, data modeling, and more. To stand out, please highlight what makes you unique: passion for computing, curiosity and side projects, work ethic, niche research, etc.Ideally you've already graduated, but if you still have one or more years left of school, please feel free to apply anyway, and if you're the right fit for the team we'll figure out a way to accommodate your schedule.--Software Engineer - Remote (Global), Full-TimeWe're hiring generalist software engineers to work on web applications, data mining, machine learning/data science, data transformation/ETL, data modeling, database scaling, infrastructure, devops, and more. We'll cater the role to whatever subset of these areas match your interests.Beneficial experience includes PostgreSQL, Python, Rust, Linux, TypeScript, Nix, frontend/backend web development, and data mining.--I'm Scott, Founder/CEO/CTO. Please apply here: https://www.ycombinator.com/companies/mixrank/jobs"
    },
    {
        "header": "Temporal Technologies | Multiple positions in United States - WORK FROM HOME | FULL-TIME.",
        "location": [
            "United States"
        ],
        "european": false,
        "description": "Temporal offers an entirely new way to build scalable and reliable applications. Temporal enables developers to focus on writing important business logic, and not on managing state or worrying about the underlying infrastructure. Sequoia Capital led our recent round of funding and our team has experience from start-ups and larger companies like Microsoft, Google, Amazon, Uber, and more.Temporal Investors Expand Funding: https://temporal.io/news/temporal-investors-expand-funding-with-usd75m-roundTemporal in 7 minutes: https://temporal.io/tldrWe're looking for senior level engineers for multiple roles - see here - https://www.temporal.io/careersFEATURED ROLES:Senior Technical Curriculum Developer - Read more and apply here https://jobs.lever.co/temporal/a09daac8-f296-4330-a31b-59e56445e6f8Senior Staff Distributed Systems Software Engineer (Tech Lead) - Read more and apply here https://jobs.lever.co/temporal/28a290fa-087f-447b-934c-2960e769b963Senior Software Engineer - Read more and apply here https://jobs.lever.co/temporal/3700d106-ea0a-43b5-ae8e-589f3996f7ecDeveloper Success Engineer - Read more and apply here https://jobs.lever.co/temporal/5d1ff2cc-b128-44d2-812b-6c0d51101f98For all employees, we offer: competitive salary, stock options, fully covered premiums for medical, dental (and ortho), vision, and life insurance benefits, HSA, 401K, unlimited time-off, work from home perks, monthly wellness / food $ allowance, an access pass to a WeWork location if you so choose. Send resume to careers AT temporal.io or apply here https://www.temporal.io/careers/"
    },
    {
        "header": "dotCMS | REMOTE | Full-Time | Miami, Florida | https://www.dotcms.com/",
        "location": [
            "Miami",
            "Florida"
        ],
        "european": false,
        "description": "dotCMS is a content management system that helps global enterprises with sophisticated content requirements create, manage and deliver content anywhere.The dotCMS platform is best suited for organizations across industries who manage multiple brands, websites, workflows and content types across multiple languages, and need a solution that is secure and scalable for a development team to work with, but also puts power into the hands of the content & marketing teams who regularly need to make content changes. Brands such as Dairy Queen, Newell, Greensky, Chewy and Comcasthave chosen dotCMS as their primary platform to scale their content operations and empower their marketing teams so they can reduce dependency development, enabling teams to go-to-market faster, without sacrificing the flexibility and security of their CMS.~70 People, Globally. Founded in 2003. Most staff have been with company 5+ years.* Director of Engineering (US / Canada) - 100% Remote | https://dotcms.bamboohr.com/careers/64* Senior Product Support Specialist (Europe) - 100% Remote || https://dotcms.bamboohr.com/careers/70* Solutions Consultant (US / Canada) - 100% Remote | https://dotcms.bamboohr.com/careers/71"
    },
    {
        "header": "Nuna (https://www.nuna.com) | San Francisco & Remote friendly (US only)| Full-time | Visa Transfer",
        "location": [
            "US"
        ],
        "european": false,
        "description": "In the US, we spend an average of over $12,500 per person each year on healthcare -- that’s almost twice what other developed countries spend. Healthcare in the US costs a staggering $4 trillion dollars per year, almost 1/5 of our Nation’s entire economy. Yet with all this resource, our healthcare outcomes are poorer than other countries, people still can’t afford their healthcare, and our healthcare providers are burnt out.Moreover, our healthcare is systemically unequal. People of color, lower income, and LGBTQ+ have demonstrably worse healthcare outcomes, a disparity grimly highlighted by the pandemic we’re living through now where people of color are three-times more likely to die from COVID-19.How can this be, and how can we change it?Nuna is tackling one of the most hardest problems in healthcare underlying the negative outcomes and disparities we see: how healthcare gets paid.Today, hospitals only get paid when they do more-- more visits, more tests, more meds, more surgeries. Hopefully this helps patients get better, but regardless, the system gets paid. In fact, doing more is the only way to stay afloat.But -- is this really the right set of incentives? Shouldn’t everyone get rewarded not just by doing more, but by when patients actually get better? Shouldn’t everyone have access to affordable, high quality care, and shouldn’t hospitals be rewarded when they deliver this care? And shouldn’t insurance companies get rewarded when they help ALL their patients get better?Absolutely, yes. This concept is called Value-Based Care. In fact, healthcare as a whole has been trying to move in this direction for years, but making it all reality is deeply complex -- it is after all our healthcare. Nuna’s technology platform, our software apps, our vision, and our exceptionally talented team are collectively accelerating the healthcare system’s ability to make value-based care available to everyone.In 2022, Nuna will power over $70Bn of healthcare payments for over 6.5mn patients. We also leverage our data science and platform to direct patients to the best, culturally-matched, and accessible care providers for them. Additionally, we make it transparent and easy for both hospitals and insurers to see how they are performing in value-based care by spotlighting the patients or areas where they need to pay extra attention so that they can provide good care to all their patients and get rewarded.Nuna is unique - we have brought together an exceptional team of over 200 people. We are the industry’s best in healthcare data, analytics, engineering, clinicians, and value based healthcare experts. We have joined forces to create a more equitable health system for everyone.Our dreams and ambitions to change healthcare as we know it are big. If yours are too, we want to work with you.Open positions include:* Principal Software Engineers - Data Platforms, Experiences* Staff Software Engineers - Data Pipelines* Principal Software Engineer, Experiences* Staff and Senior Health Data Engineer* Staff Software Engineer - Program Development Kit Engine* Manager - Health Data AnalyticsJobs Board: https://bit.ly/nuna-jobsFrontend: React, TypescriptBackend: Django, Python, ScalaCloud: AWSQuestions? Email: recruiting+hn@nuna.com"
    },
    {
        "header": "getfillet.com | Junior Engineer | Designer | Full-Time | $2,000 / month | 100% REMOTE",
        "location": [],
        "european": false,
        "description": "Fully remote pirate ship is looking for junior engineers and designers to come aboard.Bullet points because HR word salad is hard to read.* Operating system for the global food industry. Touches every layer of the food supply chain from farm to table.* Food industry is the biggest in the world. It is one of the oldest, most archaic, and analog. Fragmented market with many established players. Many of them do bad things.* Do not do evil. Do not screw over our customers. Do not enable our customers to screw over the end consumer.* Food security, traceability, sustainability, legislation, and nutrition.* Runs 250,000+ kitchens globally.* Maintainability above all. Don't use the latest and shiniest technology. Question if something is the best tool for the job. Choose the most stable technology available.* Rarely build something in-house. Focus on building the product. Exception is our i18n pipeline which delivers our product in more than 120 languages. Many of our customers have teams that must communicate across language and cultural barriers.* Our approach to design is 80% UX and 20% UI. Don't customize it unless it improves the functionality. Bootstrap is just fine. Our customers only care that the product is intuitive and does the job reliably and consistently.* Accessibility. Many of our customers have poor eyesight or work in challenging conditions.* Interesting engineering constraints such as offline mode for taking inventory inside a freezer with no connectivity while wearing thick gloves.* Small but mighty team.* Fast paced learning environment. Give you support that you need to learn and grow.* Fully remote. Use open source communication (Matrix). Travel to meet up in nice places when we need to. No unnecessary video calls. No tracking software at work.* We know exactly what to build and have clear business, product, and engineering roadmaps.* Profitable, non-venture backed, don't need funding to grow, don't intend do take funding until pre-IPO, no outside stakeholders except our customers and the people they feed.* Care about meeting objectives rather than face time and bombastic rhetoric.In your email put two things: (1) your traditional food and (2) the hardest challenge you've ever had to face. It doesn't have to be technical.Don't include your resume. Just write 2-3 paragraphs about yourself and why you are interested in joining us.Angular, UX (Figma), Spring, iOS (Swift), Android (Kotlin)hn.hiring.september.2023.m9nde@simplelogin.com"
    }
]