[{"name": "Api.video", "sector": "Infrastructure / Video", "country": "France", "sector_hover_card": "Dev Tools", "date of partnership": "Jun 2020", "fundraising": "Blossom led api.video’s $5.5m Seed round.", "introduction_company_page": "api.video enables you to easily build, scale and operate on-demand and live streaming videos in your app, software or platform. ", "description_company_page": "In the late 90s and early 2000s, images displaced text as we shifted towards image-driven communication. We're now see the same with video, enriching everything from shopping to online learning. Yet video was still incredibly complex for developers to implement, from encoding to hosting to distribution. While there were a few sales-driven enterprise products in this category, it lacked a bottom-up developer solution. We're strong believers that developers should be able to pick up infrastructure products and try them.\nApi.video was founded by Cédric Montet who previously built Libcast, an online video platform, where he discoved the painpoints he set out to solve with api.video.\n‍", "sector_company_page": "Dev Tools", "investment_details_company_page": "Investment Total\nBlossom led api.video’s $5.5m Seed round."}, {"name": "AutogenAI", "sector": "Generative AI", "country": "United Kingdom", "sector_hover_card": "Generative AI", "date of partnership": "JUL 2023", "fundraising": "Blossom led Autogen AI's $22.3m Series A round.", "introduction_company_page": "AutogenAI leverages generative AI to help companies write bids and tenders for public sector and corporate contracts.", "description_company_page": "Bid writing has been at the heart of business-to-business and business-to-government procurement for decades. Using technology to make the process more efficient can result in big savings - bidding costs can easily account for 10% of the total contract value of a service.\nAutogenAI uses the extraordinary capabilities of large language models (LLMs) to supercharge the capacity of bid writing teams, allowing individuals to focus their energy on the strategic aspects of their bids.\nFounder Sean Williams started his career as a bid writer before going on to leading roles with some of the biggest suppliers of Government services. With a team of Prompt Engineers, Machine Learning Scientists and Writers, AutogenAI's software propels the transformation of procurement with intelligent time- and cost-effective solutions.\n‍", "sector_company_page": "Generative AI", "investment_details_company_page": "Investment Total\nBlossom led AutogenAI's $22.3m Series A round."}, {"name": "Cado", "sector": "SaaS / Security", "country": "UK", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Mar 2021", "fundraising": "Blossom led Cado's $10m Series A round.", "introduction_company_page": "Cado captures forensic data from compromised systems and enables security analysts to rapidly sift through the evidence and collaborate on investigations.", "description_company_page": "The aftermath of being hacked is one of the most stressful time for any enterprise company, yet despite $100bn in annual spend on security software, most companies find themselves having to perform forensics and post-attack investigation by hand, often taking days to start piecing together what happened, figure out the consequences and even if the attacker is still inside the company.\nCado was founded by Chris Doman, who previously worked as a security engineer at AlienVault, Vectra Networks and PwC, and James Campbell who was director of PwC's Cyber Threat Detection & Response team.\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Cado's $10m Series A round."}, {"name": "Castor", "sector": "SaaS / Data", "country": "France", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Jun 2022", "fundraising": "Blossom led Castor's $23.5m Series A round.", "introduction_company_page": "Castor reinvents the way companies find and understand their way around data.", "description_company_page": "Data within companies has grown exponentially, the challenge for users is no-longer \"do I have the data I need\", but what data they should be using and how.  Castor is building the data discovery and collaboration platform for business users, ensuring they can be truly data-driven.\nCastor was founded by four data scientists, Tristan Mayer, Xavier de Boisredon, Arnaud de Turckheim and Amaury Dumoulin. Two of whom had previously seen challenges first-hand as the Heads of Data at french unicorns Payfit and Qonto.\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Castor's $23.5m Series A round."}, {"name": "Checkout.com", "sector": "Infrastructure / Fintech", "country": "UK", "sector_hover_card": "Financial Services", "date of partnership": "Apr 2019", "fundraising": "Blossom invested in Checkout’s $230m Series A alongside DST Global and Insight Partners. Checkout has since gone on to raise their $150m Series B led by Coatue and $450m Series C led by Tiger.", "introduction_company_page": "Checkout’s mission is to build the future of commerce by building by a full stack technology that offers access to a payment gateway, advanced risk and fraud monitoring tools, a cutting-edge processor and the relevant acquirers, all in unified payments solution.", "description_company_page": "The future of commerce is online & international. At the same time, companies increasingly need and want to embed financial products into their services. Checkout is enabling the payment rails and financial services for tomorrow's internet economy.\nCheckout was founded by Guillaume Pousaz who has been in payments since 2006. In 2009 he acquired a small payments company authorized to accept credit cards but which had zero technology. That small company, today with hundreds of engineers, became Checkout.com.\n‍", "sector_company_page": "Financial Services", "investment_details_company_page": "Investment Total\nBlossom invested in Checkout’s $230m Series A alongside DST Global and Insight Partners. Checkout has since gone on to raise their $150m Series B led by Coatue and $450m Series C led by Tiger."}, {"name": "Collective", "sector": "SaaS / HR", "country": "France", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Dec 2021", "fundraising": "Blossom led Collective's $8m Seed round.", "introduction_company_page": "Collective enables independent freelancers to team up by mutualizing skills, networks and work methodology in a quest to enable each other to achieve more as a group vs. individually.", "description_company_page": "Collective combines the benefits of working in an agency - because its SaaS platform automates much of back-office functions like proposals, invoices, contracts and payments - with the flexibility of still being freelance and thus able to pick and choose projects and clients.\nCollective was founded by Jean de Rauglaudre, Vianney de Drouas and Paul Vidal, as part of eFounders.\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Collective's $8m Seed round."}, {"name": "Dija", "sector": "Consumer / Ecommerce", "country": "UK", "sector_hover_card": "Marketplaces", "date of partnership": "Dec 2020", "fundraising": "Blossom led Dija's $20m Seed round. Acquired by Gopuff.", "introduction_company_page": "Dija is a 10-minute grocery delivery service whose mission is to create the best online and offline convenience store experience for customers and shop owners. Acquired by GoPuff.", "description_company_page": "Grocery delivery run by existing stores has always been frustrating; having to book a delivery slot weeks in advance, the risk of poor substitutions and often perishables close to their expiry date. Delivery has long been shoe-horned on-top of existing traditional retail stores which aren't setup for a great delivery experience, as grocery shoppping move online, it'll be delivery-first stores that will transform the market.\nDija was founded by Alberto and Yusuf, who both worked at Deliveroo at senior levels for 4 years and saw the opportunity to improve grocery deliveries.\n‍", "sector_company_page": "Marketplaces", "investment_details_company_page": "Investment Total\nBlossom led Dija's $20m Seed round. Acquired by Gopuff."}, {"name": "Duffel", "sector": "Infrastructure / Travel", "country": "UK", "sector_hover_card": "Dev Tools", "date of partnership": "Aug 2018", "fundraising": "Blossom led Duffel’s $4.7m Seed round with participation from Y Combinator. Duffel has since gone on to raise their $21.5m Series A led by Benchmark and $30m Series B led by Index Ventures.", "introduction_company_page": "Duffel is an all-encompassing dev environment to make starting a travel business a seamless experience.", "description_company_page": "When airlines adopted ticketing technology in the late 20th century they were on the cutting-edge; unfortunately as technology has moved on airline now find the backend systems they rely on to be long antiquated. From travel agents to passengers, everyone in the industry has been frustrated by the backends that don't live up to the expectations of modern consumers.\nDuffel was founded by Steve Domin, an engineer and Tom Bates, a designer, who had both previously worked together as early employees at GoCardless.\n‍", "sector_company_page": "Dev Tools", "investment_details_company_page": "Investment Total\nBlossom led Duffel’s $4.7m Seed round with participation from Y Combinator. Duffel has since gone on to raise their $21.5m Series A led by Benchmark and $30m Series B led by Index Ventures."}, {"name": "Fat Llama", "sector": "Consumer / Marketplace", "country": "UK", "sector_hover_card": "Marketplace", "date of partnership": "Apr 2018", "fundraising": "Blossom led Fat Llama’s $10m Series A round, with participation from Greylock Partners, Atomico and Y Combinator.", "introduction_company_page": "Fat Llama is the world's first fully insured digital P2P marketplace for the rental of physical items, enabling people to monetize their possessions.", "description_company_page": "Millions of items from cameras to musical instruments sit unused for most of their lifetime, with increasing concerns about the environmental impact of consumerization, enabling sharing makes both economic and environemental sense. Owners can generate revenue from under-utilized assets and renters can borrow an item instead of purchasing.\n‍", "sector_company_page": "Marketplace", "investment_details_company_page": "Investment Total\nBlossom led Fat Llama’s $10m Series A round, with participation from Greylock Partners, Atomico and Y Combinator."}, {"name": "Freshly", "sector": "Consumer / Ecommerce", "country": "Spain", "sector_hover_card": "Ecommerce", "date of partnership": "Nov 2021", "fundraising": "Blossom led Freshly's $21.8m Series A round.", "introduction_company_page": "Freshly is a direct-to-consumer brand focused on natural cosmetics. After starting in Spain, Freshly has expanded to several other geos, and become an omni-channel company opening flagship retail locations in London, Madrid and Barcelona.", "description_company_page": "Consumers care more and more about using safe and natural ingredients, which is driving huge growth in demand for organic personal care products. Freshly's authentic brand, custom formulations, and direct-to-consumer business model, has made it a leading company in the organic beauty market.\nFreshly was founded by Miquel Antolin and Mireia Trepat, after learning about natural cosmetics from Miquel's family who used to make them at home.\n‍", "sector_company_page": "Ecommerce", "investment_details_company_page": "Investment Total\nBlossom led Freshly's $21.8m Series A round."}, {"name": "Frontify", "sector": "SaaS / Marketing", "country": "Switzerland", "sector_hover_card": "Design", "date of partnership": "Sep 2018", "fundraising": "Blossom led Frontify’s $8.3m Series A round. Frontify have since gone on to raise their $22m Series B led by EQT Ventures and and $50m Series C led by Revaia.", "introduction_company_page": "Full-suite brand management platform allowing product and marketing teams to ensure brand consistency across geographies and channels.", "description_company_page": "Brands are increasingly a company's most valuable asset, whether targeting businesses or consumers, but maintaining consistency across thousands of brand assets and multiple teams and offices is close to impossible. But when companies want every customer touch-point to be perfect they need a solution.\nFrontify was founded by Roger Dudler, a former engineer who previously worked at a digital agency where he saw the challenges with brand management first-hand\n‍", "sector_company_page": "Design", "investment_details_company_page": "Investment Total\nBlossom led Frontify’s $8.3m Series A round. Frontify have since gone on to raise their $22m Series B led by EQT Ventures and and $50m Series C led by Revaia."}, {"name": "Inne", "sector": "Consumer / Healthcare", "country": "Germany", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Jun 2019", "fundraising": "Blossom led Inne’s $8.8M Series A round.", "introduction_company_page": "Inne’s mission is to become the platform for female health, starting with the world's first at-home fertility monitoring system.", "description_company_page": "Hormones have a huge impact on our bodies and are critical for understanding important aspects of life like fertility. Understanding of hormone levels shouldn't just be restricted to medical professionals. Fertility tracking is the first step towards managing a woman’s entire reproductive cycle. \nInne was founded by Eirini Rapti who previously worked in healthcare for International SOS\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Inne’s $8.8M Series A round."}, {"name": "Instruqt", "sector": "SaaS", "country": "Netherlands", "sector_hover_card": "SaaS", "date of partnership": "April 2023", "fundraising": "Blossom led Instruqt’s $15m Series A round.", "introduction_company_page": "Instruqt gives SaaS and developer-first companies the tools they need to create hands-on demos and live training workshops for prospects, buyers, customers and staff.", "description_company_page": "Instruqt offers the simplest path to create interactive demos, workshops, and training that mirror real product experiences. It enables software companies to educate and sell to modern buyers and users with an authentic, immersive experience. Companies like Hashicorp, MongoDB, Red Hat, Okta, Datadog, and others use Instruqt to generate millions of dollars in the pipeline and account expansion. Since launching in 2018, Instruqt has hosted more than 1.6 million training and sales demos, built by more than 2,000 active content creators to more than a million engaged prospects and learners.", "sector_company_page": "SaaS", "investment_details_company_page": "Investment Total\nBlossom led Instruqt’s $15m Series A round."}, {"name": "Kadmos", "sector": "Fintech / SaaS", "country": "Germany", "sector_hover_card": "Fintech", "date of partnership": "Jun 2022", "fundraising": "Blossom led Kadmos' $31.9m Series A round.", "introduction_company_page": "Kadmos is revolutionizing salary payments for migrant workers. Kadmos has developed a payroll platform for companies that employ migrant workers which allows them to distribute pay to e-wallet accounts controlled by the worker.", "description_company_page": "Kadmos uses cutting-edge financial technology to make the salary journey of millions of migrant workers more transparent, convenient, and cheaper for both employers and employees. Kadmos’ mission is to bring the latest financial technology to these underserved communities of workers to help them protect and secure their salaries so they are safely able to remit their pay home to their families.\nKadmos was founded in February 2021 by Justus Schmueser and Sasha Makarovych. The pair created Kadmos after a relative of Makarovych’s, who worked as a seafarer, told him of the complexity and hardship involved in getting paid.", "sector_company_page": "Fintech", "investment_details_company_page": "Investment Total"}, {"name": "Localyze", "sector": "SaaS / HR", "country": "Germany", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Jun 2021", "fundraising": "Blossom led Localyze's $12m Series A.", "introduction_company_page": "Localyze is an all-in-one platform that enables HR, employees & prospective hires to manage all administrative processes of a relocation. ", "description_company_page": "Relocation for work can be intensely stressful, visa processes opaque and confusing, both to employers and new hires. Solving the administrative headache not only enables companies to hire more efficiently, but great improves employee experience. As the talent market becomes ever more global, making international transitions seamless has never been as important.\nLocalyze was founded by Hanna Asmussen, a former management consultant, Lisa Dahlke, a HR Specialist and Franzi Löw, a researcher in Industrial Economics.\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Localyze's $12m Series A."}, {"name": "Moonpay", "sector": "Infrastructure / Crypto", "country": "Remote", "sector_hover_card": "Crypto", "date of partnership": "Sept 2021", "fundraising": "Blossom invested prior to Moonpay's $555m Series A with Tiger Global, Coatue, Thrive, Paradigm, and NEA.", "introduction_company_page": "Moonpay provides a fiat to crypto on-ramp, enabling merchants to offer customers the ability to exchange fiat-to-crypto currency immediately.", "description_company_page": "Moonpay is democratising access to crypto, with its world-leading on-ramp solution. By giving developers the tools they need to onboard new crypto users in a fast, reliable and compliant manner, Moonpay will allow billions of users to create trillions of dollars of value in crypto.\nMoonpay was founded by Ivan Soto-Wright and Victor Faramond out of HODL, their crypto venture studio.\n‍", "sector_company_page": "Crypto", "investment_details_company_page": "Investment Total\nBlossom invested prior to Moonpay's $555m Series A with Tiger Global, Coatue, Thrive, Paradigm, and NEA."}, {"name": "Pie", "sector": "SaaS / Developer Tools", "country": "Czech Republic", "sector_hover_card": "Dev Tools", "date of partnership": "Oct 2020", "fundraising": "Blossom co-led Pie's $6.5m Seed round alongside Coatue and Addition.", "introduction_company_page": "Pie enables developers to produce and consume APIs more effectively to build the tools, apps and technologies we rely on.", "description_company_page": "Whether it's exploring an API, testing it or using it to pull data, API users often go beyond developers to product managers, data analysts and others. As the world increasingly becomes API driven, interacting with and collaborating on APIs should be as easy at working with a website or mobile app. \nHTTPie was founded by Jakub Roztocil who previously founded the popular open-source project of the same name.\n‍", "sector_company_page": "Dev Tools", "investment_details_company_page": "Investment Total\nBlossom co-led Pie's $6.5m Seed round alongside Coatue and Addition."}, {"name": "Pigment", "sector": "SaaS / Fintech", "country": "France", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Jul 2020", "fundraising": "Blossom led Pigment’s $26m Series A round. Pigment has since raised a $73m Series B from Greenoaks.", "introduction_company_page": "Pigment offers an intuitive, visually-driven experience to forecast the future of your business. With flexible parameters and continuous forecasting, Pigment brings future scenarios to life through charts, models and simulations.", "description_company_page": "Financial planning is becoming ever more complex, yet the majority of enterprises still rely heavily on spreadsheets, which were never designed to be used at this scale with models with thousands of calculations and data sources. Better financial modelling not only reduces errors but also allows for more complex models which give businesses a better understanding of how they operate and more accurate forecasting. \nPigment was founded by Eléonore Crespo, a former investor at Index Ventures and Romain Niccoli, who previously co-founded Criteo, solving a problem they'd both seen first hand\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Pigment’s $26m Series A round. Pigment has since raised a $73m Series B from Greenoaks."}, {"name": "Spacelift", "sector": "Infrastructure / Developer Tools", "country": "Poland", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Dec 2020", "fundraising": "Blossom led Spacelift’s $6m Series A round. Spacelift has since raised a $15m Series B from Insight Partners.", "introduction_company_page": "Spacelift integrates with popular Infrastructure as Code (IaC) management tools to allow you to customize workflows, automate manual tasks, reduce number of errors, improve security and auditability of your infrastructure.", "description_company_page": "System outages are increasingly driven by infrastructure errors; as infrastructure becomes code, devops teams want the same level of control and governance that has long been available to their developer counterparts.\nSpacelift was founded by Marcin Wyszynski, an engineer who previously worked at Deliveroo, Facebook and Google and Pawel Hytry, who was an MD at Foodpanda.\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led Spacelift’s $6m Series A round. Spacelift has since raised a $15m Series B from Insight Partners."}, {"name": "Sqreen", "sector": "Infrastructure / Security", "country": "France", "sector_hover_card": "Cybersecurity", "date of partnership": "Mar 2019", "fundraising": "Blossom invested in Sqreen’s $14m Series A alongside Greylock Partners. Acquired by Datadog.", "introduction_company_page": "Sqreen protects distributed applications against sophisticated attacks by automatically detecting and tracing vulnerabilities down to the line of code. Acquired by Datadog.", "description_company_page": "Security is shifting-left - from the security team to the development team, but developers often don't have the expertise in making systems secure. The only way for security to become ubiquitous is for it to be as easy as adding a few lines of code.\nSqreen was founded by Pierre Betouin and Jean-Baptiste Aviat, who both previously worked at Apple's Red Team.\n‍", "sector_company_page": "Cybersecurity", "investment_details_company_page": "Investment Total\nBlossom invested in Sqreen’s $14m Series A alongside Greylock Partners. Acquired by Datadog."}, {"name": "Superchat", "sector": "SaaS / Messenging", "country": "Germany", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Jan 2022", "fundraising": "Blossom led Superchat's $15.6m Series A round.", "introduction_company_page": null, "description_company_page": null, "sector_company_page": null, "investment_details_company_page": null}, {"name": "TheyDo", "sector": "SaaS / Collaboration", "country": "Amsterdam", "sector_hover_card": "Enterprise SaaS", "date of partnership": "Dec 2022", "fundraising": "Blossom led TheyDo's $12.7m Series A round.", "introduction_company_page": "TheyDo has created a Journey Management platform to connect people, processes, and products and turn them into opportunities for CX improvements across a company's customer journey.", "description_company_page": "Journey Management is an approach TheyDo devised that brings instant customer and company alignment. TheyDo scales service design by putting every decision in a journey-centric framework — showing precisely how journeys cut through teams, products, and services.\nIn 2019, Jochem van der Veer, Charles Beaumont, and Martin Palamarz transformed TheyDo from a consultancy company to a user-friendly software platform for customer journey management.\n‍", "sector_company_page": "Enterprise SaaS", "investment_details_company_page": "Investment Total\nBlossom led TheyDo's $12.7m Series A round."}, {"name": "Tines", "sector": "SaaS / Security", "country": "Ireland", "sector_hover_card": "Cybersecurity", "date of partnership": "Jul 2019", "fundraising": "Blossom led Tines’s $4.1M Series A. Tines has since raised an additional $37m from Accel, Index Ventures and Addition.", "introduction_company_page": "Tines makes the lives of security and operations teams on the frontlines easier through advanced, contextually aware automation. Connect to any REST API or web application in seconds.", "description_company_page": "Security teams are stretched as never before, yet a large part of a security analysts roles is routine work. By enabling analysts to automate their day-to-day work it allows them to focus on what really matters in defending their companies.\nTines was founded by Eoin Hinchy and Thomas Kinsella, who both previously worked in the security teams at Docusign and Ebay, building the product they wished they had in their previous jobs\n‍", "sector_company_page": "Cybersecurity", "investment_details_company_page": "Investment Total\nBlossom led Tines’s $4.1M Series A. Tines has since raised an additional $37m from Accel, Index Ventures and Addition."}, {"name": "zevoy", "sector": "Fintech / SaaS", "country": "Finland", "sector_hover_card": "Financial Services", "date of partnership": "April 2022", "fundraising": "Blossom led Zevoy's $16.5m Series A round.", "introduction_company_page": "Zevoy is the all-in-one expense management app simplifying company spending.", "description_company_page": "Zevoy is an expense management solution powered by Zevoy’s Business Card. Their technology, offered as a SaaS service, combines a business card, a receipt scanning app, and administration portal into one seamless expense management solution.\nThe core mission of Zevoy is to provide companies with efficient and simple alternatives to company spending by offering an all-In-one service linking smart payment cards with expense management. The company can do instant issuing, physical or virtual (Apple Pay, Google Pay), credit or prepaid cards. Zevoy is an Electronic Money Institution (EMI) authorized and supervised by the Finnish Financial Supervisory Authority.‍\n‍", "sector_company_page": "Financial Services", "investment_details_company_page": "Investment Total\nBlossom led Zevoy's $16.5m Series A round."}]